{
    "version": "0.0.1",
    "words": [
        {
            "word": "adenopathy",
            "prefix": "",
            "root": "aden-",
            "suffix": "-pathy",
            "meaning": "a disease or enlargement of the glands",
            "explanation": "Adenopathy refers to the abnormal enlargement of glands, which may be due to various conditions such as infection, inflammation, or cancer.",
            "chineseTranslation": "腺病",
            "traditionalChineseTranslation": "腺病",
            "lesson": 1
        },
        {
            "word": "carcinoma",
            "prefix": "carcin-",
            "root": "-oma",
            "suffix": "",
            "meaning": "A type of cancer that begins in the skin or in tissues that line or cover internal organs.",
            "explanation": "Carcinomas are malignant tumors that arise from epithelial cells. They can occur in any organ and are the most common type of cancer.",
            "chineseTranslation": "癌瘤",
            "traditionalChineseTranslation": "癌瘤",
            "lesson": 1
        },
        {
            "word": "cardiac",
            "prefix": "cardio-",
            "root": "card",
            "suffix": "-ac",
            "meaning": "pertaining to the heart",
            "explanation": "The term 'cardiac' is used in medical contexts to refer to anything related to the heart, such as cardiac arrest (when the heart stops beating) or cardiac surgery.",
            "chineseTranslation": "心脏的",
            "traditionalChineseTranslation": "心臟的",
            "lesson": 1
        },
        {
            "word": "chemotherapy",
            "prefix": "chemo-",
            "root": "therap-",
            "suffix": "-y",
            "meaning": "the treatment of disease, particularly cancer, using chemical substances or drugs.",
            "explanation": "Chemotherapy is primarily used to treat cancer by using powerful chemicals to kill fast-growing cells in the body. It can also be used to treat other diseases, such as autoimmune disorders.",
            "chineseTranslation": "化学治疗",
            "traditionalChineseTranslation": "化學治療",
            "lesson": 1
        },
        {
            "word": "incision",
            "prefix": "in-",
            "root": "cis",
            "suffix": "-ion",
            "meaning": "A surgical cut made in skin or flesh.",
            "explanation": "An incision is typically made by a surgeon to access the underlying tissues and organs for surgical procedures.",
            "chineseTranslation": "切口",
            "traditionalChineseTranslation": "切口",
            "lesson": 1
        },
        {
            "word": "dermatology",
            "prefix": "derm-",
            "root": "-logy",
            "suffix": "",
            "meaning": "the branch of medicine dealing with the skin and its diseases",
            "explanation": "Dermatology is the medical specialty concerned with the diagnosis and treatment of skin disorders, which can include cosmetic concerns as well as medical conditions.",
            "chineseTranslation": "皮肤病学",
            "traditionalChineseTranslation": "皮膚病學",
            "lesson": 1
        },
        {
            "word": "enteric",
            "prefix": "",
            "root": "enter",
            "suffix": "-ic",
            "meaning": "pertaining to the intestine",
            "explanation": "Enteric refers to anything that is related to the intestines, specifically the small intestine. It is often used in medical contexts to describe conditions, infections, or actions that occur within the intestinal tract.",
            "chineseTranslation": "肠的",
            "traditionalChineseTranslation": "腸的",
            "lesson": 1
        },
        {
            "word": "gastric",
            "prefix": "",
            "root": "gastr-",
            "suffix": "-ic",
            "meaning": "pertaining to the stomach",
            "explanation": "The term 'gastric' is used to describe anything related to the stomach. It can refer to processes, conditions, or diseases associated with the stomach.",
            "chineseTranslation": "胃的",
            "traditionalChineseTranslation": "胃的",
            "lesson": 1
        },
        {
            "word": "gynecology",
            "prefix": "gyne-",
            "root": "-cology",
            "suffix": "",
            "meaning": "The branch of medicine that deals with the physiological and pathological aspects of women's reproductive systems.",
            "explanation": "Gynecology focuses on women's health, particularly regarding the female reproductive system, including the diagnosis and treatment of disorders related to the ovaries, uterus, vagina, and breasts.",
            "chineseTranslation": "妇科",
            "traditionalChineseTranslation": "婦科",
            "lesson": 1
        },
        {
            "word": "hematic",
            "prefix": "hema-",
            "root": "tic",
            "suffix": "",
            "meaning": "Relating to blood.",
            "explanation": "The term 'hematic' pertains to blood or blood components and is often used in medical contexts to describe conditions, tests, or substances that involve blood.",
            "chineseTranslation": "血液的",
            "traditionalChineseTranslation": "血液的",
            "lesson": 1
        },
        {
            "word": "hydrocele",
            "meaning": "A fluid-filled sac surrounding a testicle that results in swelling of the scrotum.",
            "chineseTranslation": "阴囊水肿",
            "traditionalChineseTranslation": "陰囊水腫",
            "explanation": "Hydrocele occurs when fluid collects in the scrotum, often leading to swelling and discomfort but typically not causing pain. It can develop due to various reasons, including injury or inflammation.",
            "prefix": "hydro-",
            "root": "cele",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "immunology",
            "prefix": "immuno-",
            "root": "logy",
            "suffix": "",
            "meaning": "the branch of medicine and biology concerned with immunity",
            "explanation": "Immunology is the study of the immune system, understanding how the body defends itself against infections and diseases. It involves the investigation of all aspects of the immune system, including its structure and function, as well as the abnormalities that can lead to immune disorders.",
            "chineseTranslation": "免疫学",
            "traditionalChineseTranslation": "免疫學",
            "lesson": 1
        },
        {
            "word": "laryngeal",
            "prefix": "laryng-",
            "root": "",
            "suffix": "-eal",
            "meaning": "pertaining to the larynx (voice box)",
            "chineseTranslation": "喉部的",
            "traditionalChineseTranslation": "喉部的",
            "explanation": "The term laryngeal is used to describe anything related to the larynx, which is a crucial structure in the respiratory system involved in voice production and protecting the airway during swallowing.",
            "lesson": 1
        },
        {
            "word": "morphology",
            "prefix": "",
            "root": "morph",
            "suffix": "-ology",
            "meaning": "The study of the form and structure of organisms or their specific structural features.",
            "explanation": "Morphology encompasses the investigation of the shape, size, arrangement, and type of cells, tissues, or organs in living organisms. It is a fundamental branch of biology and also applies to the study of word formation in linguistics.",
            "chineseTranslation": "形态学",
            "traditionalChineseTranslation": "形態學",
            "lesson": 1
        },
        {
            "word": "nephromegaly",
            "prefix": "nephro-",
            "root": "megaly",
            "suffix": "",
            "meaning": "enlargement of the kidney",
            "explanation": "Nephromegaly refers to the abnormal enlargement of one or both kidneys. This condition can be caused by various factors, including kidney disease, obstruction of urine flow, or conditions affecting kidney structure.",
            "chineseTranslation": "肾肥大",
            "traditionalChineseTranslation": "腎肥大",
            "lesson": 1
        },
        {
            "word": "neural",
            "meaning": "Relating to nerves or the nervous system.",
            "chineseTranslation": "神经的",
            "traditionalChineseTranslation": "神經的",
            "explanation": "The term 'neural' refers to anything associated with the nerves, which are the bundles of fibers that transmit signals between the brain and other parts of the body.",
            "prefix": "",
            "root": "neur",
            "suffix": "al",
            "lesson": 1
        },
        {
            "word": "ophthalmic",
            "prefix": "ophthalm-",
            "root": "",
            "suffix": "-ic",
            "meaning": "pertaining to the eye",
            "explanation": "Ophthalmic refers to anything related to the eyes, often used in medical and anatomical contexts to describe the structures, conditions, or treatments related to the eye.",
            "chineseTranslation": "眼科的",
            "traditionalChineseTranslation": "眼科的",
            "lesson": 1
        },
        {
            "word": "otic",
            "meaning": "Relating to the ear.",
            "chineseTranslation": "耳的",
            "traditionalChineseTranslation": "耳的",
            "explanation": "The term 'otic' is used in medical contexts to refer to anything pertaining to the ear, including conditions, treatments, and anatomy.",
            "prefix": "",
            "root": "ot/o",
            "suffix": "ic",
            "lesson": 1
        },
        {
            "word": "pathology",
            "prefix": "patho-",
            "root": "logy",
            "suffix": "",
            "meaning": "The study of diseases and their effects on the body.",
            "explanation": "Pathology is a branch of medicine that focuses on the study of the causes, effects, and nature of diseases. It includes the examination of tissues, organs, bodily fluids, and autopsies to understand disease mechanisms and diagnosis.",
            "chineseTranslation": "病理学",
            "traditionalChineseTranslation": "病理學",
            "lesson": 1
        },
        {
            "word": "pulmonary",
            "prefix": "pulmo-",
            "root": "",
            "suffix": "-ary",
            "meaning": "relating to the lungs",
            "explanation": "The term 'pulmonary' is used to describe anything pertaining to the lungs, including conditions, functions, or anatomical structures associated with the respiratory system.",
            "chineseTranslation": "肺的",
            "traditionalChineseTranslation": "肺的",
            "lesson": 1
        },
        {
            "word": "rhinoplasty",
            "prefix": "rhino-",
            "root": "plasty",
            "suffix": "",
            "meaning": "Surgical repair or reshaping of the nose.",
            "explanation": "Rhinoplasty is a type of cosmetic surgery performed on the nose to change its shape or improve its function. It can be done for aesthetic reasons or to correct breathing problems associated with structural defects in the nose.",
            "chineseTranslation": "鼻整形术",
            "traditionalChineseTranslation": "鼻整形術",
            "lesson": 1
        },
        {
            "word": "urology",
            "prefix": "uro-",
            "root": "logy",
            "suffix": "",
            "meaning": "the branch of medicine that deals with the urinary system and male reproductive organs",
            "explanation": "Urology is a medical specialty that focuses on the diagnosis and treatment of disorders related to the urinary tract in both men and women, as well as issues concerning male reproductive organs.",
            "chineseTranslation": "泌尿学",
            "traditionalChineseTranslation": "泌尿學",
            "lesson": 1
        },
        {
            "word": "aphasia",
            "prefix": "a-",
            "root": "phasia",
            "suffix": "",
            "meaning": "A disorder characterized by the inability to express or understand spoken or written language.",
            "explanation": "Aphasia is usually caused by damage to the language centers of the brain, often due to a stroke, head injury, or other neurological condition.",
            "chineseTranslation": "失語症",
            "traditionalChineseTranslation": "失語症",
            "lesson": 1
        },
        {
            "word": "anoxia",
            "prefix": "an-",
            "root": "ox",
            "suffix": "-ia",
            "meaning": "a deficiency of oxygen in the tissues",
            "explanation": "Anoxia refers to a state where there is a severe lack of oxygen, often leading to tissue damage and impaired function. It can be caused by various factors, including high altitudes, drowning, or certain medical conditions.",
            "chineseTranslation": "缺氧",
            "traditionalChineseTranslation": "缺氧",
            "lesson": 1
        },
        {
            "word": "antepartum",
            "prefix": "ante-",
            "root": "partum",
            "suffix": "",
            "meaning": "The period of time before childbirth.",
            "explanation": "Antepartum refers to the time frame during pregnancy that occurs before the onset of labor and delivery. It is used to describe events or situations that happen during the gestation period leading up to childbirth.",
            "chineseTranslation": "产前",
            "traditionalChineseTranslation": "產前",
            "lesson": 1
        },
        {
            "word": "antibiotic",
            "meaning": "A substance that kills or inhibits the growth of bacteria and is used to treat bacterial infections.",
            "chineseTranslation": "抗生素",
            "traditionalChineseTranslation": "抗生素",
            "explanation": "Antibiotics are used in the treatment of infections caused by bacteria. They can be naturally derived or synthetic and are essential in modern medicine for treating a variety of infections.",
            "prefix": "anti-",
            "root": "bio",
            "suffix": "-tic",
            "lesson": 1
        },
        {
            "word": "autograft",
            "prefix": "auto-",
            "root": "graft",
            "suffix": "",
            "meaning": "A tissue graft taken from one part of a person's body and transferred to another part of the same body.",
            "explanation": "Autografting is a surgical procedure where tissue is removed from one site and transplanted to another site on the same individual, typically used in skin, bone, and vascular surgeries to promote healing and restore function.",
            "chineseTranslation": "自体移植",
            "traditionalChineseTranslation": "自體移植",
            "lesson": 1
        },
        {
            "word": "bradycardia",
            "prefix": "brady-",
            "root": "cardi",
            "suffix": "-ia",
            "meaning": "abnormally slow heart rate",
            "explanation": "Bradycardia refers to a slower than normal heart rate, typically defined as fewer than 60 beats per minute in adults. It can be caused by various factors, including heart disease, certain medications, or changes in the body's physiological state.",
            "chineseTranslation": "心动过缓",
            "traditionalChineseTranslation": "心動過緩",
            "lesson": 1
        },
        {
            "word": "dyspnea",
            "prefix": "dys-",
            "root": "pnea",
            "suffix": "",
            "meaning": "difficult or labored breathing",
            "explanation": "Dyspnea is a medical term that describes the sensation of shortness of breath or difficulty in breathing. It can occur due to various medical conditions affecting the respiratory system, heart, or overall health.",
            "chineseTranslation": "呼吸困难",
            "traditionalChineseTranslation": "呼吸困難",
            "lesson": 1
        },
        {
            "word": "endoscope",
            "prefix": "endo-",
            "root": "scope",
            "suffix": "",
            "meaning": "A flexible tube with a light and a camera used to view the interior of a body part.",
            "explanation": "An endoscope is commonly used for diagnostic purposes in various medical specialties, allowing physicians to visualize and sometimes treat conditions within hollow organs or cavities.",
            "chineseTranslation": "内窥镜",
            "traditionalChineseTranslation": "內窺鏡",
            "lesson": 1
        },
        {
            "word": "epigastric",
            "prefix": "epi-",
            "root": "gastr",
            "suffix": "-ic",
            "meaning": "pertaining to the upper middle region of the abdomen",
            "explanation": "The term 'epigastric' is used to describe the area situated above the stomach and below the ribs. It often refers to pain or discomfort experienced in this region, which can be indicative of various gastrointestinal issues.",
            "chineseTranslation": "上腹部的",
            "traditionalChineseTranslation": "上腹部的",
            "lesson": 1
        },
        {
            "word": "eupnea",
            "prefix": "eu-",
            "root": "pnea",
            "suffix": "",
            "meaning": "normal, good, or unlabored breathing",
            "explanation": "Eupnea refers to the normal rhythm and depth of breathing that occurs during rest. It is a term used in medical contexts to differentiate between normal breathing and other forms of abnormal breathing patterns, such as apnea or dyspnea.",
            "chineseTranslation": "正常呼吸",
            "traditionalChineseTranslation": "正常呼吸",
            "lesson": 1
        },
        {
            "word": "heterograft",
            "prefix": "hetero-",
            "root": "graft",
            "suffix": "",
            "meaning": "A graft or transplant of tissue from a donor of a different species.",
            "explanation": "Heterografts are often used in medical procedures to replace or repair damaged tissue or organs, utilizing tissue from a different species (e.g., animal to human). This type of graft is distinct from an autograft (from the same person) or an allograft (from a donor of the same species).",
            "chineseTranslation": "异种移植物",
            "traditionalChineseTranslation": "異種移植物",
            "lesson": 1
        },
        {
            "word": "homozygous",
            "prefix": "homo-",
            "root": "zygous",
            "suffix": "",
            "meaning": "Having identical alleles of a particular gene or genes.",
            "explanation": "An organism is homozygous for a gene when it has two identical copies of that gene, one inherited from each parent. This can be contrasted with heterozygous, where the alleles are different.",
            "chineseTranslation": "纯合子",
            "traditionalChineseTranslation": "純合子",
            "lesson": 1
        },
        {
            "word": "hypertrophy",
            "prefix": "hyper-",
            "root": "trophy",
            "suffix": "",
            "meaning": "An increase in the size of an organ or tissue due to the enlargement of its cells.",
            "explanation": "Hypertrophy often occurs in response to increased workload or stress, commonly seen in muscles as a result of exercise or in the heart due to high blood pressure.",
            "chineseTranslation": "肥大",
            "traditionalChineseTranslation": "肥大",
            "lesson": 1
        },
        {
            "word": "hypoglossal",
            "prefix": "hypo-",
            "root": "gloss",
            "suffix": "-al",
            "meaning": "pertaining to below the tongue",
            "explanation": "The term hypoglossal refers to structures or functions that occur beneath the tongue, often used in the context of the hypoglossal nerve, which controls the movements of the tongue.",
            "chineseTranslation": "舌下的",
            "traditionalChineseTranslation": "舌下的",
            "lesson": 1
        },
        {
            "word": "infraorbital",
            "prefix": "infra-",
            "root": "orbital",
            "suffix": "",
            "meaning": "Pertaining to the area beneath the eye socket (orbital region).",
            "explanation": "The term 'infraorbital' is used in anatomy to describe structures or conditions that exist below the orbit, which is the bony cavity that houses the eye. The infraorbital region is significant in various medical contexts, including facial anatomy and surgery.",
            "chineseTranslation": "眶下的",
            "traditionalChineseTranslation": "眶下的",
            "lesson": 1
        },
        {
            "word": "intervertebral",
            "meaning": "Pertaining to the area between two vertebrae.",
            "chineseTranslation": "椎间的",
            "traditionalChineseTranslation": "椎間的",
            "explanation": "The term describes the space or tissue that exists between the vertebrae, which are the bony segments of the spine.",
            "prefix": "inter-",
            "root": "vertebra",
            "suffix": "-al",
            "lesson": 1
        },
        {
            "word": "intravenous",
            "prefix": "intra-",
            "root": "ven",
            "suffix": "-ous",
            "meaning": "Within or by way of the veins.",
            "explanation": "Intravenous refers to the administration of substances directly into a vein, typically used for the delivery of medications, fluids, or nutrients.",
            "chineseTranslation": "静脉内的",
            "traditionalChineseTranslation": "靜脈內的",
            "lesson": 1
        },
        {
            "word": "macrocephalic",
            "prefix": "macro-",
            "root": "cephal",
            "suffix": "-ic",
            "meaning": "Having an abnormally large head.",
            "explanation": "The term macrocephalic refers to a condition where an individual has a head circumference that is significantly larger than the average for their age and gender. This can be due to various medical conditions, such as hydrocephalus or genetic disorders.",
            "chineseTranslation": "巨大头",
            "traditionalChineseTranslation": "巨大頭",
            "lesson": 1
        },
        {
            "word": "microcephalic",
            "meaning": "Having an abnormally small head, often associated with developmental abnormalities.",
            "chineseTranslation": "小头症的",
            "traditionalChineseTranslation": "小頭症的",
            "explanation": "Microcephalic refers to individuals or conditions characterized by a significantly smaller than average head size, which can be a result of genetic factors, environmental influences, or nutritional deficiencies during pregnancy, often leading to cognitive or developmental issues.",
            "prefix": "micro-",
            "root": "cephal",
            "suffix": "-ic",
            "lesson": 1
        },
        {
            "word": "neonate",
            "prefix": "neo-",
            "root": "nat-",
            "suffix": "-ate",
            "meaning": "a newborn child, especially one less than four weeks old",
            "explanation": "The term 'neonate' refers specifically to infants in the early stages of life, typically defined as the first 28 days after birth. During this period, healthcare providers monitor the neonate closely for any signs of health issues.",
            "chineseTranslation": "新生儿",
            "traditionalChineseTranslation": "新生兒",
            "lesson": 1
        },
        {
            "word": "pancarditis",
            "prefix": "pan-",
            "root": "card",
            "suffix": "-itis",
            "meaning": "inflammation of all layers of the heart.",
            "explanation": "Pancarditis refers to a condition where there is inflammation affecting the entire heart, including the pericardium, myocardium, and endocardium. It often occurs in infectious diseases or autoimmune conditions.",
            "chineseTranslation": "全心炎",
            "traditionalChineseTranslation": "全心炎",
            "lesson": 1
        },
        {
            "word": "paranasal",
            "prefix": "para-",
            "root": "nasal",
            "suffix": "",
            "meaning": "Referring to the regions near the nasal cavities.",
            "explanation": "The term paranasal is used to describe areas that are located alongside or adjacent to the nasal cavity, often used in the context of paranasal sinuses, which are air-filled spaces surrounding the nasal cavity that can be involved in sinus infections and other medical conditions.",
            "chineseTranslation": "鼻旁的",
            "traditionalChineseTranslation": "鼻旁的",
            "lesson": 1
        },
        {
            "word": "percutaneous",
            "meaning": "Performed through the skin, typically referring to medical procedures or interventions.",
            "chineseTranslation": "经皮的",
            "traditionalChineseTranslation": "經皮的",
            "explanation": "Percutaneous procedures allow access to the body through the skin, minimizing the need for invasive surgeries. Common examples include percutaneous coronary intervention (PCI) and percutaneous biopsy.",
            "prefix": "per-",
            "root": "cutane",
            "suffix": "-ous",
            "lesson": 1
        },
        {
            "word": "pericardial",
            "prefix": "peri-",
            "root": "cardi",
            "suffix": "-al",
            "meaning": "pertaining to the pericardium, the membrane surrounding the heart",
            "explanation": "The term 'pericardial' refers to anything related to the pericardium, which is the protective sac enclosing the heart. It plays an essential role in protecting the heart and allowing it to function smoothly.",
            "chineseTranslation": "心包的",
            "traditionalChineseTranslation": "心包的",
            "lesson": 1
        },
        {
            "word": "postpartum",
            "prefix": "post-",
            "root": "partum",
            "suffix": "",
            "meaning": "Relating to the period of time immediately after childbirth.",
            "explanation": "Postpartum refers to the period following the delivery of a baby, encompassing physical and emotional changes and challenges that a mother may experience during this time.",
            "chineseTranslation": "产后",
            "traditionalChineseTranslation": "產後",
            "lesson": 1
        },
        {
            "word": "prefrontal",
            "prefix": "pre-",
            "root": "frontal",
            "suffix": "",
            "meaning": "Relating to the front part of the frontal lobe of the brain.",
            "explanation": "The term 'prefrontal' refers to the area of the frontal lobe of the brain that is located in front of the primary motor cortex. This region is involved in complex cognitive behavior, decision making, and moderating social behavior.",
            "chineseTranslation": "前额叶的",
            "traditionalChineseTranslation": "前額葉的",
            "lesson": 1
        },
        {
            "word": "pseudocyesis",
            "meaning": "a condition in which a person believes they are pregnant but are not; often referred to as a false pregnancy.",
            "chineseTranslation": "假孕",
            "traditionalChineseTranslation": "假孕",
            "explanation": "Pseudocyesis can involve physical symptoms that resemble those of pregnancy, such as abdominal swelling, breast changes, and even sensations of fetal movement, but these symptoms occur without a real pregnancy.",
            "prefix": "pseudo-",
            "root": "cyesis",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "retrograde",
            "meaning": "moving backward or reversing direction, often used to describe certain movements in medical terms related to bodily functions or actions",
            "chineseTranslation": "逆行的",
            "traditionalChineseTranslation": "逆行的",
            "explanation": "In medicine, 'retrograde' is often used to describe processes that occur in a backward manner, such as the retrograde flow of urine from the bladder towards the kidneys.",
            "prefix": "retro-",
            "root": "grade",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "subcutaneous",
            "prefix": "sub-",
            "root": "cutane",
            "suffix": "-ous",
            "meaning": "pertaining to the layer of tissue beneath the skin",
            "explanation": "The term subcutaneous refers to the layer of tissue located under the skin. This tissue contains fat and connective tissue and is crucial for insulation and energy storage.",
            "chineseTranslation": "皮下的",
            "traditionalChineseTranslation": "皮下的",
            "lesson": 1
        },
        {
            "word": "supernumerary",
            "meaning": "denoting a person or thing that is in excess of the usual number; an additional or extra.",
            "chineseTranslation": "多余的",
            "traditionalChineseTranslation": "多餘的",
            "explanation": "In medical terms, 'supernumerary' often refers to additional organs, structures, or limbs beyond the normal anatomical number. For example, supernumerary teeth are extra teeth beyond the typical set.",
            "prefix": "super-",
            "root": "numer",
            "suffix": "-ary",
            "lesson": 1
        },
        {
            "word": "suprapubic",
            "meaning": "Referring to the area located above the pubic bone.",
            "chineseTranslation": "耻骨上",
            "traditionalChineseTranslation": "恥骨上",
            "explanation": "The term 'suprapubic' is commonly used in medicine to describe procedures, pain, or anatomy related to the region of the body that is situated above the pubic bone, often concerning the bladder and reproductive organs.",
            "prefix": "supra-",
            "root": "pubic",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "tachycardia",
            "meaning": "an abnormally rapid heart rate, typically defined as a heart rate over 100 beats per minute in adults",
            "chineseTranslation": "心动过速",
            "traditionalChineseTranslation": "心動過速",
            "explanation": "Tachycardia can be caused by various factors including stress, anxiety, fever, and underlying health conditions such as heart disease. It can be a normal response during exercise or can indicate a medical issue that requires further investigation.",
            "prefix": "tachy-",
            "root": "card",
            "suffix": "-ia",
            "lesson": 1
        },
        {
            "word": "transurethral",
            "prefix": "trans-",
            "root": "urethr-",
            "suffix": "-al",
            "meaning": "pertaining to across or through the urethra",
            "explanation": "Transurethral procedures involve surgical or diagnostic interventions that are performed through the urethra, typically to treat conditions of the bladder or prostate.",
            "chineseTranslation": "经尿道的",
            "traditionalChineseTranslation": "經尿道的",
            "lesson": 1
        },
        {
            "word": "ultrasound",
            "prefix": "ultra-",
            "root": "sound",
            "suffix": "",
            "meaning": "A medical imaging technique that uses high-frequency sound waves to create images of organs and structures inside the body.",
            "explanation": "Ultrasound is commonly used for diagnostic purposes, such as monitoring fetal development during pregnancy or evaluating organs like the heart, liver, and kidneys. It is non-invasive and does not use ionizing radiation.",
            "chineseTranslation": "超声波",
            "traditionalChineseTranslation": "超聲波",
            "lesson": 1
        },
        {
            "word": "bilateral",
            "prefix": "bi-",
            "root": "later",
            "suffix": "-al",
            "meaning": "pertaining to or affecting both sides",
            "explanation": "The term 'bilateral' is used in medical contexts to describe conditions or procedures that involve both sides of the body, such as bilateral pneumonia affecting both lungs.",
            "chineseTranslation": "双侧的",
            "traditionalChineseTranslation": "雙側的",
            "lesson": 1
        },
        {
            "word": "hemiplegia",
            "meaning": "paralysis of one side of the body",
            "chineseTranslation": "半身不遂",
            "traditionalChineseTranslation": "半身不遂",
            "explanation": "Hemiplegia is a condition characterized by the complete or partial paralysis of one side of the body, often caused by a stroke or brain injury.",
            "prefix": "hemi-",
            "root": "plegia",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "monoplegia",
            "meaning": "Paralysis of a single limb or muscle group.",
            "chineseTranslation": "单瘫",
            "traditionalChineseTranslation": "單癱",
            "explanation": "Monoplegia is a condition characterized by the paralysis of one limb, which can result from various neurological conditions, injuries, or diseases that affect the nervous system.",
            "prefix": "mono-",
            "root": "pleg",
            "suffix": "-ia",
            "lesson": 1
        },
        {
            "word": "multipara",
            "prefix": "multi-",
            "root": "para",
            "suffix": "",
            "meaning": "A woman who has had multiple pregnancies that have resulted in viable offspring.",
            "explanation": "The term 'multipara' is used in obstetrics to describe a woman who has given birth multiple times to live children, as opposed to 'nullipara' (a woman who has never given birth) or 'primipara' (a woman who has given birth once). It indicates the number of pregnancies resulting in viable deliveries, regardless of whether the children are still alive.",
            "chineseTranslation": "多产妇",
            "traditionalChineseTranslation": "多產婦",
            "lesson": 1
        },
        {
            "word": "nulligravida",
            "prefix": "nulli-",
            "root": "gravida",
            "suffix": "",
            "meaning": "A woman who has never been pregnant.",
            "explanation": "The term combines 'nulli-', meaning none, and 'gravida', meaning pregnant, to denote a female who has never experienced pregnancy.",
            "chineseTranslation": "未孕妇",
            "traditionalChineseTranslation": "未孕婦",
            "lesson": 1
        },
        {
            "word": "polyuria",
            "prefix": "poly-",
            "root": "uria",
            "suffix": "",
            "meaning": "The condition of producing abnormally large volumes of urine.",
            "explanation": "Polyuria is often a symptom of underlying health issues such as diabetes mellitus, diabetes insipidus, or other conditions that affect the body's ability to regulate fluid balance.",
            "chineseTranslation": "多尿",
            "traditionalChineseTranslation": "多尿",
            "lesson": 1
        },
        {
            "word": "quadriplegia",
            "prefix": "quadri-",
            "root": "pleg",
            "suffix": "-ia",
            "meaning": "paralysis of all four limbs",
            "explanation": "Quadriplegia is a condition characterized by the loss of sensation and movement in all four limbs due to spinal cord injury or disease affecting the cervical region of the spine.",
            "chineseTranslation": "四肢癱瘓",
            "traditionalChineseTranslation": "四肢癱瘓",
            "lesson": 1
        },
        {
            "word": "semiconscious",
            "prefix": "semi-",
            "root": "conscious",
            "suffix": "",
            "meaning": "Partially awake or aware.",
            "explanation": "The term 'semiconscious' describes a state wherein a person is not fully conscious or aware of their surroundings but is not completely asleep. This can occur in various medical conditions, such as during recovery from anesthesia or in cases of certain head injuries.",
            "chineseTranslation": "半意识的",
            "traditionalChineseTranslation": "半意識的",
            "lesson": 1
        },
        {
            "word": "triceps",
            "prefix": "tri-",
            "root": "ceps",
            "suffix": "",
            "meaning": "A muscle having three origins or heads.",
            "explanation": "The triceps is a large muscle on the back of the upper arm that is responsible for extending the forearm at the elbow. It consists of three heads: the long head, lateral head, and medial head, which work together to facilitate this movement.",
            "chineseTranslation": "肱三头肌",
            "traditionalChineseTranslation": "肱三頭肌",
            "lesson": 1
        },
        {
            "word": "unilateral",
            "prefix": "uni-",
            "root": "later",
            "suffix": "-al",
            "meaning": "Pertaining to or affecting only one side.",
            "explanation": "In medical terms, 'unilateral' is often used to describe conditions or symptoms that occur on one side of the body, such as unilateral headaches or unilateral paralysis.",
            "chineseTranslation": "单边的",
            "traditionalChineseTranslation": "單邊的",
            "lesson": 1
        },
        {
            "word": "vertebra",
            "meaning": "A small, bony segment of the spinal column.",
            "chineseTranslation": "脊椎",
            "traditionalChineseTranslation": "脊椎",
            "explanation": "Vertebrae are the individual bones that stack to form the vertebral column or spine, providing support and protection for the spinal cord.",
            "prefix": "",
            "root": "vertebr-",
            "suffix": "a",
            "lesson": 1
        },
        {
            "word": "vertebrae",
            "prefix": "",
            "root": "vertebra",
            "suffix": "e",
            "meaning": "The individual bones that make up the vertebral column (spine).",
            "explanation": "Vertebrae are the small bones that form the spine. They are critical for supporting the body, protecting the spinal cord, and allowing for movement.",
            "chineseTranslation": "椎骨",
            "traditionalChineseTranslation": "椎骨",
            "lesson": 1
        },
        {
            "word": "thorax",
            "meaning": "The part of the body between the neck and the abdomen, commonly referred to as the chest, containing vital organs such as the heart and lungs.",
            "chineseTranslation": "胸部",
            "traditionalChineseTranslation": "胸部",
            "explanation": "The thorax is a critical region in human anatomy that houses the thoracic cavity, which is encased by the rib cage and plays a crucial role in respiration and circulation.",
            "prefix": "",
            "root": "thorax",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "thoraces",
            "meaning": "The plural form of thorax, referring to the chest area in the body.",
            "chineseTranslation": "胸部",
            "traditionalChineseTranslation": "胸部",
            "explanation": "The thorax is the part of the body located between the neck and the abdomen, typically containing the lungs and heart. Thoraces refers to multiple instances of this area, commonly used in anatomical contexts.",
            "prefix": "",
            "root": "thorac-",
            "suffix": "-es",
            "lesson": 1
        },
        {
            "word": "appendix",
            "prefix": "",
            "root": "append",
            "suffix": "-ix",
            "meaning": "A small, tube-shaped pouch attached to the large intestine.",
            "explanation": "The appendix is a vestigial structure in the human body, which means it has lost most of its original function through evolution. It is often associated with appendicitis, which is an inflammation of the appendix.",
            "chineseTranslation": "阑尾",
            "traditionalChineseTranslation": "闌尾",
            "lesson": 1
        },
        {
            "word": "appendices",
            "prefix": "",
            "root": "appendix",
            "suffix": "-ices",
            "meaning": "Supplementary material at the end of a book or document; in medical context, it refers to additional anatomical structures related to the appendix.",
            "explanation": "In anatomy, appendices can refer to structures attached to a main part, such as the appendix which is a small pouch connected to the large intestine. In a broader context, it encompasses any supplementary information added to enhance understanding.",
            "chineseTranslation": "附录",
            "traditionalChineseTranslation": "附錄",
            "lesson": 1
        },
        {
            "word": "metastasis",
            "prefix": "meta-",
            "root": "stasis",
            "suffix": "",
            "meaning": "the spread of cancer cells from the primary site to other parts of the body",
            "explanation": "Metastasis refers to the process by which cancer cells break away from the original tumor, travel through the bloodstream or lymphatic system, and form new tumors in other organs or tissues.",
            "chineseTranslation": "转移",
            "traditionalChineseTranslation": "轉移",
            "lesson": 1
        },
        {
            "word": "metastases",
            "prefix": "meta-",
            "root": "stasis",
            "suffix": "-es",
            "meaning": "the spread of cancer cells from the primary tumor to other parts of the body",
            "explanation": "Metastases refer to the process through which cancer cells break away from their original (primary) tumor, travel through the bloodstream or lymphatic system, and form new tumors (secondary tumors) in other organs or tissues.",
            "chineseTranslation": "转移",
            "traditionalChineseTranslation": "轉移",
            "lesson": 1
        },
        {
            "word": "sarcoma",
            "prefix": "",
            "root": "sarc-",
            "suffix": "-oma",
            "meaning": "A type of cancer that originates in connective tissues such as bone, cartilage, fat, muscle, or blood vessels.",
            "explanation": "Sarcomas are tumors that arise from mesenchymal cells, which are cells that develop into connective tissues. They are distinct from carcinomas, which arise from epithelial cells. Sarcomas can occur in various locations in the body and can be aggressive in nature.",
            "chineseTranslation": "肉瘤",
            "traditionalChineseTranslation": "肉瘤",
            "lesson": 1
        },
        {
            "word": "sarcomata",
            "meaning": "A type of cancer that arises from connective tissues such as muscle, fat, blood vessels, and bone.",
            "chineseTranslation": "肉瘤",
            "traditionalChineseTranslation": "肉瘤",
            "explanation": "Sarcomata are malignant tumors that originate from mesenchymal tissues, which include bones, muscles, fat, and other connective tissues. They are distinct from carcinomas, which are cancers that start in epithelial cells.",
            "prefix": "",
            "root": "sarc- (from Greek, meaning 'flesh')",
            "suffix": "-oma (tumor)",
            "lesson": 1
        },
        {
            "word": "phalanx",
            "prefix": "",
            "root": "phalanx",
            "suffix": "",
            "meaning": "A bone in the finger or toe.",
            "explanation": "Phalanges are the long bones that make up the fingers of the hands and the toes of the feet. Each finger and toe consists of three phalanges, except for the thumb and big toe which have two.",
            "chineseTranslation": "指骨",
            "traditionalChineseTranslation": "指骨",
            "lesson": 1
        },
        {
            "word": "phalanges",
            "meaning": "The bones of the fingers and toes.",
            "chineseTranslation": "趾骨",
            "traditionalChineseTranslation": "趾骨",
            "explanation": "The phalanges are the digital bones in the hands and feet. Each finger and toe has three phalanges except for the thumb and big toe, which have two.",
            "prefix": "",
            "root": "phalang-",
            "suffix": "es",
            "lesson": 1
        },
        {
            "word": "ganglion",
            "prefix": "",
            "root": "gangli-",
            "suffix": "",
            "meaning": "A mass of nerve cell bodies located outside the central nervous system, or a cystic swelling associated with a joint or tendon.",
            "explanation": "Ganglia are structures that contain nerve cell bodies and serve as relay stations for nerve signals. They can also refer to ganglionic cysts, which are benign lumps that can occur near joints or tendons, usually filled with a jelly-like fluid.",
            "chineseTranslation": "神经节",
            "traditionalChineseTranslation": "神經節",
            "lesson": 1
        },
        {
            "word": "ganglia",
            "prefix": "",
            "root": "gangli-",
            "suffix": "-a",
            "meaning": "A cluster of nerve cell bodies in the peripheral nervous system.",
            "explanation": "Ganglia serve as relay stations for transmitting signals between the central nervous system and the peripheral nervous system. They can also process information locally.",
            "chineseTranslation": "神经节",
            "traditionalChineseTranslation": "神經節",
            "lesson": 1
        },
        {
            "word": "nucleus",
            "meaning": "The central part of a cell that contains genetic material and controls cellular activities.",
            "chineseTranslation": "细胞核",
            "traditionalChineseTranslation": "細胞核",
            "explanation": "In biology, the nucleus is a membrane-bound organelle found in eukaryotic cells. It houses the cell's DNA and coordinates activities such as growth, metabolism, and reproduction.",
            "prefix": "",
            "root": "nucleus",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "nuclei",
            "prefix": "",
            "root": "nucle-",
            "suffix": "i",
            "meaning": "the plural form of nucleus, which is the central part of an atom or a cell.",
            "explanation": "In the context of cells, the nuclei are membrane-bound organelles that contain the genetic material (DNA) of the cell. In atomic physics, nuclei refer to the positively charged center of an atom, composed of protons and neutrons.",
            "chineseTranslation": "细胞核",
            "traditionalChineseTranslation": "細胞核",
            "lesson": 1
        },
        {
            "word": "ovum",
            "meaning": "A female reproductive cell or gamete.",
            "chineseTranslation": "卵子",
            "traditionalChineseTranslation": "卵子",
            "explanation": "Ovum is the singular form of ova and is the largest cell in the human body. It is produced in the ovaries and is essential for sexual reproduction as it combines with sperm to form a zygote.",
            "prefix": "",
            "root": "ov-",
            "suffix": "-um",
            "lesson": 1
        },
        {
            "word": "ova",
            "meaning": "The plural form of ovum, which refers to the female reproductive cells or eggs in animals and humans.",
            "chineseTranslation": "卵子",
            "traditionalChineseTranslation": "卵子",
            "explanation": "Ova are crucial for reproduction, as they are female gametes that, when fertilized by a male sperm, can develop into a new organism.",
            "prefix": "",
            "root": "ov",
            "suffix": "a",
            "lesson": 1
        },
        {
            "word": "biopsy",
            "meaning": "The removal of a small piece of tissue for examination in order to diagnose a disease.",
            "chineseTranslation": "活检",
            "traditionalChineseTranslation": "活檢",
            "explanation": "A biopsy is commonly performed to determine whether cancer or other diseases are present in a tissue sample. It can involve different techniques, including needle, endoscopic, or surgical biopsy.",
            "prefix": "bio-",
            "root": "-opsy",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "biopsies",
            "prefix": "bio-",
            "root": "opsis",
            "suffix": "-ies",
            "meaning": "The removal and examination of tissue from a living body to diagnose a disease or condition.",
            "explanation": "Biopsies are commonly used to detect cancer, infections, and other conditions by analyzing tissues under a microscope.",
            "chineseTranslation": "活检",
            "traditionalChineseTranslation": "活檢",
            "lesson": 1
        },
        {
            "word": "gastralgia",
            "prefix": "gastr-",
            "root": "",
            "suffix": "-algia",
            "meaning": "pain in the stomach or abdominal pain",
            "explanation": "Gastralgia refers specifically to pain that originates in the stomach. It is not a specific diagnosis but rather a symptom that can be associated with various gastrointestinal disorders.",
            "chineseTranslation": "胃痛",
            "traditionalChineseTranslation": "胃痛",
            "lesson": 1
        },
        {
            "word": "cystocele",
            "meaning": "a condition in which the bladder bulges into the front wall of the vagina due to weakened tissues around the bladder",
            "chineseTranslation": "膀胱膨出",
            "traditionalChineseTranslation": "膀胱膨出",
            "explanation": "Cystocele is often caused by childbirth, obesity, or straining during bowel movements, and it can lead to urinary problems.",
            "prefix": "cysto-",
            "root": "cele",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "excise",
            "prefix": "ex-",
            "root": "cis",
            "suffix": "",
            "meaning": "To remove by cutting out",
            "explanation": "In a medical context, excise refers to the surgical removal of tissue or organs, typically to eliminate diseased or damaged parts.",
            "chineseTranslation": "切除",
            "traditionalChineseTranslation": "切除",
            "lesson": 1
        },
        {
            "word": "erythrocyte",
            "prefix": "erythro-",
            "root": "cyte",
            "suffix": "",
            "meaning": "A red blood cell that carries oxygen from the lungs to the body's tissues and takes carbon dioxide from the tissues back to the lungs.",
            "explanation": "Erythrocytes, or red blood cells, are specialized cells designed for the transport of oxygen. They contain hemoglobin, a protein that binds to oxygen molecules, enabling efficient gas exchange in the body.",
            "chineseTranslation": "红细胞",
            "traditionalChineseTranslation": "紅細胞",
            "lesson": 1
        },
        {
            "word": "cardiodynia",
            "prefix": "cardio-",
            "root": "dynia",
            "suffix": "",
            "meaning": "pain in the heart area",
            "explanation": "Cardiodynia refers to discomfort or pain perceived in the region of the heart. It is not specific to any particular condition and can signify various underlying problems related to the heart or nearby structures.",
            "chineseTranslation": "心痛",
            "traditionalChineseTranslation": "心痛",
            "lesson": 1
        },
        {
            "word": "bronchiectasis",
            "prefix": "bronch-",
            "root": "iectasis",
            "suffix": "",
            "meaning": "A condition characterized by the abnormal dilation of the bronchi, leading to chronic cough, production of sputum, and frequent respiratory infections.",
            "explanation": "Bronchiectasis occurs when the airways (bronchi) become damaged and dilated, often as a result of infections, autoimmune diseases, or prolonged mucus obstruction. This condition can lead to irreversible damage to the lungs and requires ongoing management.",
            "chineseTranslation": "支气管扩张症",
            "traditionalChineseTranslation": "支氣管擴張症",
            "lesson": 1
        },
        {
            "word": "mutagen",
            "prefix": "",
            "root": "mutat-",
            "suffix": "-gen",
            "meaning": "A substance that causes mutations in the DNA of organisms.",
            "explanation": "Mutagens can lead to changes in the genetic material, potentially resulting in cancer or other genetic diseases.",
            "chineseTranslation": "突变原",
            "traditionalChineseTranslation": "突變原",
            "lesson": 1
        },
        {
            "word": "osteogenesis",
            "prefix": "osteo-",
            "root": "genesis",
            "suffix": "",
            "meaning": "The formation and development of bone.",
            "explanation": "Osteogenesis refers to the process by which new bone is created in the body, especially during growth or repair of bone tissue.",
            "chineseTranslation": "骨生成",
            "traditionalChineseTranslation": "骨生成",
            "lesson": 1
        },
        {
            "word": "carcinogenic",
            "meaning": "Substance capable of causing cancer in living tissue.",
            "chineseTranslation": "致癌的",
            "traditionalChineseTranslation": "致癌的",
            "explanation": "Carcinogenic refers to agents or substances that are known or suspected to cause cancer. This can include chemical compounds, radiations, and biological agents. The term is commonly used in medical and health contexts to discuss cancer risks and prevention.",
            "prefix": "carcino-",
            "root": "gen",
            "suffix": "-ic",
            "lesson": 1
        },
        {
            "word": "hemiplegia",
            "prefix": "hemi-",
            "root": "plegia",
            "suffix": "",
            "meaning": "paralysis of one side of the body",
            "explanation": "Hemiplegia is a condition characterized by the total paralysis of one side of the body, often resulting from a stroke or brain injury that affects the motor pathways.",
            "chineseTranslation": "偏瘫",
            "traditionalChineseTranslation": "偏癱",
            "lesson": 1
        },
        {
            "word": "lithiasis",
            "prefix": "",
            "root": "lith-",
            "suffix": "-iasis",
            "meaning": "the formation of stones in the body, typically in the kidneys or gallbladder.",
            "explanation": "Lithiasis refers to the condition characterized by the presence of stones (calculi) in various organs, most commonly in the urinary system where it is called urolithiasis, or in the biliary system where it is called cholelithiasis.",
            "chineseTranslation": "结石症",
            "traditionalChineseTranslation": "結石症",
            "lesson": 1
        },
        {
            "word": "hypothyroidism",
            "meaning": "A condition in which the thyroid gland doesn't produce enough thyroid hormones.",
            "chineseTranslation": "甲状腺功能减退症",
            "traditionalChineseTranslation": "甲狀腺功能減退症",
            "explanation": "Hypothyroidism can lead to a variety of symptoms, including fatigue, weight gain, cold intolerance, and depression. It can be caused by autoimmune diseases, certain medications, or treatments for hyperthyroidism, among other factors.",
            "prefix": "hypo-",
            "root": "thyroid",
            "suffix": "-ism",
            "lesson": 1
        },
        {
            "word": "cellulitis",
            "meaning": "An infection of the skin and underlying tissues characterized by redness, swelling, and pain.",
            "chineseTranslation": "蜂窝组织炎",
            "traditionalChineseTranslation": "蜂窩組織炎",
            "explanation": "Cellulitis often occurs as a result of bacteria entering through a break in the skin. It typically affects the legs but can occur anywhere on the body. Symptoms include redness, swelling, warmth, and pain in the affected area, and it may be accompanied by fever.",
            "prefix": "",
            "root": "cellul-",
            "suffix": "-itis",
            "lesson": 1
        },
        {
            "word": "osteolysis",
            "meaning": "The destruction or dissolution of bone tissue.",
            "chineseTranslation": "骨溶解",
            "traditionalChineseTranslation": "骨溶解",
            "explanation": "Osteolysis occurs when there is an imbalance between bone resorption and bone formation, which can occur due to various conditions such as infections, tumors, or metabolic diseases.",
            "prefix": "osteo-",
            "root": "lysis",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "chondromalacia",
            "prefix": "chondro-",
            "root": "malacia",
            "suffix": "",
            "meaning": "A condition characterized by the softening and degeneration of cartilage.",
            "explanation": "Chondromalacia primarily affects the cartilage on the underside of the kneecap (patella) and is often associated with pain during movement.",
            "chineseTranslation": "软骨软化症",
            "traditionalChineseTranslation": "軟骨軟化症",
            "lesson": 1
        },
        {
            "word": "cardiomegaly",
            "prefix": "cardio-",
            "root": "megaly",
            "suffix": "",
            "meaning": "enlargement of the heart",
            "explanation": "Cardiomegaly is a medical condition characterized by an enlarged heart, which can be a result of various heart diseases, conditions, or other factors affecting heart size.",
            "chineseTranslation": "心脏肥大",
            "traditionalChineseTranslation": "心臟肥大",
            "lesson": 1
        },
        {
            "word": "cyanosis",
            "prefix": "cyan-",
            "root": "-osis",
            "suffix": "",
            "meaning": "A bluish discoloration of the skin and mucous membranes due to inadequate oxygenation of the blood.",
            "explanation": "Cyanosis occurs when there is an excessive amount of deoxyhemoglobin (i.e., hemoglobin without oxygen) in the blood, leading to a blue appearance in areas such as the lips, fingers, and toes. It is a sign of underlying respiratory or circulatory issues.",
            "chineseTranslation": "发绀",
            "traditionalChineseTranslation": "發紺",
            "lesson": 1
        },
        {
            "word": "myopathy",
            "prefix": "myo-",
            "root": "path",
            "suffix": "-y",
            "meaning": "A disease of muscle tissue.",
            "explanation": "Myopathy refers to any disease that affects the muscle fibers, leading to muscle weakness, pain, and loss of muscle function. It can be caused by genetic factors, metabolic conditions, or inflammatory processes.",
            "chineseTranslation": "肌病",
            "traditionalChineseTranslation": "肌病",
            "lesson": 1
        },
        {
            "word": "dysplasia",
            "prefix": "dys-",
            "root": "plasia",
            "suffix": "",
            "meaning": "Abnormal development or growth of tissues or cells.",
            "explanation": "Dysplasia is often used to describe an abnormal structure or growth in organs or tissues, usually indicative of pre-cancerous changes.",
            "chineseTranslation": "发育不良",
            "traditionalChineseTranslation": "發育不良",
            "lesson": 1
        },
        {
            "word": "neoplasm",
            "prefix": "neo-",
            "root": "plasm",
            "suffix": "",
            "meaning": "a new and abnormal growth of tissue in the body; can be benign or malignant.",
            "explanation": "Neoplasm refers to an abnormal growth of cells that may lead to tumors. These can be cancerous (malignant) or non-cancerous (benign). Neoplasms arise when the regulatory mechanisms that control cell growth and division fail, leading to uncontrolled cell proliferation.",
            "chineseTranslation": "肿瘤",
            "traditionalChineseTranslation": "腫瘤",
            "lesson": 1
        },
        {
            "word": "proctoptosis",
            "prefix": "procto-",
            "root": "ptosis",
            "suffix": "",
            "meaning": "Prolapse or downward displacement of the rectum.",
            "explanation": "Proctoptosis occurs when the rectum protrudes from the anus due to weakness or damage to the supporting tissues.",
            "chineseTranslation": "直肠下垂",
            "traditionalChineseTranslation": "直腸下垂",
            "lesson": 1
        },
        {
            "word": "hemorrhage",
            "prefix": "hem-",
            "root": "-orrhage",
            "suffix": "",
            "meaning": "excessive or profuse bleeding",
            "explanation": "Hemorrhage refers to an escape of blood from a ruptured blood vessel, which can occur internally or externally. It is often categorized into arterial, venous, or capillary hemorrhage depending on the type of vessel that has been compromised.",
            "chineseTranslation": "出血",
            "traditionalChineseTranslation": "出血",
            "lesson": 1
        },
        {
            "word": "rhinorrhea",
            "prefix": "rhino-",
            "root": "rrhea",
            "suffix": "",
            "meaning": "discharge of mucus from the nose",
            "explanation": "Rhinorrhea is commonly associated with conditions like allergies, colds, and infections, where excess mucus can lead to a runny nose.",
            "chineseTranslation": "流涕",
            "traditionalChineseTranslation": "流鼻水",
            "lesson": 1
        },
        {
            "word": "hysterorrhexis",
            "meaning": "Rupture of the uterus",
            "chineseTranslation": "子宫破裂",
            "traditionalChineseTranslation": "子宮破裂",
            "explanation": "Hysterorrhexis refers to the condition where there is a rupture or tearing of the uterus, often occurring during pregnancy or delivery. It can lead to severe complications for both the mother and the fetus.",
            "prefix": "hystero-",
            "root": "rhexis",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "arteriosclerosis",
            "meaning": "A condition characterized by the thickening and hardening of the arterial walls.",
            "chineseTranslation": "动脉硬化",
            "traditionalChineseTranslation": "動脈硬化",
            "explanation": "Arteriosclerosis refers to the loss of elasticity and the thickening of the arterial walls, which can lead to reduced blood flow and higher blood pressure. It is commonly associated with aging and can contribute to cardiovascular diseases.",
            "prefix": "",
            "root": "arteri/o",
            "suffix": "sclerosis",
            "lesson": 1
        },
        {
            "word": "angiostenosis",
            "prefix": "angio-",
            "root": "stenosis",
            "suffix": "",
            "meaning": "narrowing of a blood vessel",
            "explanation": "Angiostenosis refers to the constriction or narrowing of blood vessels, which can impede blood flow and can lead to various medical issues depending on the location and severity of the narrowing.",
            "chineseTranslation": "血管狭窄",
            "traditionalChineseTranslation": "血管狹窄",
            "lesson": 1
        },
        {
            "word": "chemotherapy",
            "prefix": "chemo-",
            "root": "therapy",
            "suffix": "",
            "meaning": "A treatment method that uses chemicals, typically to treat cancer.",
            "explanation": "Chemotherapy involves the use of chemicals to kill or slow the growth of cancer cells. It can also affect other rapidly dividing cells in the body, leading to side effects.",
            "chineseTranslation": "化学疗法",
            "traditionalChineseTranslation": "化學療法",
            "lesson": 1
        },
        {
            "word": "hypertrophy",
            "prefix": "hyper-",
            "root": "trophy",
            "suffix": "",
            "meaning": "An increase in the size of an organ or tissue through the enlargement of its cells.",
            "explanation": "Hypertrophy is often a response to increased workload or stress on a tissue, leading to the growth of muscle or organ tissue without an increase in the number of cells.",
            "chineseTranslation": "肥大",
            "traditionalChineseTranslation": "肥大",
            "lesson": 1
        },
        {
            "word": "cardiac",
            "prefix": "cardi-",
            "root": "",
            "suffix": "-ac",
            "meaning": "pertaining to the heart",
            "explanation": "The term 'cardiac' refers specifically to anything related to the heart, whether it be conditions, diseases, or other matters associated with the organ.",
            "chineseTranslation": "心脏的",
            "traditionalChineseTranslation": "心臟的",
            "lesson": 1
        },
        {
            "word": "duodenal",
            "prefix": "",
            "root": "duoden-",
            "suffix": "-al",
            "meaning": "pertaining to the duodenum, which is the first part of the small intestine.",
            "explanation": "The term 'duodenal' refers to anything related to the duodenum, which is responsible for the initial phase of digestion after food leaves the stomach. It plays a crucial role in the digestive process, breaking down food and absorbing nutrients.",
            "chineseTranslation": "十二指肠的",
            "traditionalChineseTranslation": "十二指腸的",
            "lesson": 1
        },
        {
            "word": "ovarian",
            "prefix": "ov-",
            "root": "ari",
            "suffix": "-an",
            "meaning": "pertaining to the ovaries",
            "explanation": "The term 'ovarian' describes anything that is related to or associated with the ovaries, which are the female reproductive organs responsible for producing eggs and hormones.",
            "chineseTranslation": "卵巢的",
            "traditionalChineseTranslation": "卵巢的",
            "lesson": 1
        },
        {
            "word": "ventricular",
            "prefix": "ventricul-",
            "root": "",
            "suffix": "-ar",
            "meaning": "relating to a ventricle, especially a heart ventricle.",
            "explanation": "The term 'ventricular' is used to describe anything that pertains to the ventricles of the heart. The heart has two ventricles (the right and left), which pump blood to the lungs and the rest of the body, respectively. This term is often used in contexts related to heart function, cardiovascular diseases, and treatments.",
            "chineseTranslation": "心室的",
            "traditionalChineseTranslation": "心室的",
            "lesson": 1
        },
        {
            "word": "pulmonary",
            "prefix": "pulmon-",
            "root": "",
            "suffix": "-ary",
            "meaning": "pertaining to the lungs",
            "explanation": "The term 'pulmonary' relates to anything that is connected to the lungs. It is often used in medical contexts to describe diseases, conditions, or procedures involving the respiratory system, specifically the lungs.",
            "chineseTranslation": "肺的",
            "traditionalChineseTranslation": "肺的",
            "lesson": 1
        },
        {
            "word": "esophageal",
            "prefix": "eso-",
            "root": "phag",
            "suffix": "-eal",
            "meaning": "pertaining to the esophagus",
            "explanation": "Esophageal refers to anything related to the esophagus, which is the tube that carries food from the throat to the stomach.",
            "chineseTranslation": "食道的",
            "traditionalChineseTranslation": "食道的",
            "lesson": 1
        },
        {
            "word": "gastric",
            "prefix": "gastr-",
            "root": "",
            "suffix": "-ic",
            "meaning": "pertaining to the stomach",
            "explanation": "The term 'gastric' describes anything related to the stomach. It is often used in medical contexts to refer to conditions, treatments, or functions involving the stomach.",
            "chineseTranslation": "胃的",
            "traditionalChineseTranslation": "胃的",
            "lesson": 1
        },
        {
            "word": "neurological",
            "meaning": "pertaining to the branch of medicine concerned with the study and treatment of disorders of the nervous system.",
            "chineseTranslation": "神經學的",
            "traditionalChineseTranslation": "神經學的",
            "explanation": "The term neurological refers to anything related to neurology, which studies the anatomy, functions, and disorders of the nervous system, including the brain, spinal cord, and peripheral nerves.",
            "prefix": "neuro-",
            "root": "log",
            "suffix": "-ical",
            "lesson": 1
        },
        {
            "word": "penile",
            "prefix": "",
            "root": "penis",
            "suffix": "-ile",
            "meaning": "pertaining to the penis",
            "explanation": "The term 'penile' refers to anything related to the penis, which is the male reproductive organ.",
            "chineseTranslation": "阴茎的",
            "traditionalChineseTranslation": "陰莖的",
            "lesson": 1
        },
        {
            "word": "superior",
            "meaning": "Higher in position, rank, or quality; above another.",
            "chineseTranslation": "上位的",
            "traditionalChineseTranslation": "上位的",
            "explanation": "In medical terminology, 'superior' is often used to denote structures that are located above or upwards in relation to other structures in the body.",
            "prefix": "",
            "root": "super",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "auditory",
            "prefix": "aud-",
            "root": "",
            "suffix": "-ory",
            "meaning": "relating to the sense of hearing",
            "explanation": "The term 'auditory' refers to anything pertaining to the sense of hearing, the auditory system, or the perception of sound.",
            "chineseTranslation": "听觉的",
            "traditionalChineseTranslation": "聽覺的",
            "lesson": 1
        },
        {
            "word": "adipose",
            "prefix": "",
            "root": "adip-",
            "suffix": "-ose",
            "meaning": "Relating to fat or fatty tissue.",
            "explanation": "The term adipose is commonly used to describe tissues in the body that store fat. These tissues, known as adipose tissues, play a crucial role in energy storage, insulation, and cushioning of organs.",
            "chineseTranslation": "脂肪的",
            "traditionalChineseTranslation": "脂肪的",
            "lesson": 1
        },
        {
            "word": "intravenous",
            "prefix": "intra-",
            "root": "ven",
            "suffix": "-ous",
            "meaning": "relating to or occurring within a vein",
            "explanation": "Intravenous refers to the administration of substances directly into a vein, allowing for quick absorption and effects in the bloodstream.",
            "chineseTranslation": "静脉内的",
            "traditionalChineseTranslation": "靜脈內的",
            "lesson": 1
        },
        {
            "word": "acoustic",
            "prefix": "a-",
            "root": "coust",
            "suffix": "-ic",
            "meaning": "relating to sound or the sense of hearing",
            "explanation": "The term 'acoustic' refers to the properties or qualities of sound. It is often used in the context of sound transmission and perception, including how sound is produced, transmitted, and perceived in different environments.",
            "chineseTranslation": "声学的",
            "traditionalChineseTranslation": "聲學的",
            "lesson": 1
        },
        {
            "word": "arthrocentesis",
            "prefix": "arthro-",
            "root": "centesis",
            "suffix": "",
            "meaning": "A medical procedure to withdraw fluid from a joint space using a needle.",
            "explanation": "Arthrocentesis is commonly performed to diagnose or treat joint disorders by extracting synovial fluid for analysis or reducing swelling in the joint.",
            "chineseTranslation": "关节穿刺",
            "traditionalChineseTranslation": "關節穿刺",
            "lesson": 1
        },
        {
            "word": "gastrectomy",
            "meaning": "Surgical removal of part or all of the stomach.",
            "chineseTranslation": "胃切除术",
            "traditionalChineseTranslation": "胃切除術",
            "explanation": "Gastrectomy is performed to treat various conditions, such as stomach cancer, severe obesity, or ulcers.",
            "prefix": "gastr-",
            "root": "ectomy",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "colostomy",
            "prefix": "",
            "root": "colost",
            "suffix": "-omy",
            "meaning": "A surgical procedure that creates an opening from the colon to the outside of the body.",
            "explanation": "Colostomy is performed to divert waste from the colon to a bag outside the body, often due to diseases of the colon, injury, or cancer.",
            "chineseTranslation": "结肠造口术",
            "traditionalChineseTranslation": "結腸造口術",
            "lesson": 1
        },
        {
            "word": "thoracotomy",
            "prefix": "thoraco-",
            "root": "tomy",
            "suffix": "",
            "meaning": "A surgical procedure involving an incision into the chest cavity.",
            "explanation": "Thoracotomy is performed to access the organs within the thoracic cavity, such as the lungs and heart, for diagnostic or therapeutic purposes.",
            "chineseTranslation": "胸腔切开术",
            "traditionalChineseTranslation": "胸腔切開術",
            "lesson": 1
        },
        {
            "word": "nephropexy",
            "prefix": "nephro-",
            "root": "pexy",
            "suffix": "",
            "meaning": "surgical fixation of a kidney",
            "explanation": "Nephropexy is a surgical procedure used to secure a floating or mobile kidney in its proper anatomical position.",
            "chineseTranslation": "肾固定术",
            "traditionalChineseTranslation": "腎固定術",
            "lesson": 1
        },
        {
            "word": "dermatoplasty",
            "meaning": "Surgical repair of the skin.",
            "chineseTranslation": "皮肤修复术",
            "traditionalChineseTranslation": "皮膚修復術",
            "explanation": "Dermatoplasty refers to a surgical procedure that involves the reconstruction or repair of the skin, often used to treat skin defects or injuries.",
            "prefix": "dermato-",
            "root": "plast",
            "suffix": "-y",
            "lesson": 1
        },
        {
            "word": "myorrhaphy",
            "meaning": "Surgical suturing or stitching of a muscle.",
            "chineseTranslation": "肌肉缝合术",
            "traditionalChineseTranslation": "肌肉縫合術",
            "explanation": "Myorrhaphy is a surgical procedure that involves stitching together the edges of a muscle after it has been cut or torn. This procedure helps in the healing and proper alignment of the muscle tissue.",
            "prefix": "myo-",
            "root": "rrhaphy",
            "suffix": "",
            "lesson": 1
        },
        {
            "word": "electrocardiogram",
            "prefix": "electro-",
            "root": "cardi-",
            "suffix": "-gram",
            "meaning": "A graphical representation of the electrical activity of the heart over time, measured by electrodes placed on the skin.",
            "explanation": "An electrocardiogram (ECG or EKG) displays the heart's rhythm, electrical activity, and any potential abnormalities in the heart's structure and function. It is commonly used in medical settings to diagnose heart conditions.",
            "chineseTranslation": "心电图",
            "traditionalChineseTranslation": "心電圖",
            "lesson": 1
        },
        {
            "word": "electrocardiograph",
            "prefix": "electro-",
            "root": "cardio",
            "suffix": "-graph",
            "meaning": "A medical instrument used to record the electrical activity of the heart.",
            "explanation": "An electrocardiograph measures the heart's electrical impulses, helping to diagnose heart conditions.",
            "chineseTranslation": "心电图机",
            "traditionalChineseTranslation": "心電圖機",
            "lesson": 1
        },
        {
            "word": "electrocardiography",
            "prefix": "electro-",
            "root": "cardi/o",
            "suffix": "-graphy",
            "meaning": "The process of recording the electrical activity of the heart over a period of time using electrodes placed on the skin.",
            "explanation": "Electrocardiography (ECG or EKG) is a diagnostic tool used to evaluate the heart's rhythm and detect issues such as arrhythmias, heart attacks, and other cardiac conditions.",
            "chineseTranslation": "心电图",
            "traditionalChineseTranslation": "心電圖",
            "lesson": 1
        },
        {
            "word": "audiometer",
            "prefix": "audio-",
            "root": "meter",
            "suffix": "",
            "meaning": "An instrument used to measure hearing acuity.",
            "explanation": "An audiometer is commonly used in audiology to determine the hearing level of an individual, typically in the context of diagnosing hearing loss or assessing auditory function.",
            "chineseTranslation": "听力计",
            "traditionalChineseTranslation": "聽力計",
            "lesson": 1
        },
        {
            "word": "audiometry",
            "prefix": "audio-",
            "root": "metri",
            "suffix": "-y",
            "meaning": "The measurement of hearing ability.",
            "explanation": "Audiometry tests the ability to hear sounds at various frequencies and intensities to determine hearing health.",
            "chineseTranslation": "听力测量",
            "traditionalChineseTranslation": "聽力測量",
            "lesson": 1
        },
        {
            "word": "gastroscope",
            "prefix": "gastro-",
            "root": "scope",
            "suffix": "",
            "meaning": "An instrument used for examining the interior of the stomach.",
            "explanation": "A gastroscope is a type of endoscope specifically designed to visualize the stomach and is often used in a procedure called gastroscopy to diagnose conditions affecting the stomach.",
            "chineseTranslation": "胃镜",
            "traditionalChineseTranslation": "胃鏡",
            "lesson": 1
        },
        {
            "word": "gastroscopy",
            "prefix": "gastro-",
            "root": "scop",
            "suffix": "-y",
            "meaning": "A procedure for examining the interior of the stomach using an endoscope.",
            "explanation": "Gastroscopy, also known as esophagogastroduodenoscopy (EGD), involves inserting a thin, flexible tube with a camera (endoscope) through the mouth into the stomach to look for abnormalities, take biopsies, and assess conditions like ulcers or inflammation.",
            "chineseTranslation": "胃镜检查",
            "traditionalChineseTranslation": "胃鏡檢查",
            "lesson": 1
        }
    ]
}