{
    "version": "0.0.1",
    "words": [
        {
            "word": "membrane",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a thin layer of tissue that covers a surface, lines a cavity, or divides a space or organ",
            "explanation": "Membranes can be found lining various structures in the body, such as the cell membrane, which surrounds cells, and mucous membranes, which line body cavities and canals that lead to the outside.",
            "chineseTranslation": "膜",
            "traditionalChineseTranslation": "膜",
            "lesson": 2
        },
        {
            "word": "cytoplasm",
            "prefix": "cyto-",
            "root": "plasm",
            "suffix": "",
            "meaning": "the jelly-like substance within a cell, excluding the nucleus",
            "explanation": "Cytoplasm is the material within a cell that is outside the nucleus. It contains organelles, cytosol, and various other components necessary for cellular processes.",
            "chineseTranslation": "细胞质",
            "traditionalChineseTranslation": "細胞質",
            "lesson": 2
        },
        {
            "word": "nucleus",
            "prefix": "",
            "root": "nucle-",
            "suffix": "",
            "meaning": "the central part of an atom that contains protons and neutrons, or a structure within a cell that contains DNA and controls cell activities",
            "explanation": "In cell biology, the nucleus is often referred to as the 'control center' of the cell because it houses genetic material and manages various cellular functions. In atomic physics, the nucleus is the dense region at the center of an atom, composed of protons and neutrons, playing a key role in the atom's mass and stability.",
            "chineseTranslation": "细胞核",
            "traditionalChineseTranslation": "細胞核",
            "lesson": 2
        },
        {
            "word": "cytology",
            "prefix": "cyto-",
            "root": "logy",
            "suffix": "",
            "meaning": "the study of cells",
            "explanation": "Cytology is a branch of biology that focuses on the structure, function, and chemistry of cells. It involves the examination of cells in terms of their origin, development, and physiological properties.",
            "chineseTranslation": "细胞学",
            "traditionalChineseTranslation": "細胞學",
            "lesson": 2
        },
        {
            "word": "mitochondria",
            "prefix": "mito-",
            "root": "chondrion",
            "suffix": "",
            "meaning": "the organelles in cells that generate most of the chemical energy needed to power biochemical reactions",
            "explanation": "Mitochondria are known as the powerhouse of the cell because they convert energy from nutrients into adenosine triphosphate (ATP), the energy currency of the cell. They also play roles in signaling, cellular differentiation, and cell death.",
            "chineseTranslation": "线粒体",
            "traditionalChineseTranslation": "線粒體",
            "lesson": 2
        },
        {
            "word": "Golgi Complex",
            "prefix": "",
            "root": "Golgi",
            "suffix": "Complex",
            "meaning": "A complex of vesicles and folded membranes involved in secretion and intracellular transport.",
            "explanation": "The Golgi complex is an organelle found in most eukaryotic cells, which is responsible for modifying, sorting, and packaging proteins and lipids for secretion or delivery to other organelles.",
            "chineseTranslation": "高尔基体",
            "traditionalChineseTranslation": "高爾基體",
            "lesson": 2
        },
        {
            "word": "epithelial tissues",
            "prefix": "epi-",
            "root": "thelium",
            "suffix": "tissues",
            "meaning": "A type of tissue that forms protective layers on surfaces and lines cavities, organs, and structures throughout the body.",
            "explanation": "Epithelial tissues serve various functions such as protection, secretion, absorption, and sensation. They cover both external and internal surfaces of the body and are classified based on the number of layers and the shape of the cells. There are two main types: simple epithelia (one layer) and stratified epithelia (multiple layers).",
            "chineseTranslation": "上皮组织",
            "traditionalChineseTranslation": "上皮組織",
            "lesson": 2
        },
        {
            "word": "collagenous",
            "prefix": "co-",
            "root": "lagen",
            "suffix": "-ous",
            "meaning": "pertaining to collagen, a protein that provides structure and elasticity to tissues.",
            "explanation": "Collagenous refers to anything that is related to or characteristic of collagen, which is a vital protein in the body that helps in making up the structure of joints, skin, bones, and connective tissues.",
            "chineseTranslation": "胶原的",
            "traditionalChineseTranslation": "膠原的",
            "lesson": 2
        },
        {
            "word": "cartilage",
            "prefix": "",
            "root": "cartilag(e)",
            "suffix": "",
            "meaning": "a flexible connective tissue found in various parts of the body",
            "explanation": "Cartilage is a type of dense connective tissue that provides support and flexibility to different structures in the body, such as joints, ears, nose, and the ribcage. It serves as a cushion and helps reduce friction in joints.",
            "chineseTranslation": "软骨",
            "traditionalChineseTranslation": "軟骨",
            "lesson": 2
        },
        {
            "word": "lymph",
            "prefix": "",
            "root": "lymph",
            "suffix": "",
            "meaning": "A clear fluid that travels through the lymphatic system, containing lymphocytes and other immune cells.",
            "explanation": "Lymph is an important part of the immune system and helps to remove waste and toxins from bodily tissues.",
            "chineseTranslation": "淋巴",
            "traditionalChineseTranslation": "淋巴",
            "lesson": 2
        },
        {
            "word": "dendrites",
            "prefix": "",
            "root": "dendrite",
            "suffix": "",
            "meaning": "branched extensions of a neuron that receive signals from other neurons",
            "explanation": "Dendrites are important components of neurons in the nervous system; they receive and conduct electrical signals toward the cell body from other neurons or sensory receptors.",
            "chineseTranslation": "树突",
            "traditionalChineseTranslation": "樹突",
            "lesson": 2
        },
        {
            "word": "axon",
            "prefix": "",
            "root": "axon",
            "suffix": "",
            "meaning": "the long projection of a neuron that conducts electrical impulses away from the neuron's cell body.",
            "explanation": "An axon is a part of a neuron that transmits signals to other neurons, muscles, or glands. It is crucial for the communication between nerve cells.",
            "chineseTranslation": "轴突",
            "traditionalChineseTranslation": "軸突",
            "lesson": 2
        },
        {
            "word": "spinal cord",
            "prefix": "",
            "root": "spinal",
            "suffix": "cord",
            "meaning": "the long, tubular structure encased within the vertebral column that carries signals between the brain and the rest of the body.",
            "explanation": "The spinal cord is a part of the central nervous system and is responsible for transmitting nerve signals that control reflexes and bodily functions, as well as interconnecting different parts of the nervous system.",
            "chineseTranslation": "脊髓",
            "traditionalChineseTranslation": "脊髓",
            "lesson": 2
        },
        {
            "word": "esophagus",
            "prefix": "",
            "root": "esophagus",
            "suffix": "",
            "meaning": "a muscular tube that connects the throat (pharynx) with the stomach",
            "explanation": "The esophagus is part of the digestive system and is responsible for transporting food from the mouth to the stomach. It is lined with mucous membranes and uses rhythmic contractions known as peristalsis to move food downward.",
            "chineseTranslation": "食道",
            "traditionalChineseTranslation": "食道",
            "lesson": 2
        },
        {
            "word": "supine",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "lying on one's back, face upward",
            "explanation": "The term 'supine' is often used in medical contexts to describe a position where a patient is lying flat on their back. This position is commonly used during examinations and surgical procedures.",
            "chineseTranslation": "仰卧",
            "traditionalChineseTranslation": "仰臥",
            "lesson": 2
        },
        {
            "word": "prone",
            "prefix": "",
            "root": "prone",
            "suffix": "",
            "meaning": "lying flat or face down",
            "explanation": "In medical terms, 'prone' refers to a position in which a person lies face down on a surface. This position is commonly used in various medical scenarios, such as during certain examinations and procedures.",
            "chineseTranslation": "俯卧",
            "traditionalChineseTranslation": "俯臥",
            "lesson": 2
        },
        {
            "word": "sagittal",
            "prefix": "",
            "root": "sagitt-",
            "suffix": "-al",
            "meaning": "relating to the plane that divides the body into left and right parts",
            "explanation": "In anatomy, the sagittal plane is an imaginary line that runs vertically through the body, dividing it into left and right sections. The term is commonly used in discussions of body orientation and movement.",
            "chineseTranslation": "矢状的",
            "traditionalChineseTranslation": "矢狀的",
            "lesson": 2
        },
        {
            "word": "midsagittal",
            "meaning": "A plane that divides the body into equal right and left halves.",
            "chineseTranslation": "正中矢状面",
            "traditionalChineseTranslation": "正中矢狀面",
            "explanation": "The midsagittal plane runs vertically through the midline of the body, separating it into equal left and right sections. It is synonymous with the median plane.",
            "prefix": "mid-",
            "root": "sagittal",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "parasagittal",
            "prefix": "para-",
            "root": "sagittal",
            "suffix": "",
            "meaning": "A plane cutting the body into left and right parts, parallel to the sagittal plane.",
            "explanation": "The parasagittal plane runs parallel to the mid-sagittal plane, which divides the body into equal left and right halves. A parasagittal plane does not necessarily divide the body into equal halves.",
            "chineseTranslation": "旁矢状",
            "traditionalChineseTranslation": "旁矢狀",
            "lesson": 2
        },
        {
            "word": "frontal",
            "prefix": "",
            "root": "front",
            "suffix": "-al",
            "meaning": "relating to the front part of something, often the forehead area in anatomical terms.",
            "explanation": "In anatomy, the term 'frontal' refers to anything located at or pertaining to the front of the body or an organ. For example, the frontal lobe is the part of the brain located at the front.",
            "chineseTranslation": "额的",
            "traditionalChineseTranslation": "額的",
            "lesson": 2
        },
        {
            "word": "transverse",
            "prefix": "trans-",
            "root": "vers",
            "suffix": "",
            "meaning": "relating to a plane that divides the body into superior and inferior parts",
            "explanation": "Transverse refers to a position or direction that is perpendicular to the long axis of the body. It often describes a plane or cut that divides the body into upper (top) and lower (bottom) sections.",
            "chineseTranslation": "横断的",
            "traditionalChineseTranslation": "橫斷的",
            "lesson": 2
        },
        {
            "word": "distal",
            "meaning": "situated farthest from the center, point of origin, or attachment",
            "chineseTranslation": "远端的",
            "traditionalChineseTranslation": "遠端的",
            "explanation": "In medical terminology, 'distal' refers to a position that is further away from the torso or the point of attachment of a limb. For example, the fingers are distal to the wrist.",
            "prefix": "",
            "root": "dist",
            "suffix": "al",
            "lesson": 2
        },
        {
            "word": "medial",
            "prefix": "med-",
            "root": "",
            "suffix": "-ial",
            "meaning": "pertaining to the middle or center",
            "explanation": "In anatomical terms, 'medial' refers to a position or direction toward the median plane or the midline of the body. It is often used to describe locations of body parts in relation to one another.",
            "chineseTranslation": "中间的",
            "traditionalChineseTranslation": "中間的",
            "lesson": 2
        },
        {
            "word": "lateral",
            "prefix": "",
            "root": "later",
            "suffix": "",
            "meaning": "pertaining to the side; away from the midline of the body",
            "explanation": "In anatomical terminology, 'lateral' refers to a position further away from the midline of the body or organ, indicating a directional term used to describe the location relative to the center of the body.",
            "chineseTranslation": "侧面",
            "traditionalChineseTranslation": "側面",
            "lesson": 2
        },
        {
            "word": "ventral",
            "prefix": "",
            "root": "ventr-",
            "suffix": "-al",
            "meaning": "pertaining to the front or anterior of a structure",
            "explanation": "In anatomical terms, 'ventral' refers to the belly side of the body or the front side in humans, as opposed to 'dorsal,' which refers to the back.",
            "chineseTranslation": "腹部的",
            "traditionalChineseTranslation": "腹部的",
            "lesson": 2
        },
        {
            "word": "dorsal",
            "meaning": "relating to the back or posterior side of the body",
            "chineseTranslation": "背部的",
            "traditionalChineseTranslation": "背部的",
            "explanation": "The term 'dorsal' is used in anatomy to describe the back side of an organism or a structure. It is often contrasted with 'ventral', which refers to the front or belly side.",
            "prefix": "",
            "root": "dors-",
            "suffix": "al",
            "lesson": 2
        },
        {
            "word": "anterior",
            "prefix": "an-",
            "root": "teri",
            "suffix": "",
            "meaning": "the front part of the body or an organ",
            "explanation": "In anatomy, 'anterior' refers to the position of a structure that is closer to the front of the body, as opposed to 'posterior,' which refers to structures towards the back.",
            "chineseTranslation": "前面",
            "traditionalChineseTranslation": "前面",
            "lesson": 2
        },
        {
            "word": "posterior",
            "prefix": "",
            "root": "poster-",
            "suffix": "-ior",
            "meaning": "referring to the back or rear side of the body",
            "explanation": "In anatomical terms, the posterior is the opposite of anterior, which refers to the front side. It is used to describe the position of structures in relation to each other in the body.",
            "chineseTranslation": "后方的",
            "traditionalChineseTranslation": "後方的",
            "lesson": 2
        },
        {
            "word": "superior",
            "prefix": "",
            "root": "super-",
            "suffix": "-ior",
            "meaning": "higher in position, status, or quality",
            "explanation": "In medical terminology, 'superior' refers to a structure or part of the body that is situated above another structure or closer to the head. It is used in anatomical descriptions to denote the relative position of body parts.",
            "chineseTranslation": "上部的",
            "traditionalChineseTranslation": "上部的",
            "lesson": 2
        },
        {
            "word": "inferior",
            "prefix": "",
            "root": "infer",
            "suffix": "-ior",
            "meaning": "lower in rank, status, or quality; in a medical context, it often refers to a position that is below another structure in the body, such as inferior vena cava (a large vein that carries deoxygenated blood from the lower body to the heart).",
            "explanation": "In medical anatomy, the term 'inferior' is used to describe the location of a structure that is situated lower than another structure. For instance, the stomach is inferior to the lungs.",
            "chineseTranslation": "下方的",
            "traditionalChineseTranslation": "下方的",
            "lesson": 2
        },
        {
            "word": "cranial",
            "prefix": "cran-",
            "root": "",
            "suffix": "-ial",
            "meaning": "pertaining to the skull",
            "explanation": "The term 'cranial' refers to anything related to the cranium or skull, which houses and protects the brain.",
            "chineseTranslation": "颅的",
            "traditionalChineseTranslation": "顱的",
            "lesson": 2
        },
        {
            "word": "caudal",
            "prefix": "",
            "root": "caud",
            "suffix": "-al",
            "meaning": "relating to the tail or the posterior part of the body",
            "explanation": "In anatomical terms, 'caudal' refers to structures located towards the tail or posterior end of the body, often used in contrast to 'cranial', which refers to the head end.",
            "chineseTranslation": "尾部的",
            "traditionalChineseTranslation": "尾部的",
            "lesson": 2
        },
        {
            "word": "coronal",
            "prefix": "cor-",
            "root": "onal",
            "suffix": "",
            "meaning": "relating to or situated like a crown; pertaining to the coronal plane, which divides the body into anterior (front) and posterior (back) sections",
            "explanation": "The term 'coronal' is commonly used in anatomy to describe orientations that are perpendicular to the sagittal plane, specifically in the context of imaging techniques like CT or MRI scans.",
            "chineseTranslation": "冠状的",
            "traditionalChineseTranslation": "冠狀的",
            "lesson": 2
        },
        {
            "word": "cephalic",
            "prefix": "cephal-",
            "root": "",
            "suffix": "-ic",
            "meaning": "relating to the head",
            "explanation": "The term 'cephalic' is used in medical contexts to refer to anything pertaining to the head, including its position or direction.",
            "chineseTranslation": "头部的",
            "traditionalChineseTranslation": "頭部的",
            "lesson": 2
        },
        {
            "word": "abdominal",
            "prefix": "ab-",
            "root": "domin",
            "suffix": "-al",
            "meaning": "pertaining to the abdomen",
            "explanation": "The term 'abdominal' refers to anything related to the abdomen, which is the part of the body between the chest and the pelvis containing organs such as the stomach and intestines.",
            "chineseTranslation": "腹部的",
            "traditionalChineseTranslation": "腹部的",
            "lesson": 2
        },
        {
            "word": "brachial",
            "prefix": "brachi-",
            "root": "",
            "suffix": "-al",
            "meaning": "pertaining to the arm",
            "explanation": "The term 'brachial' refers to anything related to the upper limb or arm, especially in anatomical contexts.",
            "chineseTranslation": "臂的",
            "traditionalChineseTranslation": "臂的",
            "lesson": 2
        },
        {
            "word": "cervical",
            "prefix": "cervic-",
            "root": "",
            "suffix": "-al",
            "meaning": "pertaining to the neck or the cervical region of the spine",
            "explanation": "The term cervical is often used in medical contexts to refer to structures that are associated with the neck or the cervical spine, such as cervical vertebrae or cervical cancer.",
            "chineseTranslation": "颈部的",
            "traditionalChineseTranslation": "頸部的",
            "lesson": 2
        },
        {
            "word": "crural",
            "prefix": "",
            "root": "crur-",
            "suffix": "",
            "meaning": "pertaining to the leg or thigh",
            "explanation": "The term 'crural' is derived from the Latin word 'crus', meaning leg. In medical terminology, it is used to refer to anatomical structures related to the leg or thigh region of the body.",
            "chineseTranslation": "腿部的",
            "traditionalChineseTranslation": "腿部的",
            "lesson": 2
        },
        {
            "word": "dorsum",
            "meaning": "the back of an organism or a part of it",
            "chineseTranslation": "背部",
            "traditionalChineseTranslation": "背部",
            "explanation": "In anatomy, 'dorsum' refers to the posterior or back surface of an organism, often used to describe the upper side of an animal or the back of the hand or foot in humans.",
            "prefix": "",
            "root": "dors-",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "gluteal",
            "prefix": "",
            "root": "glute",
            "suffix": "-al",
            "meaning": "pertaining to the buttocks",
            "explanation": "The term 'gluteal' refers to anything related to the gluteus muscles, which are responsible for the shape and movement of the buttocks.",
            "chineseTranslation": "臀部的",
            "traditionalChineseTranslation": "臀部的",
            "lesson": 2
        },
        {
            "word": "pelvic",
            "prefix": "",
            "root": "pelv-",
            "suffix": "",
            "meaning": "relating to the pelvis",
            "explanation": "Pelvic pertains to the region of the body located below the abdomen, which is bounded by the pelvic bones. It is often referenced in medical terms related to childbirth, reproductive organs, and lower body anatomy.",
            "chineseTranslation": "盆腔的",
            "traditionalChineseTranslation": "盆腔的",
            "lesson": 2
        },
        {
            "word": "pubic",
            "prefix": "",
            "root": "pub-",
            "suffix": "",
            "meaning": "related to the pubis or pubic region of the body",
            "explanation": "The term 'pubic' is used to describe anything pertaining to the pubis, which is the forward part of the hip bone located in the lower part of the abdomen.",
            "chineseTranslation": "耻骨的",
            "traditionalChineseTranslation": "恥骨的",
            "lesson": 2
        },
        {
            "word": "thoracic",
            "prefix": "thor-",
            "root": "",
            "suffix": "-ic",
            "meaning": "pertaining to the chest area",
            "explanation": "The term 'thoracic' relates to the thorax, the part of the body between the neck and the abdomen that contains vital organs such as the heart and lungs.",
            "chineseTranslation": "胸部的",
            "traditionalChineseTranslation": "胸部的",
            "lesson": 2
        },
        {
            "word": "vertebral",
            "prefix": "vertebr-",
            "root": "",
            "suffix": "-al",
            "meaning": "pertaining to the vertebrae",
            "explanation": "The term vertebral refers to anything related to the vertebrae, which are the small bones that make up the spine.",
            "chineseTranslation": "椎骨的",
            "traditionalChineseTranslation": "椎骨的",
            "lesson": 2
        },
        {
            "word": "trunk",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The main stem of a tree or the central part of a structure.",
            "explanation": "In medical terms, 'trunk' often refers to the main part of certain structures in the body, such as the body trunk from which limbs extend or part of the circulatory system (e.g. pulmonary trunk).",
            "chineseTranslation": "树干",
            "traditionalChineseTranslation": "樹幹",
            "lesson": 2
        },
        {
            "word": "lower extremities",
            "meaning": "The parts of the body below the hips, including the thighs, knees, legs, ankles, and feet.",
            "chineseTranslation": "下肢",
            "traditionalChineseTranslation": "下肢",
            "explanation": "Lower extremities refer to the limbs that are located below the pelvis. They play essential roles in locomotion, support, and balance.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "upper extremities",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The upper limbs of the human body, including the shoulders, arms, forearms, wrists, and hands.",
            "explanation": "Upper extremities refer to the structures of the body that allow for various functions such as reaching, lifting, and manipulating objects. The term is commonly used in anatomy and medicine to describe the anatomical region from the shoulder to the hand.",
            "chineseTranslation": "上肢",
            "traditionalChineseTranslation": "上肢",
            "lesson": 2
        },
        {
            "word": "axial region",
            "prefix": "",
            "root": "axial",
            "suffix": "region",
            "meaning": "referring to the central part of the body, which includes the head, neck, and trunk.",
            "explanation": "The axial region of the body consists of the head, neck and trunk, providing support and protection for vital organs.",
            "chineseTranslation": "轴向区域",
            "traditionalChineseTranslation": "軸向區域",
            "lesson": 2
        },
        {
            "word": "appendicular region",
            "prefix": "",
            "root": "appendicul",
            "suffix": "ar region",
            "meaning": "The part of the body that includes the limbs and their attachments (shoulders and hips) to the trunk.",
            "explanation": "The appendicular region refers to the segments of the body that are associated with the limbs, including the arms and legs, as well as their respective girdles (pectoral and pelvic). This is contrasted with the axial region, which includes the head, neck, and trunk.",
            "chineseTranslation": "附肢区域",
            "traditionalChineseTranslation": "附肢區域",
            "lesson": 2
        },
        {
            "word": "bucca",
            "prefix": "",
            "root": "bucc-",
            "suffix": "",
            "meaning": "the cheek",
            "explanation": "In anatomical terms, 'bucca' refers to the cheek or the area of the face that forms the lateral wall of the oral cavity. It plays a key role in facial expression and movement when chewing.",
            "chineseTranslation": "颊",
            "traditionalChineseTranslation": "頰",
            "lesson": 2
        },
        {
            "word": "auris",
            "prefix": "",
            "root": "aur",
            "suffix": "",
            "meaning": "ear",
            "explanation": "Auris is a Latin term used in medical contexts to refer to the ear. It is often used in anatomical terminology to describe structures related to hearing and balance.",
            "chineseTranslation": "耳",
            "traditionalChineseTranslation": "耳",
            "lesson": 2
        },
        {
            "word": "cranium",
            "prefix": "",
            "root": "crani-",
            "suffix": "",
            "meaning": "the skull, particularly the part enclosing the brain",
            "explanation": "The cranium is the upper part of the skull that surrounds and protects the brain. It consists of several bony structures that are fused together and provide both protection and support for the head.",
            "chineseTranslation": "颅骨",
            "traditionalChineseTranslation": "顱骨",
            "lesson": 2
        },
        {
            "word": "facies",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "surface appearance or outward aspect of an organ or tissue",
            "explanation": "In medical terminology, 'facies' refers to the specific facial expression or appearance that can be indicative of certain diseases or conditions. It can also refer to the general outward appearance of any anatomical structure.",
            "chineseTranslation": "面相",
            "traditionalChineseTranslation": "面相",
            "lesson": 2
        },
        {
            "word": "oculus",
            "prefix": "",
            "root": "oculus",
            "suffix": "",
            "meaning": "eye",
            "explanation": "In medical terminology, 'oculus' refers to the eye or a specific part of the eye. It is often used in phrases such as 'oculus dexter' (right eye) and 'oculus sinister' (left eye).",
            "chineseTranslation": "眼睛",
            "traditionalChineseTranslation": "眼睛",
            "lesson": 2
        },
        {
            "word": "nasus",
            "prefix": "",
            "root": "nas",
            "suffix": "",
            "meaning": "nose",
            "explanation": "In anatomy, 'nasus' refers to the nose, which is the structure that serves as the organ of smell and also functions in the respiratory system.",
            "chineseTranslation": "鼻子",
            "traditionalChineseTranslation": "鼻子",
            "lesson": 2
        },
        {
            "word": "cervicis",
            "prefix": "",
            "root": "cervic-",
            "suffix": "-is",
            "meaning": "of the neck",
            "explanation": "Cervicis refers to a structure associated with the neck, often used in anatomical terminology to describe muscles or nerves in that region.",
            "chineseTranslation": "颈部的",
            "traditionalChineseTranslation": "頸部的",
            "lesson": 2
        },
        {
            "word": "oris",
            "prefix": "",
            "root": "oris",
            "suffix": "",
            "meaning": "referring to the mouth or oral cavity",
            "explanation": "The term 'oris' is derived from Latin, meaning 'of the mouth'. It is commonly used in anatomical terms related to the oral cavity.",
            "chineseTranslation": "口腔的",
            "traditionalChineseTranslation": "口腔的",
            "lesson": 2
        },
        {
            "word": "mentis",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "of the mind",
            "explanation": "The term 'mentis' is derived from Latin, meaning 'of the mind'. It is often used in medical contexts to refer to conditions or aspects that relate to mental status or mental health.",
            "chineseTranslation": "精神的",
            "traditionalChineseTranslation": "精神的",
            "lesson": 2
        },
        {
            "word": "thoracis",
            "prefix": "",
            "root": "thorac-",
            "suffix": "is",
            "meaning": "related to the thorax (chest)",
            "explanation": "The term 'thoracis' refers to something associated with the thorax, which is the part of the body located between the neck and the abdomen that houses the lungs and heart.",
            "chineseTranslation": "胸廓的",
            "traditionalChineseTranslation": "胸廓的",
            "lesson": 2
        },
        {
            "word": "axilla",
            "meaning": "the armpit or the space under the joint where the arm meets the shoulder",
            "chineseTranslation": "腋窝",
            "traditionalChineseTranslation": "腋窩",
            "explanation": "The axilla is the anatomical term for the armpit area, which contains important structures such as blood vessels, nerves, and lymph nodes.",
            "prefix": "",
            "root": "axill",
            "suffix": "a",
            "lesson": 2
        },
        {
            "word": "antecubitis",
            "meaning": "the region in front of the elbow",
            "chineseTranslation": "肘前区",
            "traditionalChineseTranslation": "肘前區",
            "explanation": "Antecubitis refers to the anatomical location anterior to the elbow joint, commonly known as the front of the elbow.",
            "prefix": "ante",
            "root": "cubitus",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "antebrachium",
            "meaning": "The region of the forearm between the elbow and the wrist.",
            "chineseTranslation": "前臂",
            "traditionalChineseTranslation": "前臂",
            "explanation": "The antebrachium refers specifically to the forearm part of the human arm. It is the section of the upper limb located between the elbow joint and the wrist joint.",
            "prefix": "ante-",
            "root": "brachium",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "carpus",
            "prefix": "",
            "root": "carp",
            "suffix": "us",
            "meaning": "the group of bones in the wrist",
            "explanation": "The carpus consists of eight small bones that make up the wrist, providing flexibility and movement to the hand.",
            "chineseTranslation": "腕骨",
            "traditionalChineseTranslation": "腕骨",
            "lesson": 2
        },
        {
            "word": "pollex",
            "meaning": "The thumb.",
            "chineseTranslation": "拇指",
            "traditionalChineseTranslation": "拇指",
            "explanation": "In anatomical terms, the pollex refers specifically to the first digit of the hand, commonly known as the thumb, which is opposable and plays a crucial role in grasping.",
            "prefix": "",
            "root": "pollex",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "palma",
            "meaning": "the inner surface of the hand or the palm of the hand",
            "chineseTranslation": "手掌",
            "traditionalChineseTranslation": "手掌",
            "explanation": "In anatomy, 'palma' refers to the palm or the inner surface of the hand where the fingers are attached.",
            "prefix": "",
            "root": "palm",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "digits",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the numerical symbols used to represent numbers, usually from 0 to 9",
            "explanation": "In medical terms, 'digits' can refer to the fingers or toes of the body, as well as the numerical characters used in various calculations and documentation.",
            "chineseTranslation": "数字",
            "traditionalChineseTranslation": "數字",
            "lesson": 2
        },
        {
            "word": "phalanges",
            "prefix": "",
            "root": "phalang-",
            "suffix": "es",
            "meaning": "the bones of the fingers and toes",
            "explanation": "Phalanges are the multiple long bones in the hands and feet, specifically the ones that form the fingers and toes. Each finger and toe typically has three phalanges, except for the thumb and big toe, which have two.",
            "chineseTranslation": "指骨",
            "traditionalChineseTranslation": "指骨",
            "lesson": 2
        },
        {
            "word": "femur",
            "prefix": "",
            "root": "femur",
            "suffix": "",
            "meaning": "the thigh bone, which is the longest and strongest bone in the human body.",
            "explanation": "The femur connects the hip joint to the knee and supports the weight of the body during standing, walking, and running.",
            "chineseTranslation": "股骨",
            "traditionalChineseTranslation": "股骨",
            "lesson": 2
        },
        {
            "word": "patella",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "knee cap",
            "explanation": "The patella, commonly known as the kneecap, is a triangular-shaped bone located at the front of the knee joint. It protects the knee and provides leverage for the muscles of the thigh.",
            "chineseTranslation": "髌骨",
            "traditionalChineseTranslation": "髌骨",
            "lesson": 2
        },
        {
            "word": "crus",
            "meaning": "a leg-like structure or part of an organ",
            "chineseTranslation": "胫",
            "traditionalChineseTranslation": "脛",
            "explanation": "In anatomy, 'crus' refers to the leg portion of a structure, commonly used in reference to the legs of the brain, such as the crus cerebri, or in the context of the lower leg.",
            "prefix": "",
            "root": "crus",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "tarsus",
            "prefix": "",
            "root": "tars",
            "suffix": "",
            "meaning": "a group of seven bones in the ankle region of the foot",
            "explanation": "The tarsus consists of seven bones that form the ankle and part of the foot, allowing for flexibility and movement.",
            "chineseTranslation": "跗骨",
            "traditionalChineseTranslation": "跗骨",
            "lesson": 2
        },
        {
            "word": "hallux",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The term refers to the big toe, particularly in humans.",
            "explanation": "In human anatomy, the hallux is the digit that corresponds to the first toe, which is often the largest and most powerful toe, playing an important role in balance and walking.",
            "chineseTranslation": "大趾",
            "traditionalChineseTranslation": "大趾",
            "lesson": 2
        },
        {
            "word": "mamma",
            "prefix": "",
            "root": "mamma",
            "suffix": "",
            "meaning": "the breast or mammary gland of a female mammal that produces milk for feeding young",
            "explanation": "Mamma refers specifically to the mammary glands in female mammals which are responsible for producing milk. These structures are crucial for nursing offspring in mammals.",
            "chineseTranslation": "乳房",
            "traditionalChineseTranslation": "乳房",
            "lesson": 2
        },
        {
            "word": "abdomen",
            "prefix": "",
            "root": "abdomin-",
            "suffix": "",
            "meaning": "The part of the body containing the digestive organs; the belly.",
            "explanation": "The abdomen is the region of the body between the chest and pelvis. It houses various organs, including the stomach, intestines, liver, and kidneys, and plays a vital role in digestion and metabolism.",
            "chineseTranslation": "腹部",
            "traditionalChineseTranslation": "腹部",
            "lesson": 2
        },
        {
            "word": "umbilicus",
            "prefix": "",
            "root": "umbilic",
            "suffix": "-us",
            "meaning": "navel or belly button",
            "explanation": "The umbilicus is a small scar on the abdomen where the umbilical cord was attached in the fetus. It is often referred to as the belly button in layman's terms.",
            "chineseTranslation": "肚脐",
            "traditionalChineseTranslation": "肚臍",
            "lesson": 2
        },
        {
            "word": "hip",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the joint connecting the thigh to the body",
            "explanation": "The hip is a ball-and-socket joint that allows for a wide range of motion in the leg and is one of the major load-bearing joints of the body.",
            "chineseTranslation": "髋部",
            "traditionalChineseTranslation": "髖部",
            "lesson": 2
        },
        {
            "word": "pelvis",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the bony structure located at the base of the spine that supports the spinal column and protects the pelvic organs",
            "explanation": "The pelvis is a basin-shaped structure that consists of the hip bones, sacrum, and coccyx. It plays a crucial role in supporting the weight of the upper body when sitting and standing and houses and protects the reproductive organs, bladder, and intestines.",
            "chineseTranslation": "骨盆",
            "traditionalChineseTranslation": "骨盆",
            "lesson": 2
        },
        {
            "word": "inguen",
            "prefix": "",
            "root": "ingu",
            "suffix": "",
            "meaning": "groin",
            "explanation": "Inguen refers to the area of the body where the abdomen meets the legs; it is commonly known as the groin region.",
            "chineseTranslation": "腹股沟",
            "traditionalChineseTranslation": "腹股溝",
            "lesson": 2
        },
        {
            "word": "groin",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The area of the body on each side of the pubic region, where the legs meet the torso.",
            "explanation": "The groin is the junction between the abdomen and the thigh, and it is characterized by the presence of several important structures including the inguinal canal, which is a passage for nerves and blood vessels, as well as a site that may be prone to hernias.",
            "chineseTranslation": "腹股沟",
            "traditionalChineseTranslation": "腹股溝",
            "lesson": 2
        },
        {
            "word": "cephalon",
            "prefix": "",
            "root": "cephal",
            "suffix": "on",
            "meaning": "the head or a part of the head",
            "explanation": "Cephalon refers to the head in various contexts, particularly in anatomy and biology. It is often used to describe structures or functions related to the head.",
            "chineseTranslation": "头部",
            "traditionalChineseTranslation": "頭部",
            "lesson": 2
        },
        {
            "word": "shoulder",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the body where the arm meets the torso.",
            "explanation": "The shoulder consists of the scapula (shoulder blade), humerus (upper arm bone), and the clavicle (collarbone). It allows for a wide range of motion and supports the arm.",
            "chineseTranslation": "肩膀",
            "traditionalChineseTranslation": "肩膀",
            "lesson": 2
        },
        {
            "word": "acromial",
            "prefix": "acro-",
            "root": "mial",
            "suffix": "",
            "meaning": "pertaining to the acromion (the outer part of the shoulder blade)",
            "explanation": "The term acromial refers to anything related to the acromion, which is the bony prominence on the shoulder blade where it forms the highest point of the shoulder.",
            "chineseTranslation": "肩峰的",
            "traditionalChineseTranslation": "肩峰的",
            "lesson": 2
        },
        {
            "word": "dorsum",
            "meaning": "the back or posterior part of something, especially the human body",
            "chineseTranslation": "背部",
            "traditionalChineseTranslation": "背部",
            "explanation": "In anatomy, 'dorsum' refers specifically to the back side or surface of an organism or structure, as opposed to the ventral side.",
            "prefix": "",
            "root": "dors",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "brachium",
            "prefix": "",
            "root": "brachium",
            "suffix": "",
            "meaning": "the arm or upper limb",
            "explanation": "In anatomical terms, 'brachium' refers specifically to the portion of the upper limb between the shoulder and the elbow.",
            "chineseTranslation": "臂",
            "traditionalChineseTranslation": "臂",
            "lesson": 2
        },
        {
            "word": "olecranon",
            "prefix": "",
            "root": "olecran",
            "suffix": "on",
            "meaning": "the bony prominence of the elbow",
            "explanation": "The olecranon is the large bony projection on the ulna bone of the forearm, which forms the bony tip of the elbow. It serves as an attachment point for the triceps muscle and plays a crucial role in elbow movement.",
            "chineseTranslation": "肘尖",
            "traditionalChineseTranslation": "肘尖",
            "lesson": 2
        },
        {
            "word": "antebrachium",
            "prefix": "ante-",
            "root": "brachium",
            "suffix": "",
            "meaning": "the forearm",
            "explanation": "The antebrachium refers to the region of the arm located between the elbow and the wrist, encompassing the radius and ulna bones.",
            "chineseTranslation": "前臂",
            "traditionalChineseTranslation": "前臂",
            "lesson": 2
        },
        {
            "word": "manus",
            "prefix": "",
            "root": "manus",
            "suffix": "",
            "meaning": "hand",
            "explanation": "The term 'manus' refers specifically to the anatomical term for the hand in Latin. In medical terminology, it is often used in reference to structures or conditions related to the hand.",
            "chineseTranslation": "手",
            "traditionalChineseTranslation": "手",
            "lesson": 2
        },
        {
            "word": "lumbus",
            "prefix": "",
            "root": "lumbus",
            "suffix": "",
            "meaning": "the lower back area or loin region of the body",
            "explanation": "In human anatomy, the lumbus refers to the part of the body located between the chest and the pelvis. This area is known for supporting the weight of the upper body and facilitating movement.",
            "chineseTranslation": "腰部",
            "traditionalChineseTranslation": "腰部",
            "lesson": 2
        },
        {
            "word": "sacrum",
            "prefix": "",
            "root": "sacr-",
            "suffix": "",
            "meaning": "the triangular bone at the base of the spine forming the back of the pelvis",
            "explanation": "The sacrum is a large, triangular-shaped bone at the base of the vertebral column, usually consisting of five fused vertebrae. It serves as a critical structure in the pelvis, providing support and stability for the upper body and connecting the spine to the hip bones (iliac).",
            "chineseTranslation": "骶骨",
            "traditionalChineseTranslation": "骶骨",
            "lesson": 2
        },
        {
            "word": "gluteus",
            "prefix": "",
            "root": "glute-",
            "suffix": "-us",
            "meaning": "a large muscle in each buttock that helps in movement of the hip and thigh",
            "explanation": "The gluteus muscle group is comprised primarily of the gluteus maximus, gluteus medius, and gluteus minimus, which are important for hip stabilization and movement.",
            "chineseTranslation": "臀部肌肉",
            "traditionalChineseTranslation": "臀部肌肉",
            "lesson": 2
        },
        {
            "word": "popliteus",
            "meaning": "A muscle located at the back of the knee that helps to unlock the knee from a fully extended position.",
            "chineseTranslation": "腘肌",
            "traditionalChineseTranslation": "腘肌",
            "explanation": "The popliteus muscle is important for knee stability and is involved in the movement of the knee joint, particularly in initiating flexion from a straightened position.",
            "prefix": "",
            "root": "popliteus",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "sura",
            "prefix": "",
            "root": "sura",
            "suffix": "",
            "meaning": "A chapter of the Quran, which is the holy book of Islam.",
            "explanation": "The Quran is divided into chapters known as 'suras', each of which contains verses or 'ayat'. Suras vary in length and cover various topics including theology, morality, and guidance for personal conduct.",
            "chineseTranslation": "章",
            "traditionalChineseTranslation": "章",
            "lesson": 2
        },
        {
            "word": "calcaneus",
            "prefix": "",
            "root": "calcane-",
            "suffix": "-us",
            "meaning": "the heel bone",
            "explanation": "The calcaneus is the largest bone of the foot that forms the heel and provides support for walking and running.",
            "chineseTranslation": "跟骨",
            "traditionalChineseTranslation": "跟骨",
            "lesson": 2
        },
        {
            "word": "planta",
            "prefix": "",
            "root": "plant",
            "suffix": "",
            "meaning": "A term used to refer to a living organism that typically grows in soil, absorbs water and nutrients, and produces oxygen.",
            "explanation": "In medical contexts, 'planta' often refers to the sole of the foot or the bottom surface of a body part, especially in relation to anatomy and physiology.",
            "chineseTranslation": "植物",
            "traditionalChineseTranslation": "植物",
            "lesson": 2
        },
        {
            "word": "hypochondriac",
            "prefix": "hypo-",
            "root": "chondr",
            "suffix": "-iac",
            "meaning": "a person who is excessively concerned about their health, often experiencing imaginary ailments",
            "explanation": "Hypochondriacs are individuals who are preoccupied with the idea that they are suffering from a serious illness despite having little or no medical evidence to support such a belief. This condition can lead to significant anxiety and can affect a person's daily life.",
            "chineseTranslation": "疑病症患者",
            "traditionalChineseTranslation": "疑病症患者",
            "lesson": 2
        },
        {
            "word": "epigastric",
            "prefix": "epi-",
            "root": "gastr-",
            "suffix": "-ic",
            "meaning": "relating to the upper central region of the abdomen",
            "explanation": "The term 'epigastric' refers to the area located just above the stomach, an important anatomical reference for locating pain or discomfort in medical examinations.",
            "chineseTranslation": "上腹部的",
            "traditionalChineseTranslation": "上腹部的",
            "lesson": 2
        },
        {
            "word": "lumbar",
            "prefix": "",
            "root": "lumb",
            "suffix": "ar",
            "meaning": "relating to the lower back or lumbar region of the spine",
            "explanation": "The lumbar region refers to the part of the spine that is located in the lower back, specifically between the thoracic vertebrae and the sacrum. It typically consists of five vertebrae, which are referred to as L1 to L5.",
            "chineseTranslation": "腰部的",
            "traditionalChineseTranslation": "腰部的",
            "lesson": 2
        },
        {
            "word": "umbilical",
            "prefix": "um-",
            "root": "bilic",
            "suffix": "-al",
            "meaning": "relating to the navel or umbilicus",
            "explanation": "The term 'umbilical' pertains to anything associated with the umbilicus, commonly known as the navel, which is the scar on the abdomen where the umbilical cord was attached in the womb.",
            "chineseTranslation": "脐带的",
            "traditionalChineseTranslation": "脐帶的",
            "lesson": 2
        },
        {
            "word": "hypogastric",
            "prefix": "hypo-",
            "root": "gastr",
            "suffix": "-ic",
            "meaning": "pertaining to the lower abdomen",
            "explanation": "The term 'hypogastric' refers to the region of the body located below the stomach. It is often used in medical terms to describe structures, diseases, or symptoms in that area of the abdomen.",
            "chineseTranslation": "下腹部的",
            "traditionalChineseTranslation": "下腹部的",
            "lesson": 2
        },
        {
            "word": "iliac",
            "prefix": "",
            "root": "iliac",
            "suffix": "",
            "meaning": "related to the ilium or hip bone",
            "explanation": "The term 'iliac' describes structures or regions near the ilium, which is the uppermost and largest part of the hip bone.",
            "chineseTranslation": "髂",
            "traditionalChineseTranslation": "髂",
            "lesson": 2
        },
        {
            "word": "fallopian",
            "prefix": "",
            "root": "fallop-",
            "suffix": "-ian",
            "meaning": "relating to the fallopian tubes, which are the ducts that transport eggs from the ovaries to the uterus.",
            "explanation": "The term 'fallopian' is derived from the name of the Italian anatomist Gabriel Fallopio, who described the fallopian tubes in the 16th century. These tubes play a crucial role in the female reproductive system.",
            "chineseTranslation": "输卵管的",
            "traditionalChineseTranslation": "輸卵管的",
            "lesson": 2
        },
        {
            "word": "ureter",
            "prefix": "",
            "root": "ureter",
            "suffix": "",
            "meaning": "The duct by which urine passes from the kidney to the urinary bladder.",
            "explanation": "The ureter is a muscular tube that transports urine from the kidneys to the bladder. Each kidney has one ureter, and they play a crucial role in the urinary system by ensuring the flow of urine is efficient and controlled.",
            "chineseTranslation": "输尿管",
            "traditionalChineseTranslation": "輸尿管",
            "lesson": 2
        },
        {
            "word": "diaphragm",
            "prefix": "dia-",
            "root": "phragma",
            "suffix": "",
            "meaning": "A muscle that separates the chest from the abdominal cavity and plays a major role in breathing.",
            "explanation": "The diaphragm contracts during inhalation, creating a vacuum that allows air to enter the lungs, and relaxes during exhalation.",
            "chineseTranslation": "膈肌",
            "traditionalChineseTranslation": "橫隔膜",
            "lesson": 2
        },
        {
            "word": "abdominopelvic",
            "prefix": "abdomino-",
            "root": "pelv-",
            "suffix": "-ic",
            "meaning": "pertaining to the abdominal and pelvic regions",
            "explanation": "The term 'abdominopelvic' refers to the combined areas of the abdomen and pelvis in human anatomy. It describes structures or organs located within these regions.",
            "chineseTranslation": "腹盆部的",
            "traditionalChineseTranslation": "腹盆部的",
            "lesson": 2
        },
        {
            "word": "coccygeal",
            "prefix": "coccyg-",
            "root": "",
            "suffix": "-eal",
            "meaning": "pertaining to the coccyx (the tailbone)",
            "explanation": "The term 'coccygeal' is used to describe anything related to the coccyx, a small, triangular bone at the base of the vertebral column.",
            "chineseTranslation": "尾骨的",
            "traditionalChineseTranslation": "尾骨的",
            "lesson": 2
        },
        {
            "word": "mediastinum",
            "prefix": "",
            "root": "mediastin-",
            "suffix": "-um",
            "meaning": "the central compartment of the thoracic cavity",
            "explanation": "The mediastinum is the area in the thorax between the lungs that contains the heart, great vessels, trachea, esophagus, and other structures.",
            "chineseTranslation": "纵隔",
            "traditionalChineseTranslation": "縱隔",
            "lesson": 2
        },
        {
            "word": "parietal layer",
            "meaning": "the outer layer of the serous membrane, which lines the walls of the body cavity",
            "chineseTranslation": "壁层",
            "traditionalChineseTranslation": "壁層",
            "explanation": "The parietal layer is part of the serous membranes that covers the walls of body cavities. It is in contrast to the visceral layer, which covers the organs within those cavities.",
            "prefix": "para-",
            "root": "ietal",
            "suffix": "layer",
            "lesson": 2
        },
        {
            "word": "parietal peritoneum",
            "meaning": "The membrane lining the abdominal cavity, separating it from the abdominal organs.",
            "chineseTranslation": "壁腹膜",
            "traditionalChineseTranslation": "壁腹膜",
            "explanation": "The parietal peritoneum is a part of the peritoneum, the serous membrane that forms the lining of the abdominal cavity. It is distinct from the visceral peritoneum, which directly covers the abdominal organs.",
            "prefix": "pariet-",
            "root": "peritoneum",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "parietal pleura",
            "prefix": "pariet-",
            "root": "pleura",
            "suffix": "",
            "meaning": "The membrane that lines the thoracic cavity and covers the diaphragm.",
            "explanation": "The parietal pleura is a part of the pleura, which is the double-layered membrane surrounding the lungs. The parietal layer specifically adheres to the thoracic wall and diaphragm, providing protection and facilitating movement during respiration.",
            "chineseTranslation": "壁胸膜",
            "traditionalChineseTranslation": "壁胸膜",
            "lesson": 2
        },
        {
            "word": "viscera",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The internal organs of the body, particularly those within the chest and abdomen.",
            "explanation": "Viscera refers to the large organs located in the main cavities of the body, including the heart, lungs, liver, stomach, and intestines. These organs are essential for various bodily functions such as digestion, respiration, and circulation.",
            "chineseTranslation": "内脏",
            "traditionalChineseTranslation": "內臟",
            "lesson": 2
        },
        {
            "word": "integumentary",
            "prefix": "in-",
            "root": "tegument",
            "suffix": "-ary",
            "meaning": "relating to the integument or covering of an organism, particularly the skin and its appendages",
            "explanation": "The integumentary system comprises the skin and its associated structures, such as hair, nails, and glands, serving as a protective barrier and involved in various functions like sensation, temperature regulation, and protection against pathogens.",
            "chineseTranslation": "外皮的",
            "traditionalChineseTranslation": "外皮的",
            "lesson": 2
        },
        {
            "word": "dermatology",
            "meaning": "the branch of medicine that deals with the diagnosis and treatment of skin disorders",
            "chineseTranslation": "皮肤科",
            "traditionalChineseTranslation": "皮膚科",
            "explanation": "Dermatology is a medical specialty focused on the health of the skin, hair, and nails, addressing various conditions such as rashes, infections, and other skin diseases.",
            "prefix": "derma-",
            "root": "logy",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "musculoskeletal",
            "prefix": "musculo-",
            "root": "skelet",
            "suffix": "al",
            "meaning": "relating to the muscles and the skeleton",
            "explanation": "The term musculoskeletal refers to the system of muscles and bones in the body that work together to support movement and stability.",
            "chineseTranslation": "肌肉骨骼的",
            "traditionalChineseTranslation": "肌肉骨骼的",
            "lesson": 2
        },
        {
            "word": "orthopedics",
            "prefix": "ortho-",
            "root": "ped-",
            "suffix": "-ics",
            "meaning": "The branch of medicine dealing with the correction of deformities of bones or muscles.",
            "explanation": "Orthopedics is focused on the diagnosis, treatment, rehabilitation, and prevention of musculoskeletal disorders. It involves surgical and non-surgical methods to treat conditions affecting bones, joints, and muscles.",
            "chineseTranslation": "整形外科",
            "traditionalChineseTranslation": "整形外科",
            "lesson": 2
        },
        {
            "word": "cardiovascular",
            "prefix": "cardio-",
            "root": "vascul-",
            "suffix": "-ar",
            "meaning": "pertaining to the heart and blood vessels",
            "explanation": "The term cardiovascular refers to the system that includes the heart (cardio) and the network of blood vessels (vascular) that transport blood throughout the body.",
            "chineseTranslation": "心血管的",
            "traditionalChineseTranslation": "心血管的",
            "lesson": 2
        },
        {
            "word": "hematic",
            "prefix": "hema-",
            "root": "-tic",
            "suffix": "",
            "meaning": "relating to blood",
            "explanation": "The term 'hematic' pertains to anything associated with the blood, particularly in medical contexts.",
            "chineseTranslation": "血液的",
            "traditionalChineseTranslation": "血液的",
            "lesson": 2
        },
        {
            "word": "hematology",
            "meaning": "the study of blood, blood diseases, and blood-related disorders",
            "chineseTranslation": "血液学",
            "traditionalChineseTranslation": "血液學",
            "explanation": "Hematology is a branch of medicine that focuses on the study, diagnosis, treatment, and prevention of blood disorders, including anemia, clotting disorders, leukemia, and other blood-related conditions.",
            "prefix": "hema-",
            "root": "-logy",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "lymphatic",
            "prefix": "lymph-",
            "root": "",
            "suffix": "-atic",
            "meaning": "relating to lymph or the lymphatic system",
            "explanation": "Lymphatic refers to the system in the body that is responsible for the drainage of lymph, a clear fluid that contains white blood cells, which are vital for the immune system. The lymphatic system helps to maintain fluid balance in the body and plays a key role in immune response.",
            "chineseTranslation": "淋巴的",
            "traditionalChineseTranslation": "淋巴的",
            "lesson": 2
        },
        {
            "word": "immunology",
            "prefix": "immuno-",
            "root": "logy",
            "suffix": "",
            "meaning": "The branch of medicine and biology that deals with the immune system, its responses, and related disorders.",
            "explanation": "Immunology is the study of how the immune system functions and how it interacts with pathogens, foreign substances, and diseases. It includes understanding various immune responses, the role of immune cells, and vaccine development.",
            "chineseTranslation": "免疫学",
            "traditionalChineseTranslation": "免疫學",
            "lesson": 2
        },
        {
            "word": "platelets",
            "prefix": "",
            "root": "platelet",
            "suffix": "",
            "meaning": "small cell fragments in the blood that play a key role in clotting.",
            "explanation": "Platelets are also known as thrombocytes and are essential for blood coagulation. They aggregate at the site of a blood vessel injury, helping to form a clot and prevent excessive bleeding.",
            "chineseTranslation": "血小板",
            "traditionalChineseTranslation": "血小板",
            "lesson": 2
        },
        {
            "word": "thymus gland",
            "prefix": "",
            "root": "thymus",
            "suffix": "gland",
            "meaning": "A gland located in the upper chest that is involved in the development and maturation of T-lymphocytes (T-cells), which are essential for immune response.",
            "explanation": "The thymus gland is an important part of the immune system, especially during childhood, as it produces hormones like thymosin that help with the maturation of T-cells. The gland typically decreases in size after puberty.",
            "chineseTranslation": "胸腺",
            "traditionalChineseTranslation": "胸腺",
            "lesson": 2
        },
        {
            "word": "otorhinolaryngology",
            "prefix": "oto-",
            "root": "rhino",
            "suffix": "-logy",
            "meaning": "the branch of medicine that deals with the diagnosis and treatment of disorders of the ear, nose, and throat (ENT)",
            "explanation": "Otorhinolaryngology is a medical specialty focused on conditions affecting the ear, nose, throat, and related structures of the head and neck.",
            "chineseTranslation": "耳鼻喉科学",
            "traditionalChineseTranslation": "耳鼻喉科",
            "lesson": 2
        },
        {
            "word": "pharynx",
            "meaning": "The part of the throat situated behind the mouth and nasal cavity, serving as a pathway for both air and food.",
            "chineseTranslation": "咽",
            "traditionalChineseTranslation": "咽",
            "explanation": "The pharynx is a muscular tube that connects the mouth and nasal passages to the esophagus and larynx, playing a vital role in the respiratory and digestive systems.",
            "prefix": "",
            "root": "pharynx",
            "suffix": "",
            "lesson": 2
        },
        {
            "word": "larynx",
            "prefix": "",
            "root": "laryng-",
            "suffix": "",
            "meaning": "The hollow, muscular organ that forms an air passage to the lungs and houses the vocal cords.",
            "explanation": "The larynx is located in the neck and is responsible for voice production, as well as protecting the trachea against food aspiration.",
            "chineseTranslation": "喉",
            "traditionalChineseTranslation": "喉",
            "lesson": 2
        },
        {
            "word": "trachea",
            "prefix": "",
            "root": "trache-",
            "suffix": "",
            "meaning": "The tube that connects the larynx to the bronchi and allows air to pass to and from the lungs.",
            "explanation": "The trachea, also known as the windpipe, is a vital structure in the respiratory system that serves as the main airway, guiding air to the lungs during inhalation and returning it to the environment during exhalation.",
            "chineseTranslation": "气管",
            "traditionalChineseTranslation": "氣管",
            "lesson": 2
        },
        {
            "word": "proctology",
            "prefix": "procto-",
            "root": "logy",
            "suffix": "",
            "meaning": "The branch of medicine concerned with the diagnosis and treatment of disorders of the rectum and anus.",
            "explanation": "Proctology is a medical specialty that focuses on the diseases and conditions affecting the rectal and anal area, including hemorrhoids, anal fissures, and colorectal cancer.",
            "chineseTranslation": "直肠学",
            "traditionalChineseTranslation": "直腸學",
            "lesson": 2
        },
        {
            "word": "gastrointestinal",
            "prefix": "gastro-",
            "root": "intestine",
            "suffix": "-al",
            "meaning": "relating to the stomach and intestines",
            "explanation": "The term 'gastrointestinal' refers to the organs involved in the digestion process, specifically the stomach (gastro) and the intestines.",
            "chineseTranslation": "胃肠的",
            "traditionalChineseTranslation": "胃腸的",
            "lesson": 2
        },
        {
            "word": "gastroenterology",
            "prefix": "gastro-",
            "root": "enteron",
            "suffix": "-logy",
            "meaning": "The branch of medicine that deals with the digestive system and its disorders.",
            "explanation": "Gastroenterology encompasses the study, diagnosis, and treatment of conditions related to the stomach and intestines.",
            "chineseTranslation": "胃肠病学",
            "traditionalChineseTranslation": "胃腸病學",
            "lesson": 2
        },
        {
            "word": "salivary",
            "prefix": "saliv-",
            "root": "",
            "suffix": "-ary",
            "meaning": "pertaining to saliva or the production of saliva",
            "explanation": "The term 'salivary' relates to anything connected to saliva, which is a digestive fluid produced in the mouths of humans and many animals.",
            "chineseTranslation": "唾液的",
            "traditionalChineseTranslation": "唾液的",
            "lesson": 2
        },
        {
            "word": "urethra",
            "meaning": "A tube that carries urine from the bladder to the outside of the body and, in males, also carries semen.",
            "chineseTranslation": "尿道",
            "traditionalChineseTranslation": "尿道",
            "explanation": "The urethra is a vital part of the urinary and reproductive systems, facilitating the expulsion of urine and semen in males, while in females, it is solely involved in urine transport.",
            "prefix": "",
            "root": "urethr",
            "suffix": "a",
            "lesson": 2
        },
        {
            "word": "obstetrics",
            "prefix": "ob-",
            "root": "stit",
            "suffix": "-ics",
            "meaning": "the branch of medicine dealing with childbirth and care of the mother.",
            "explanation": "Obstetrics is the medical specialty that focuses on the care of women during pregnancy, childbirth, and the postpartum period. It involves monitoring the health of both the mother and the fetus, managing labor and delivery, and addressing any complications that may arise during these processes.",
            "chineseTranslation": "妇产科",
            "traditionalChineseTranslation": "婦產科",
            "lesson": 2
        },
        {
            "word": "vagina",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The muscular tube leading from the external genitals to the uterus in female mammals.",
            "explanation": "The vagina serves as the birth canal and the passageway for menstrual fluid. It also plays a role in sexual intercourse as it accommodates the penis during sexual activity.",
            "chineseTranslation": "阴道",
            "traditionalChineseTranslation": "陰道",
            "lesson": 2
        },
        {
            "word": "vulva",
            "prefix": "",
            "root": "vulv-",
            "suffix": "",
            "meaning": "the external female genitalia",
            "explanation": "The vulva includes the labia, clitoris, and the openings to the vagina and urethra, serving various functions including protection and sexual arousal.",
            "chineseTranslation": "外阴",
            "traditionalChineseTranslation": "外陰",
            "lesson": 2
        },
        {
            "word": "testes",
            "prefix": "",
            "root": "testis",
            "suffix": "es",
            "meaning": "the male gonads that produce sperm and hormones, including testosterone",
            "explanation": "The testes are responsible for the production of sperm and the secretion of male hormones, primarily testosterone, which helps develop male sexual characteristics.",
            "chineseTranslation": "睾丸",
            "traditionalChineseTranslation": "睾丸",
            "lesson": 2
        },
        {
            "word": "epididymis",
            "prefix": "epi-",
            "root": "didymis",
            "suffix": "",
            "meaning": "the coiled tube at the back of the testis where sperm matures and is stored",
            "explanation": "The epididymis is a vital component of the male reproductive system, responsible for storing and nurturing sperm cells produced in the testes before they are released during ejaculation.",
            "chineseTranslation": "副睾丸",
            "traditionalChineseTranslation": "副睾丸",
            "lesson": 2
        },
        {
            "word": "vas deferens",
            "prefix": "",
            "root": "vas deferens",
            "suffix": "",
            "meaning": "the duct through which sperm travels from the testicle to the ejaculatory duct.",
            "explanation": "The vas deferens is a muscular tube that carries sperm from the epididymis in the male reproductive system. It plays a critical role in transporting sperm during ejaculation.",
            "chineseTranslation": "输精管",
            "traditionalChineseTranslation": "輸精管",
            "lesson": 2
        },
        {
            "word": "seminal vesicles",
            "prefix": "se-",
            "root": "mental",
            "suffix": "-icles",
            "meaning": "glands that secrete fluid to nourish and help transport sperm",
            "explanation": "Seminal vesicles are a pair of glands located behind the bladder that produce a significant portion of the fluid (seminal fluid) that makes up semen. This fluid contains sugars that provide energy for the sperm, and it also contains substances that help to enhance sperm motility and viability.",
            "chineseTranslation": "精囊",
            "traditionalChineseTranslation": "精囊",
            "lesson": 2
        },
        {
            "word": "prostate gland",
            "prefix": "pro-",
            "root": "state",
            "suffix": "gland",
            "meaning": "a gland in the male reproductive system that produces fluid that nourishes and transports sperm.",
            "explanation": "The prostate gland is a walnut-sized structure located below the bladder in males. It plays a crucial role in sexual function and reproduction.",
            "chineseTranslation": "前列腺",
            "traditionalChineseTranslation": "前列腺",
            "lesson": 2
        },
        {
            "word": "bulbourethral gland",
            "prefix": "bulbo-",
            "root": "urethral",
            "suffix": "-gland",
            "meaning": "a pair of glands in the male reproductive system that secrete a pre-ejaculatory fluid.",
            "explanation": "The bulbourethral glands, also known as Cowper's glands, are located below the prostate gland and are responsible for producing a lubricating fluid that helps to neutralize acidity in the urethra before ejaculation.",
            "chineseTranslation": "海绵体尿道腺",
            "traditionalChineseTranslation": "海綿體尿道腺",
            "lesson": 2
        },
        {
            "word": "endocrine",
            "prefix": "endo-",
            "root": "crine",
            "suffix": "",
            "meaning": "related to the glands that secrete hormones directly into the bloodstream",
            "explanation": "The endocrine system includes glands such as the pituitary, thyroid, and adrenal glands that produce hormones regulating various bodily functions.",
            "chineseTranslation": "内分泌的",
            "traditionalChineseTranslation": "內分泌的",
            "lesson": 2
        },
        {
            "word": "pituitary gland",
            "prefix": "",
            "root": "pituit-",
            "suffix": "gland",
            "meaning": "a small gland at the base of the brain that produces hormones controlling various bodily functions",
            "explanation": "The pituitary gland, often referred to as the 'master gland', regulates the body's endocrine system by releasing hormones that influence growth, metabolism, and reproduction.",
            "chineseTranslation": "垂体",
            "traditionalChineseTranslation": "垂體",
            "lesson": 2
        },
        {
            "word": "pineal gland",
            "prefix": "",
            "root": "pineal",
            "suffix": "gland",
            "meaning": "A small endocrine gland in the brain that produces melatonin, which regulates sleep patterns.",
            "explanation": "The pineal gland is located deep within the brain and is shaped like a pine cone. It is involved in regulating circadian rhythms, influencing sleep and awake cycles through the secretion of melatonin in response to light and darkness.",
            "chineseTranslation": "松果体",
            "traditionalChineseTranslation": "松果體",
            "lesson": 2
        },
        {
            "word": "thyroid gland",
            "meaning": "A butterfly-shaped gland located in the neck that produces hormones regulating metabolism, growth, and development.",
            "chineseTranslation": "甲状腺",
            "traditionalChineseTranslation": "甲狀腺",
            "explanation": "The thyroid gland plays a crucial role in regulating various bodily functions by releasing hormones such as thyroxine (T4) and triiodothyronine (T3). These hormones influence metabolism, heart rate, and overall energy levels.",
            "prefix": "",
            "root": "thyroid",
            "suffix": "gland",
            "lesson": 2
        },
        {
            "word": "parathyroid gland",
            "prefix": "para-",
            "root": "thyroid",
            "suffix": "gland",
            "meaning": "a gland that produces parathyroid hormone, which regulates calcium levels in the blood.",
            "explanation": "The parathyroid glands are small endocrine glands located behind the thyroid gland in the neck. They play a crucial role in maintaining calcium homeostasis by secreting parathyroid hormone (PTH). PTH raises blood calcium levels by promoting calcium release from bones, increasing calcium reabsorption in kidneys, and enhancing intestinal absorption of calcium.",
            "chineseTranslation": "副甲状腺",
            "traditionalChineseTranslation": "副甲狀腺",
            "lesson": 2
        },
        {
            "word": "adrenal gland",
            "prefix": "ad-",
            "root": "renal",
            "suffix": "gland",
            "meaning": "a hormone-producing gland located above the kidneys that regulates various bodily functions.",
            "explanation": "The adrenal glands are small, triangular-shaped glands located on top of each kidney. They produce hormones like adrenaline, cortisol, and aldosterone, which help regulate metabolism, the immune system, blood pressure, and stress response.",
            "chineseTranslation": "肾上腺",
            "traditionalChineseTranslation": "腎上腺",
            "lesson": 2
        },
        {
            "word": "ophthalmologist",
            "prefix": "ophthalm-",
            "root": "",
            "suffix": "-logist",
            "meaning": "a medical doctor specializing in the diagnosis and treatment of eye disorders and vision problems",
            "explanation": "Ophthalmologists are trained to perform eye surgeries, prescribe eyeglasses and contact lenses, and manage eye diseases such as glaucoma, cataracts, and macular degeneration.",
            "chineseTranslation": "眼科医生",
            "traditionalChineseTranslation": "眼科醫生",
            "lesson": 2
        },
        {
            "word": "apex",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the top or highest part of something, especially one forming a point",
            "explanation": "In medical terminology, the term 'apex' often refers to the pointed end of a structure, such as the apex of the heart. It can also denote the pinnacle or peak of certain anatomical structures.",
            "chineseTranslation": "顶端",
            "traditionalChineseTranslation": "頂端",
            "lesson": 2
        }
    ]
}