{
    "version": "0.0.1",
    "words": [
        {
            "word": "articular cartilage",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The smooth, white tissue that covers the ends of bones where they come together to form joints.",
            "explanation": "Articular cartilage reduces friction between the bones and acts as a shock absorber during movement. It is essential for proper joint function and health.",
            "chineseTranslation": "关节软骨",
            "traditionalChineseTranslation": "關節軟骨",
            "lesson": 3
        },
        {
            "word": "famciclovir",
            "prefix": "",
            "root": "ciclovir",
            "suffix": "",
            "meaning": "an antiviral medication used to treat infections caused by certain viruses, including herpes virus.",
            "explanation": "Famciclovir is a prodrug that converts into penciclovir in the body. It is primarily used in the treatment of herpes simplex infections and shingles.",
            "chineseTranslation": "泛昔洛韦",
            "traditionalChineseTranslation": "泛昔洛韦",
            "lesson": 3
        },
        {
            "word": "epidermis",
            "prefix": "epi-",
            "root": "derm",
            "suffix": "-is",
            "meaning": "the outer layer of skin",
            "explanation": "The epidermis is the topmost layer of skin that provides a barrier to protect the underlying tissues. It is primarily composed of keratinized cells and does not contain blood vessels.",
            "chineseTranslation": "表皮",
            "traditionalChineseTranslation": "表皮",
            "lesson": 3
        },
        {
            "word": "herpes simplex virus",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a virus that causes herpes infections, characterized by sores in the affected areas.",
            "explanation": "Herpes simplex virus (HSV) is a common virus that can cause infections in various parts of the body. The most common types are HSV-1, which typically causes oral herpes, and HSV-2, which primarily causes genital herpes. The virus is highly contagious and can be transmitted through direct contact with an infected individual, even when sores are not visible.",
            "chineseTranslation": "单纯疱疹病毒",
            "traditionalChineseTranslation": "單純皰疹病毒",
            "lesson": 3
        },
        {
            "word": "atrophy",
            "prefix": "a-",
            "root": "troph",
            "suffix": "-y",
            "meaning": "the wasting away or decline in size of a body part or tissue",
            "explanation": "Atrophy usually occurs as a result of disuse, aging, or disease, leading to a decrease in muscle mass or organ size.",
            "chineseTranslation": "萎縮",
            "traditionalChineseTranslation": "萎縮",
            "lesson": 3
        },
        {
            "word": "lotrimin",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A topical antifungal medication used to treat skin infections caused by fungus.",
            "explanation": "Lotrimin is a brand name for medications containing clotrimazole or similar antifungal agents, commonly used to relieve symptoms of athlete's foot, jock itch, and ringworm.",
            "chineseTranslation": "洛特米",
            "traditionalChineseTranslation": "洛特米",
            "lesson": 3
        },
        {
            "word": "antiparasitics",
            "prefix": "anti-",
            "root": "parasite",
            "suffix": "-ics",
            "meaning": "medications used to treat parasitic infections",
            "explanation": "Antiparasitics are substances or medications that destroy or inhibit the growth of parasites, which can include protozoa, worms, and insects in humans or animals.",
            "chineseTranslation": "抗寄生虫药",
            "traditionalChineseTranslation": "抗寄生蟲藥",
            "lesson": 3
        },
        {
            "word": "tinea capitis",
            "prefix": "",
            "root": "tinea",
            "suffix": "",
            "meaning": "a fungal infection of the scalp",
            "explanation": "Tinea capitis, commonly known as scalp ringworm, is a fungal infection that affects the scalp, characterized by itchy, flaking skin and hair loss in patches.",
            "chineseTranslation": "头皮癣",
            "traditionalChineseTranslation": "頭皮癬",
            "lesson": 3
        },
        {
            "word": "triceps",
            "prefix": "tri-",
            "root": "ceps",
            "suffix": "",
            "meaning": "a muscle having three heads or points of origin, primarily found in the back of the upper arm.",
            "explanation": "The triceps muscle is responsible for the extension of the elbow joint and is located on the posterior part of the upper arm. It consists of three main muscle heads: the long head, the lateral head, and the medial head.",
            "chineseTranslation": "三头肌",
            "traditionalChineseTranslation": "三頭肌",
            "lesson": 3
        },
        {
            "word": "myorrhaphy",
            "prefix": "myo-",
            "root": "rrhaphy",
            "suffix": "",
            "meaning": "surgical suturing of a muscle",
            "explanation": "Myorrhaphy involves sewing or stitching together the tissue of a muscle to repair it after injury or surgical intervention.",
            "chineseTranslation": "肌肉缝合术",
            "traditionalChineseTranslation": "肌肉縫合術",
            "lesson": 3
        },
        {
            "word": "humerus",
            "prefix": "",
            "root": "humer",
            "suffix": "",
            "meaning": "the long bone in the upper arm or forelimb, extending from the shoulder to the elbow",
            "explanation": "The humerus is the bone that makes up the upper arm, situated between the shoulder and the elbow. It plays a crucial role in the movement and stability of the arm.",
            "chineseTranslation": "肱骨",
            "traditionalChineseTranslation": "肱骨",
            "lesson": 3
        },
        {
            "word": "pramoxine",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A topical anesthetic used to relieve pain and itching.",
            "explanation": "Pramoxine works by blocking nerve signals in the body, effectively numbing the area where it is applied. It is often used in creams and ointments for relief from conditions like insect bites, minor burns, and skin irritations.",
            "chineseTranslation": "普莫卡因",
            "traditionalChineseTranslation": "普莫卡因",
            "lesson": 3
        },
        {
            "word": "comedo",
            "prefix": "",
            "root": "comed",
            "suffix": "o",
            "meaning": "a clogged hair follicle in the skin, commonly referred to as a blackhead or whitehead.",
            "explanation": "Comedo refers to the small bumps that appear on the skin due to clogged hair follicles. These can be closed (whiteheads) or open (blackheads), depending on whether the clogged material is exposed to air.",
            "chineseTranslation": "粉刺",
            "traditionalChineseTranslation": "粉刺",
            "lesson": 3
        },
        {
            "word": "valtrex",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "an antiviral medication used to treat infections caused by certain types of viruses, mainly herpes viruses.",
            "explanation": "Valtrex is used to manage outbreaks of genital herpes, cold sores, and shingles (herpes zoster). It works by inhibiting viral replication, which helps reduce the severity and duration of symptoms.",
            "chineseTranslation": "伐昔洛韋",
            "traditionalChineseTranslation": "伐昔洛韋",
            "lesson": 3
        },
        {
            "word": "camphor",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a white, crystalline substance with a strong odor used for its medicinal properties.",
            "explanation": "Camphor is often used in medicine as a topical treatment for muscle and joint pain. It is derived from the wood of the camphor tree and has anti-inflammatory properties.",
            "chineseTranslation": "樟脑",
            "traditionalChineseTranslation": "樟腦",
            "lesson": 3
        },
        {
            "word": "tibia",
            "meaning": "the inner and typically larger of the two bones between the knee and the ankle in vertebrates.",
            "chineseTranslation": "胫骨",
            "traditionalChineseTranslation": "脛骨",
            "explanation": "The tibia, commonly known as the shinbone, is one of the main bones of the leg. It bears weight and is essential for walking, running, and jumping.",
            "prefix": "",
            "root": "tibi-",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "ulna",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the longer of the two bones in the forearm, located on the side opposite the thumb",
            "explanation": "The ulna is one of the two long bones in the forearm, the other being the radius. It extends from the elbow to the wrist and is primarily responsible for forming the elbow joint. It is positioned on the inner side of the arm, opposite the thumb.",
            "chineseTranslation": "尺骨",
            "traditionalChineseTranslation": "尺骨",
            "lesson": 3
        },
        {
            "word": "carpals",
            "prefix": "",
            "root": "carp",
            "suffix": "als",
            "meaning": "the eight small bones that make up the wrist",
            "explanation": "Carpals are the bones in the wrist that connect the hand to the forearm, allowing for a range of motion and support.",
            "chineseTranslation": "腕骨",
            "traditionalChineseTranslation": "腕骨",
            "lesson": 3
        },
        {
            "word": "hair follicle",
            "prefix": "",
            "root": "follicle",
            "suffix": "",
            "meaning": "The small cavity or sac in the skin where hair grows.",
            "explanation": "Hair follicles are integral parts of the hair growth cycle. They anchor each hair into the skin and provide the necessary nutrients and support for hair growth.",
            "chineseTranslation": "毛囊",
            "traditionalChineseTranslation": "毛囊",
            "lesson": 3
        },
        {
            "word": "tendinitis",
            "prefix": "tend-",
            "root": "",
            "suffix": "-itis",
            "meaning": "inflammation of a tendon",
            "explanation": "Tendinitis is the condition where a tendon becomes inflamed, usually due to overuse or injury. It often causes pain and restricts movement in the affected area.",
            "chineseTranslation": "腱炎",
            "traditionalChineseTranslation": "腱炎",
            "lesson": 3
        },
        {
            "word": "lordosis",
            "prefix": "",
            "root": "lordos",
            "suffix": "is",
            "meaning": "An abnormal inward curvature of the spine, typically in the lumbar region.",
            "explanation": "Lordosis is a condition where the spine curves excessively inward at the lower back, resulting in a protruding abdomen and buttocks. This curvature can lead to discomfort and may affect posture.",
            "chineseTranslation": "脊柱前凸",
            "traditionalChineseTranslation": "脊柱前凸",
            "lesson": 3
        },
        {
            "word": "hair shaft",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the long, slender part of the hair that protrudes above the skin's surface",
            "explanation": "The hair shaft is the visible part of the hair that extends from the hair follicle outwards. It is composed mainly of keratin, a protein that gives hair its structure and strength.",
            "chineseTranslation": "毛髮幹",
            "traditionalChineseTranslation": "毛髮幹",
            "lesson": 3
        },
        {
            "word": "onychomycosis",
            "prefix": "onycho-",
            "root": "mycosis",
            "suffix": "",
            "meaning": "fungal infection of the nails",
            "explanation": "Onychomycosis is a type of fungal infection that affects the nails, commonly causing discoloration, thickening, and separation of the nail from the nail bed.",
            "chineseTranslation": "甲癣",
            "traditionalChineseTranslation": "甲癬",
            "lesson": 3
        },
        {
            "word": "triceps brachii",
            "prefix": "tri-",
            "root": "ceps",
            "suffix": "brachii",
            "meaning": "muscle with three heads in the upper arm",
            "explanation": "The triceps brachii is a major muscle located at the back of the upper arm. It consists of three distinct muscle heads (long, lateral, and medial) and is primarily responsible for extending the elbow.",
            "chineseTranslation": "肱三头肌",
            "traditionalChineseTranslation": "肱三頭肌",
            "lesson": 3
        },
        {
            "word": "squamous cell",
            "prefix": "",
            "root": "squamous",
            "suffix": "cell",
            "meaning": "A type of epithelial cell that is flat and scale-like.",
            "explanation": "Squamous cells are thin, flat cells that make up the outer layer of the skin and line various organs and cavities in the body. They play a role in protection and absorption.",
            "chineseTranslation": "扁平细胞",
            "traditionalChineseTranslation": "扁平細胞",
            "lesson": 3
        },
        {
            "word": "tenoplasty",
            "prefix": "teno-",
            "root": "plasty",
            "suffix": "",
            "meaning": "surgical repair of a tendon",
            "explanation": "Tenoplasty refers to the surgical procedure aimed at repairing a damaged tendon, often due to injury, degenerative conditions, or disease.",
            "chineseTranslation": "腱成形术",
            "traditionalChineseTranslation": "腱成形術",
            "lesson": 3
        },
        {
            "word": "intervertebral disks",
            "prefix": "inter-",
            "root": "vertebra",
            "suffix": "disks",
            "meaning": "The cartilaginous structures located between the vertebrae in the spine that act as shock absorbers.",
            "explanation": "Intervertebral disks consist of a tough outer layer called the annulus fibrosus and a soft inner core called the nucleus pulposus. They provide support, stability, and flexibility to the spine, and help cushion the vertebrae during movement.",
            "chineseTranslation": "椎间盘",
            "traditionalChineseTranslation": "椎間盤",
            "lesson": 3
        },
        {
            "word": "antibiotics",
            "prefix": "anti-",
            "root": "biot",
            "suffix": "-ics",
            "meaning": "drugs used to treat infections caused by bacteria",
            "explanation": "Antibiotics are substances that kill bacteria or inhibit their growth and are commonly used to treat bacterial infections in humans and animals.",
            "chineseTranslation": "抗生素",
            "traditionalChineseTranslation": "抗生素",
            "lesson": 3
        },
        {
            "word": "paronychia",
            "prefix": "para-",
            "root": "onychia",
            "suffix": "",
            "meaning": "inflammation of the tissue surrounding a nail",
            "explanation": "Paronychia is an infection or inflammation that occurs around the edges of a nail. It can be caused by bacteria, fungi, or irritants and typically leads to redness, swelling, and pain.",
            "chineseTranslation": "指甲周围炎",
            "traditionalChineseTranslation": "指甲周圍炎",
            "lesson": 3
        },
        {
            "word": "extensor digiti minimi",
            "meaning": "a muscle in the forearm that extends the little finger",
            "chineseTranslation": "小指伸肌",
            "traditionalChineseTranslation": "小指伸肌",
            "explanation": "The extensor digiti minimi is a muscle located in the posterior compartment of the forearm, responsible for extending the little finger.",
            "prefix": "ex-",
            "root": "tens",
            "suffix": "or",
            "lesson": 3
        },
        {
            "word": "peroneus longus",
            "prefix": "per-",
            "root": "oneus",
            "suffix": "longus",
            "meaning": "a muscle located in the lower leg that helps with foot movement and stability",
            "explanation": "The peroneus longus is a muscle that originates from the fibula and acts to evert and plantarflex the foot. It is important for balance and lateral stability when walking or running.",
            "chineseTranslation": "腓骨长肌",
            "traditionalChineseTranslation": "腓骨長肌",
            "lesson": 3
        },
        {
            "word": "tendoplasty",
            "prefix": "tendo-",
            "root": "plasty",
            "suffix": "",
            "meaning": "surgical repair or reconstruction of a tendon",
            "explanation": "Tendoplasty is a surgical procedure aimed at repairing or reconstructing damaged tendons to restore their function and integrity.",
            "chineseTranslation": "肌腱成形术",
            "traditionalChineseTranslation": "肌腱成形術",
            "lesson": 3
        },
        {
            "word": "pallor",
            "prefix": "",
            "root": "pall-",
            "suffix": "",
            "meaning": "an unnatural lack of color in the skin",
            "explanation": "Pallor refers to a pale appearance of the skin, which may be caused by various medical conditions, including anemia, shock, or emotional distress.",
            "chineseTranslation": "苍白",
            "traditionalChineseTranslation": "蒼白",
            "lesson": 3
        },
        {
            "word": "adhesion",
            "prefix": "",
            "root": "hesion",
            "suffix": "",
            "meaning": "the action or state of adhering to a surface or object.",
            "explanation": "Adhesion refers to the process by which cells or tissues stick to each other or to a surface. In a medical context, this term can describe the formation of abnormal fibrous bands that can develop after surgery or injury, binding organs or tissues together.",
            "chineseTranslation": "附着",
            "traditionalChineseTranslation": "附著",
            "lesson": 3
        },
        {
            "word": "dermatologist",
            "prefix": "dermato-",
            "root": "logy",
            "suffix": "-ist",
            "meaning": "a medical specialist who diagnoses and treats skin disorders.",
            "explanation": "Dermatologists are trained to handle various skin-related issues, including acne, eczema, skin infections, and skin cancer. They perform skin examinations and may also carry out surgeries or procedures related to skin care.",
            "chineseTranslation": "皮肤科医生",
            "traditionalChineseTranslation": "皮膚科醫生",
            "lesson": 3
        },
        {
            "word": "ungual",
            "prefix": "un-",
            "root": "gu",
            "suffix": "-al",
            "meaning": "related to the nails",
            "explanation": "The term 'ungual' refers to anything related to the nails, particularly the body's fingernails and toenails. It derives from the Latin word 'unguis', meaning 'nail'.",
            "chineseTranslation": "爪的",
            "traditionalChineseTranslation": "爪的",
            "lesson": 3
        },
        {
            "word": "basal cell",
            "prefix": "bas-",
            "root": "cell",
            "suffix": "",
            "meaning": "a type of skin cell that is found in the lowest layer of the epidermis",
            "explanation": "Basal cells are responsible for producing new skin cells; they are located in the basal layer of the epidermis and help in the regeneration of the skin.",
            "chineseTranslation": "基底细胞",
            "traditionalChineseTranslation": "基底細胞",
            "lesson": 3
        },
        {
            "word": "lunula",
            "prefix": "",
            "root": "lun",
            "suffix": "ula",
            "meaning": "the crescent-shaped area at the base of a nail",
            "explanation": "The lunula is the visible part of the nail matrix, shaped like a half-moon, which is often most noticeable on the thumb and may not be visible on all fingers.",
            "chineseTranslation": "半月形",
            "traditionalChineseTranslation": "半月形",
            "lesson": 3
        },
        {
            "word": "Kaposi’s Sarcoma",
            "prefix": "",
            "root": "sarcoma",
            "suffix": "",
            "meaning": "A type of cancer that forms in the lining of blood vessels and lymph nodes, often associated with HIV/AIDS.",
            "explanation": "Kaposi’s sarcoma appears as undesirable lesions on the skin or mucous membranes and can also affect internal organs. It is characterized by purple or brown patches and is caused by the human herpesvirus 8 (HHV-8). It is named after Moritz Kaposi, a Hungarian dermatologist who first described the disease in the 19th century.",
            "chineseTranslation": "卡波西肉瘤",
            "traditionalChineseTranslation": "卡波西肉瘤",
            "lesson": 3
        },
        {
            "word": "Neosporin",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A topical antibiotic ointment used to prevent infection in minor cuts, scrapes, and burns.",
            "explanation": "Neosporin contains a combination of antibiotics (neomycin, polymyxin B, and bacitracin) that work together to inhibit the growth of bacteria and prevent infection in minor wounds.",
            "chineseTranslation": "新邦霉素",
            "traditionalChineseTranslation": "新邦霉素",
            "lesson": 3
        },
        {
            "word": "lice",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "small parasites that infest the hair and skin of humans and other mammals",
            "explanation": "Lice are wingless insects that can infest the hair and skin, feeding on blood. They are commonly found in human populations, particularly among school-aged children, and can cause itching and irritation.",
            "chineseTranslation": "虱子",
            "traditionalChineseTranslation": "虱子",
            "lesson": 3
        },
        {
            "word": "compact bone",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a dense and strong type of bone that forms the outer layer of bones and provides structural support and protection",
            "explanation": "Compact bone is characterized by its dense structure and is primarily responsible for the strength and rigidity of the skeleton. It contains tightly packed osteons or Haversian systems that facilitate the transport of nutrients and waste within the bone.",
            "chineseTranslation": "致密骨",
            "traditionalChineseTranslation": "致密骨",
            "lesson": 3
        },
        {
            "word": "varicella",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a contagious viral infection causing fever and a characteristic itchy skin rash with red spots and blisters, commonly known as chickenpox.",
            "explanation": "Varicella is caused by the varicella-zoster virus (VZV), which is a member of the herpesvirus family. It is primarily spread through respiratory droplets or direct contact with the rash. Symptoms typically appear 10 to 21 days after exposure and include fever, tiredness, loss of appetite, and headache, followed by the characteristic rash that progresses from red spots to fluid-filled blisters that eventually crust over.",
            "chineseTranslation": "水痘",
            "traditionalChineseTranslation": "水痘",
            "lesson": 3
        },
        {
            "word": "tenodynia",
            "prefix": "teno-",
            "root": "dynia",
            "suffix": "",
            "meaning": "pain in a tendon",
            "explanation": "Tenodynia refers specifically to pain located in the tendons, which are the fibrous tissues that connect muscles to bones.",
            "chineseTranslation": "肌腱痛",
            "traditionalChineseTranslation": "肌腱痛",
            "lesson": 3
        },
        {
            "word": "albinism",
            "prefix": "",
            "root": "albino",
            "suffix": "-ism",
            "meaning": "a genetic condition characterized by a deficiency of pigment in the skin, hair, and eyes.",
            "explanation": "Albinism is caused by a lack of melanin, the pigment responsible for color in the skin, hair, and eyes. This results in lighter skin and hair and can affect vision. Individuals with albinism are more susceptible to sunburn and skin cancer due to the lack of melanin's protective barrier.",
            "chineseTranslation": "白化病",
            "traditionalChineseTranslation": "白化病",
            "lesson": 3
        },
        {
            "word": "anti-virals",
            "prefix": "anti-",
            "root": "virus",
            "suffix": "-al",
            "meaning": "medications used to treat viral infections",
            "explanation": "Anti-virals are a class of medication that inhibit the growth of viruses. They are used to treat infections caused by viruses, such as influenza, HIV, and hepatitis.",
            "chineseTranslation": "抗病毒药物",
            "traditionalChineseTranslation": "抗病毒藥物",
            "lesson": 3
        },
        {
            "word": "keloid",
            "prefix": "",
            "root": "kel-",
            "suffix": "-oid",
            "meaning": "an abnormal scar that rises above the skin surface and is due to an overproduction of collagen.",
            "explanation": "Keloids are a type of thick, raised scar that forms when the body produces too much collagen during the healing process after an injury or surgery. They can be larger than the original wound and may occur anywhere on the body.",
            "chineseTranslation": "瘢痕疙瘩",
            "traditionalChineseTranslation": "瘢痕疙瘩",
            "lesson": 3
        },
        {
            "word": "polymyxin B",
            "prefix": "poly-",
            "root": "myxin",
            "suffix": "B",
            "meaning": "a type of antibiotic used to treat infections caused by Gram-negative bacteria.",
            "explanation": "Polymyxin B is an antibiotic that is primarily effective against certain Gram-negative bacteria and is often used in topical formulations. It works by disrupting the cell membrane of the bacteria, leading to cell death.",
            "chineseTranslation": "多粘菌素B",
            "traditionalChineseTranslation": "多粘菌素B",
            "lesson": 3
        },
        {
            "word": "epiphyseal line",
            "meaning": "the line that indicates the site of growth plate closure at the ends of long bones",
            "chineseTranslation": "骨骺线",
            "traditionalChineseTranslation": "骨骺線",
            "explanation": "The epiphyseal line is a remnant of the growth plate (epiphyseal plate) in long bones, which is responsible for the lengthwise growth during childhood and adolescence. Once growth is complete, this area becomes ossified and is marked by the epiphyseal line where the epiphysis and diaphysis fuse.",
            "prefix": "epi-",
            "root": "physe",
            "suffix": "-al",
            "lesson": 3
        },
        {
            "word": "vesicle",
            "prefix": "",
            "root": "vesic-",
            "suffix": "-cle",
            "meaning": "a small fluid-filled sac",
            "explanation": "Vesicles are small membrane-bound structures within cells that can transport materials or serve as storage for substances like proteins or waste.",
            "chineseTranslation": "囊泡",
            "traditionalChineseTranslation": "囊泡",
            "lesson": 3
        },
        {
            "word": "goosebumps",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the small raised areas on a person's skin caused by cold, fear, or excitement",
            "explanation": "Goosebumps occur when tiny muscles at the base of hair follicles contract, causing the hair to stand up and the skin to form small bumps. This reaction is part of the body's response to cold or emotional stimuli, often associated with a feeling of fear or excitement.",
            "chineseTranslation": "鸡皮疙瘩",
            "traditionalChineseTranslation": "雞皮疙瘩",
            "lesson": 3
        },
        {
            "word": "scapula",
            "prefix": "",
            "root": "scapul-",
            "suffix": "",
            "meaning": "Shoulder blade",
            "explanation": "The scapula is a flat, triangular bone located in the upper back that connects the humerus (arm bone) with the clavicle (collarbone). It serves as an attachment point for several muscles that facilitate shoulder movement.",
            "chineseTranslation": "肩胛骨",
            "traditionalChineseTranslation": "肩胛骨",
            "lesson": 3
        },
        {
            "word": "extensor hallucis brevis",
            "prefix": "ex-",
            "root": "tensor",
            "suffix": "-is brevis",
            "meaning": "a muscle that extends the big toe",
            "explanation": "The extensor hallucis brevis is a small muscle located in the foot that functions primarily to extend the big toe. It is involved in dorsiflexion of the big toe and plays a role in walking and running by aiding in the lifting of the toe during movement.",
            "chineseTranslation": "短拇趾伸肌",
            "traditionalChineseTranslation": "短拇趾伸肌",
            "lesson": 3
        },
        {
            "word": "radius",
            "prefix": "",
            "root": "radi-",
            "suffix": "-us",
            "meaning": "the bone of the forearm on the thumb side, extending from the elbow to the wrist.",
            "explanation": "The radius is one of two bones in the forearm, the other being the ulna. It is located on the lateral side (thumb side) when in the standard anatomical position and plays a crucial role in the movement of the wrist and hand.",
            "chineseTranslation": "桡骨",
            "traditionalChineseTranslation": "桡骨",
            "lesson": 3
        },
        {
            "word": "keratin",
            "prefix": "",
            "root": "kerat-",
            "suffix": "",
            "meaning": "a fibrous protein forming the main structural constituent of hair, nails, and the outer layer of skin",
            "explanation": "Keratin is a key structural protein found in the skin, hair, and nails. It provides strength and protection to these tissues and is crucial for the body’s barrier function.",
            "chineseTranslation": "角蛋白",
            "traditionalChineseTranslation": "角蛋白",
            "lesson": 3
        },
        {
            "word": "abscess",
            "prefix": "",
            "root": "cess",
            "suffix": "-abs",
            "meaning": "a localized collection of pus in the tissues of the body, often due to infection.",
            "explanation": "An abscess forms when the body's immune system tries to fight an infection, leading to a buildup of pus. This condition can occur anywhere in the body and is often painful.",
            "chineseTranslation": "脓肿",
            "traditionalChineseTranslation": "膿腫",
            "lesson": 3
        },
        {
            "word": "proximal epiphysis",
            "prefix": "pro-",
            "root": "epiphysis",
            "suffix": "",
            "meaning": "the end of a long bone closest to the body’s midline",
            "explanation": "The proximal epiphysis is the part of the bone that is closest to where it connects to the rest of the body, forming joints and allowing for movement.",
            "chineseTranslation": "近端骨骺",
            "traditionalChineseTranslation": "近端骨骺",
            "lesson": 3
        },
        {
            "word": "biopsy",
            "prefix": "bio-",
            "root": "opsy",
            "suffix": "",
            "meaning": "the removal and examination of tissue from a living body",
            "explanation": "A biopsy is a medical procedure in which a sample of tissue is taken from the body to be examined for disease, such as cancer. It is commonly used to diagnose various conditions.",
            "chineseTranslation": "活检",
            "traditionalChineseTranslation": "活檢",
            "lesson": 3
        },
        {
            "word": "xeroderma",
            "prefix": "xero-",
            "root": "derma",
            "suffix": "",
            "meaning": "a condition characterized by abnormally dry skin",
            "explanation": "Xeroderma refers to dry skin that can be caused by a variety of factors, including environmental conditions or inherited disorders.",
            "chineseTranslation": "干皮症",
            "traditionalChineseTranslation": "乾皮症",
            "lesson": 3
        },
        {
            "word": "eczema",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a medical condition that causes the skin to become inflamed, itchy, and red.",
            "explanation": "Eczema is a chronic condition that can occur due to various triggers such as allergens, stress, or irritants. It is characterized by patches of dry, itchy skin that can sometimes become infected.",
            "chineseTranslation": "湿疹",
            "traditionalChineseTranslation": "濕疹",
            "lesson": 3
        },
        {
            "word": "diaphoresis",
            "prefix": "dia-",
            "root": "phor",
            "suffix": "-esis",
            "meaning": "excessive sweating",
            "explanation": "Diaphoresis refers to the condition of excessive sweating, which can occur as a response to various physiological or emotional stimuli.",
            "chineseTranslation": "多汗症",
            "traditionalChineseTranslation": "多汗症",
            "lesson": 3
        },
        {
            "word": "urticaria",
            "prefix": "",
            "root": "urtic-",
            "suffix": "-aria",
            "meaning": "a skin reaction characterized by hives or welts",
            "explanation": "Urticaria, commonly known as hives, is a condition where the skin develops raised, itchy welts, often in response to allergens or irritants.",
            "chineseTranslation": "荨麻疹",
            "traditionalChineseTranslation": "荨麻疹",
            "lesson": 3
        },
        {
            "word": "erythema",
            "prefix": "",
            "root": "erythema",
            "suffix": "",
            "meaning": "redness of the skin caused by increased blood flow",
            "explanation": "Erythema refers to a superficial reddening of the skin, usually in patches, as a result of injury, inflammation, or allergic reactions. It is often a clinical symptom associated with various dermatological conditions.",
            "chineseTranslation": "紅斑",
            "traditionalChineseTranslation": "紅斑",
            "lesson": 3
        },
        {
            "word": "arthroplasty",
            "prefix": "arthro-",
            "root": "plast",
            "suffix": "-y",
            "meaning": "surgical reconstruction or replacement of a joint",
            "explanation": "Arthroplasty is a surgical procedure to restore the function of a joint, typically by replacing the damaged joint with an artificial one or by reshaping the existing joint.",
            "chineseTranslation": "关节成形术",
            "traditionalChineseTranslation": "關節成形術",
            "lesson": 3
        },
        {
            "word": "teres major",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a muscle of the upper arm that helps in the movement of the shoulder joint",
            "explanation": "The teres major is a thick, rounded muscle located on the posterior aspect of the shoulder. It originates from the lower part of the scapula and attaches to the humerus, playing a role in shoulder adduction, extension, and medial rotation.",
            "chineseTranslation": "大圆肌",
            "traditionalChineseTranslation": "大圓肌",
            "lesson": 3
        },
        {
            "word": "spongy bone",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A type of bone tissue that has a porous, honeycomb-like structure, found mainly at the ends of long bones and in the interior of others, providing strength and reducing weight.",
            "explanation": "Spongy bone, also known as cancellous bone, contains spaces filled with marrow and contributes to the lightweight structure of bones while still providing support.",
            "chineseTranslation": "松质骨",
            "traditionalChineseTranslation": "鬆質骨",
            "lesson": 3
        },
        {
            "word": "polymyositis",
            "meaning": "A rare inflammatory disease that causes muscle weakness and inflammation in multiple muscle groups.",
            "chineseTranslation": "多发性肌炎",
            "traditionalChineseTranslation": "多發性肌炎",
            "explanation": "Polymyositis is characterized by muscle inflammation and progressive weakness, often affecting the muscles closest to the trunk of the body. It may be associated with other autoimmune diseases.",
            "prefix": "poly-",
            "root": "myos",
            "suffix": "-itis",
            "lesson": 3
        },
        {
            "word": "procaine",
            "prefix": "pro-",
            "root": "cain",
            "suffix": "",
            "meaning": "a local anesthetic used to cause loss of sensation in a specific area of the body.",
            "explanation": "Procaine is a type of local anesthetic that blocks nerve impulses in the area where it is applied, used commonly in dental procedures and minor surgeries.",
            "chineseTranslation": "普鲁卡因",
            "traditionalChineseTranslation": "普魯卡因",
            "lesson": 3
        },
        {
            "word": "external oblique",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A muscle located on the side and front of the abdomen that helps in rotating and bending the trunk.",
            "explanation": "The external oblique is one of the three flat muscles of the lateral anterior abdomen. It is important for trunk rotation and lateral bending, and its contractions assist in movements like twisting and bending the torso.",
            "chineseTranslation": "外斜肌",
            "traditionalChineseTranslation": "外斜肌",
            "lesson": 3
        },
        {
            "word": "gangrene",
            "prefix": "",
            "root": "gangr-",
            "suffix": "",
            "meaning": "tissue death or decay caused by a lack of blood supply or infection",
            "explanation": "Gangrene is a serious condition that occurs when a considerable mass of body tissue dies due to an inadequate blood supply, which may result from injuries, infections, or chronic illnesses. The dead tissue can become infected, leading to potential complications.",
            "chineseTranslation": "坏疽",
            "traditionalChineseTranslation": "壞疽",
            "lesson": 3
        },
        {
            "word": "tarsals",
            "prefix": "",
            "root": "tars-",
            "suffix": "-als",
            "meaning": "The series of seven bones in the foot that connect the leg to the bones of the toes.",
            "explanation": "Tarsals are a group of bones in the foot located between the lower leg and the metatarsals. They play a crucial role in supporting the structure of the foot and facilitating movement.",
            "chineseTranslation": "跗骨",
            "traditionalChineseTranslation": "跗骨",
            "lesson": 3
        },
        {
            "word": "warts",
            "meaning": "A small, rough growth on the skin caused by a virus, typically the human papillomavirus (HPV).",
            "chineseTranslation": "疣",
            "traditionalChineseTranslation": "疣",
            "explanation": "Warts are benign (non-cancerous) epithelial tumors that can appear on various parts of the body. They are usually harmless and may resolve on their own without treatment, but can be bothersome or unsightly.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "fibroblast",
            "prefix": "fibro-",
            "root": "blast",
            "suffix": "",
            "meaning": "a type of cell that generates connective tissue and is responsible for the synthesis of extracellular matrix and collagen.",
            "explanation": "Fibroblasts are vital cells in the body that facilitate the healing process by producing collagen and other fibers. They are primarily found in connective tissues.",
            "chineseTranslation": "成纤维细胞",
            "traditionalChineseTranslation": "成纖維細胞",
            "lesson": 3
        },
        {
            "word": "spasm",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A sudden involuntary contraction of a muscle or group of muscles.",
            "explanation": "Spasms can occur in various muscles of the body and may result in pain or discomfort. They can be caused by a variety of factors including overuse, dehydration, or underlying medical conditions.",
            "chineseTranslation": "痉挛",
            "traditionalChineseTranslation": "痙攣",
            "lesson": 3
        },
        {
            "word": "corticosteroid cream",
            "prefix": "",
            "root": "corticosteroid",
            "suffix": "",
            "meaning": "A type of medication used to reduce inflammation and alleviate symptoms in various skin conditions.",
            "explanation": "Corticosteroid creams are applied topically to treat skin conditions such as eczema and psoriasis by decreasing inflammation, redness, and itching.",
            "chineseTranslation": "皮质类固醇乳膏",
            "traditionalChineseTranslation": "皮質類固醇乳膏",
            "lesson": 3
        },
        {
            "word": "rubella",
            "prefix": "",
            "root": "rubell",
            "suffix": "",
            "meaning": "a contagious viral infection characterized by a rash and mild fever",
            "explanation": "Rubella, also known as German measles, is caused by the rubella virus and is often characterized by a distinctive rash that typically lasts about 3 days, along with mild fever and swelling of the lymph nodes. It is particularly dangerous in pregnant women, as it can lead to congenital rubella syndrome in infants.",
            "chineseTranslation": "风疹",
            "traditionalChineseTranslation": "風疹",
            "lesson": 3
        },
        {
            "word": "abrasion",
            "prefix": "",
            "root": "abras-",
            "suffix": "-ion",
            "meaning": "a scraped area on the skin or mucous membrane",
            "explanation": "An abrasion is typically a superficial injury that occurs when the skin is scraped against a rough surface, leading to the removal of the skin's top layers.",
            "chineseTranslation": "擦伤",
            "traditionalChineseTranslation": "擦傷",
            "lesson": 3
        },
        {
            "word": "flexor carpi",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a muscle in the forearm that flexes the wrist",
            "explanation": "The flexor carpi muscles are responsible for the flexion of the wrist and are essential for grasping and gripping movements.",
            "chineseTranslation": "腕屈肌",
            "traditionalChineseTranslation": "腕屈肌",
            "lesson": 3
        },
        {
            "word": "papule",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small, raised, solid pimple or swelling, typically less than 1 cm in diameter, that can be red or the same color as the skin",
            "explanation": "Papules are small, raised bumps on the skin that are often a sign of a skin condition, such as acne, eczema, or psoriasis. They may be itchy or tender.",
            "chineseTranslation": "丘疹",
            "traditionalChineseTranslation": "丘疹",
            "lesson": 3
        },
        {
            "word": "maxilla",
            "prefix": "",
            "root": "maxill",
            "suffix": "",
            "meaning": "the upper jawbone in mammals, containing the teeth and forming the upper part of the jaw",
            "explanation": "The maxilla is one of the facial bones and plays a crucial role in forming the boundaries of the oral cavity and supporting the upper teeth. It also contributes to the structure of the eye sockets and nasal cavity.",
            "chineseTranslation": "上颌骨",
            "traditionalChineseTranslation": "上顎骨",
            "lesson": 3
        },
        {
            "word": "tinea pedis",
            "prefix": "",
            "root": "tinea (ringworm)",
            "suffix": "",
            "meaning": "a fungal infection of the foot, commonly known as athlete's foot",
            "explanation": "Tinea pedis is caused by dermatophyte fungi and typically manifests as itching, burning, and cracks in the skin of the feet, particularly between the toes.",
            "chineseTranslation": "足癬",
            "traditionalChineseTranslation": "足癬",
            "lesson": 3
        },
        {
            "word": "phalanges",
            "prefix": "",
            "root": "phalang-",
            "suffix": "es",
            "meaning": "the bones of the fingers and toes",
            "explanation": "Phalanges are the bones that make up the digits, consisting of three bones in each finger and two in each thumb, as well as two in each toe, and one in each big toe.",
            "chineseTranslation": "趾骨",
            "traditionalChineseTranslation": "趾骨",
            "lesson": 3
        },
        {
            "word": "gluteus medius",
            "meaning": "a muscle located on the outer surface of the pelvis, involved in the movement and stabilization of the hip.",
            "chineseTranslation": "中臀肌",
            "traditionalChineseTranslation": "中臀肌",
            "explanation": "The gluteus medius is one of the three gluteal muscles and plays a crucial role in hip abduction and stabilization of the pelvis during walking or running.",
            "prefix": "",
            "root": "gluteus",
            "suffix": "medius",
            "lesson": 3
        },
        {
            "word": "red bone marrow",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A type of tissue found in the cavities of bones, responsible for producing blood cells.",
            "explanation": "Red bone marrow contains hematopoietic stem cells which differentiate into various types of blood cells including red blood cells, white blood cells, and platelets. It is crucial for the body's blood production.",
            "chineseTranslation": "红骨髓",
            "traditionalChineseTranslation": "紅骨髓",
            "lesson": 3
        },
        {
            "word": "monistat",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "An antifungal medication used to treat vaginal yeast infections.",
            "explanation": "Monistat is a brand name for the drug miconazole, which works by inhibiting the growth of fungi and yeast, thereby alleviating the symptoms of infections.",
            "chineseTranslation": "莫尼斯塔特",
            "traditionalChineseTranslation": "莫尼斯塔特",
            "lesson": 3
        },
        {
            "word": "ecchymosis",
            "prefix": "ec-",
            "root": "chymo",
            "suffix": "-osis",
            "meaning": "a discoloration of the skin resulting from bleeding underneath, typically caused by bruising.",
            "explanation": "Ecchymosis occurs when small blood vessels burst, causing blood to leak into the skin or mucous membranes. This results in a visible bruise that can change color as it heals.",
            "chineseTranslation": "瘀斑",
            "traditionalChineseTranslation": "瘀斑",
            "lesson": 3
        },
        {
            "word": "laceration",
            "prefix": "",
            "root": "lacer",
            "suffix": "ation",
            "meaning": "A deep cut or tear in skin or flesh.",
            "explanation": "Laceration typically occurs as a result of trauma, such as an injury from a sharp object, and may vary in severity.",
            "chineseTranslation": "撕裂伤",
            "traditionalChineseTranslation": "撕裂傷",
            "lesson": 3
        },
        {
            "word": "pectoralis major",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the larger of the two pectoral muscles, mainly responsible for the movement of the shoulder joint",
            "explanation": "The pectoralis major is a thick, fan-shaped muscle situated at the upper chest, situated under the breasts in females and is involved in the movement of the shoulder joint, contributing to actions such as pushing, pulling, and lifting.",
            "chineseTranslation": "大胸肌",
            "traditionalChineseTranslation": "大胸肌",
            "lesson": 3
        },
        {
            "word": "sartorius",
            "prefix": "",
            "root": "sartorius",
            "suffix": "",
            "meaning": "a long, thin muscle in the thigh that helps flex the hip and knee",
            "explanation": "The sartorius muscle runs diagonally across the thigh and is involved in movements such as crossing the legs. It is the longest muscle in the human body.",
            "chineseTranslation": "缝匠肌",
            "traditionalChineseTranslation": "縫匠肌",
            "lesson": 3
        },
        {
            "word": "tenorraphy",
            "prefix": "",
            "root": "tenor",
            "suffix": "raphy",
            "meaning": "surgical suturing of a tendon",
            "explanation": "Tenorraphy is a surgical procedure where the ends of a severed tendon are sewn back together to promote healing and restore function.",
            "chineseTranslation": "腱缝合术",
            "traditionalChineseTranslation": "腱縫合術",
            "lesson": 3
        },
        {
            "word": "necrosis",
            "prefix": "",
            "root": "necro-",
            "suffix": "-osis",
            "meaning": "the death of cells or tissues in the body",
            "explanation": "Necrosis refers to the process through which cells die due to factors such as injury, lack of blood flow, or infection. This condition can lead to the breakdown of tissue and can affect various parts of the body.",
            "chineseTranslation": "坏死",
            "traditionalChineseTranslation": "壞死",
            "lesson": 3
        },
        {
            "word": "melanocyte",
            "prefix": "melano-",
            "root": "cyte",
            "suffix": "",
            "meaning": "a type of cell that produces melanin, responsible for pigmentation in skin and hair",
            "explanation": "Melanocytes are specialized cells found primarily in the epidermis (the outer layer of skin) that produce the pigment melanin, which gives color to skin and hair and provides some protection against ultraviolet (UV) radiation.",
            "chineseTranslation": "黑素细胞",
            "traditionalChineseTranslation": "黑素細胞",
            "lesson": 3
        },
        {
            "word": "dermatitis",
            "prefix": "derma-",
            "root": "itis",
            "suffix": "",
            "meaning": "inflammation of the skin",
            "explanation": "Dermatitis is a condition characterized by inflammation of the skin, which can result in redness, swelling, and itching. It can be caused by various factors, including allergens, irritants, and genetic predisposition.",
            "chineseTranslation": "皮炎",
            "traditionalChineseTranslation": "皮炎",
            "lesson": 3
        },
        {
            "word": "epidermal",
            "prefix": "epi-",
            "root": "derm",
            "suffix": "-al",
            "meaning": "pertaining to the outer layer of skin",
            "explanation": "The term 'epidermal' refers to the epidermis, which is theoutermost layer of skin that provides a protective barrier to underlying tissues.",
            "chineseTranslation": "表皮的",
            "traditionalChineseTranslation": "表皮的",
            "lesson": 3
        },
        {
            "word": "zovirax",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "an antiviral medication used to treat infections caused by certain viruses, particularly herpes virus infections.",
            "explanation": "Zovirax is primarily used to treat infections caused by herpes simplex viruses, including genital herpes and cold sores, as well as shingles caused by varicella-zoster virus.",
            "chineseTranslation": "阿昔洛韦",
            "traditionalChineseTranslation": "阿昔洛韋",
            "lesson": 3
        },
        {
            "word": "myosarcoma",
            "prefix": "myo-",
            "root": "sarcoma",
            "suffix": "",
            "meaning": "a malignant tumor of muscle tissue",
            "explanation": "Myosarcoma is a type of sarcoma that specifically arises from muscle tissue and can occur in various locations in the body.",
            "chineseTranslation": "肌肉肉瘤",
            "traditionalChineseTranslation": "肌肉肉瘤",
            "lesson": 3
        },
        {
            "word": "basal cell",
            "prefix": "",
            "root": "basal",
            "suffix": "",
            "meaning": "A type of cell that is found in the basal layer of the epidermis, which is the outermost layer of the skin.",
            "explanation": "Basal cells are responsible for producing new skin cells and are located in the lowest portion of the epidermis. They divide to form new cells which then migrate upwards to replace dying cells on the skin surface. Basal cells can also give rise to basal cell carcinoma, a common form of skin cancer.",
            "chineseTranslation": "基底细胞",
            "traditionalChineseTranslation": "基底細胞",
            "lesson": 3
        },
        {
            "word": "pubis",
            "prefix": "",
            "root": "pubis",
            "suffix": "",
            "meaning": "the ventral and anterior part of the pelvis",
            "explanation": "The pubis is one of the three major bones that make up the pelvis, sitting in the front portion and providing structure and support to the pelvic region.",
            "chineseTranslation": "耻骨",
            "traditionalChineseTranslation": "恥骨",
            "lesson": 3
        },
        {
            "word": "flexor carpi radialis",
            "prefix": "",
            "root": "flexor",
            "suffix": "",
            "meaning": "a muscle that flexes the wrist and abducts the hand",
            "explanation": "The flexor carpi radialis is a muscle located in the forearm that is responsible for bending the wrist (flexion) and moving the hand in the radial direction (abduction).",
            "chineseTranslation": "桡侧腕屈肌",
            "traditionalChineseTranslation": "橈側腕屈肌",
            "lesson": 3
        },
        {
            "word": "tendinous",
            "prefix": "",
            "root": "tendin-",
            "suffix": "-ous",
            "meaning": "pertaining to a tendon",
            "explanation": "The term 'tendinous' is used to describe structures, conditions, or diseases that are related to tendons, which are the fibrous tissues that connect muscles to bones.",
            "chineseTranslation": "腱的",
            "traditionalChineseTranslation": "腱的",
            "lesson": 3
        },
        {
            "word": "thoraco-lumbar fascia",
            "meaning": "a connective tissue structure in the lower back that extends from the thoracic region to the lumbar region",
            "chineseTranslation": "胸腰筋膜",
            "traditionalChineseTranslation": "胸腰筋膜",
            "explanation": "The thoraco-lumbar fascia is a sheet of connective tissue that provides support and stability to the lower back and serves as an attachment point for muscles in that region.",
            "prefix": "thoraco-",
            "root": "lumbar",
            "suffix": "fascia",
            "lesson": 3
        },
        {
            "word": "femur",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the thigh bone, which is the longest bone in the human body",
            "explanation": "The femur connects the hip to the knee and supports the weight of the body during activities such as walking, running, and standing.",
            "chineseTranslation": "股骨",
            "traditionalChineseTranslation": "股骨",
            "lesson": 3
        },
        {
            "word": "myorrhexis",
            "prefix": "myo-",
            "root": "rrhexis",
            "suffix": "",
            "meaning": "muscle rupture",
            "explanation": "Myorrhexis refers to the tearing or rupture of muscle tissue. It may occur due to trauma or excessive strain on the muscles.",
            "chineseTranslation": "肌肉破裂",
            "traditionalChineseTranslation": "肌肉破裂",
            "lesson": 3
        },
        {
            "word": "lubrical",
            "prefix": "",
            "root": "lubric",
            "suffix": "-al",
            "meaning": "relating to or producing lubrication",
            "explanation": "Lubrical refers to substances that reduce friction between surfaces, typically in the context of bodily fluids or medical applications where lubrication is essential for function or comfort.",
            "chineseTranslation": "润滑的",
            "traditionalChineseTranslation": "潤滑的",
            "lesson": 3
        },
        {
            "word": "gracilis",
            "prefix": "",
            "root": "gracilis",
            "suffix": "",
            "meaning": "a thin or slender muscle in the human body",
            "explanation": "Gracilis is a muscle located in the inner thigh; it is involved in the movement of the hip and knee.",
            "chineseTranslation": "股薄肌",
            "traditionalChineseTranslation": "股薄肌",
            "lesson": 3
        },
        {
            "word": "semimembranosus",
            "prefix": "semi-",
            "root": "membran-",
            "suffix": "-osus",
            "meaning": "a muscle located at the back of the thigh that helps in flexing the knee and extending the hip",
            "explanation": "The semimembranosus is one of the three hamstring muscles, situated medially in the posterior compartment of the thigh, and is involved in the movement of the leg and stabilization of the pelvis.",
            "chineseTranslation": "半膜肌",
            "traditionalChineseTranslation": "半膜肌",
            "lesson": 3
        },
        {
            "word": "microphage",
            "prefix": "micro-",
            "root": "phage",
            "suffix": "",
            "meaning": "a type of white blood cell that ingests small particles, such as bacteria and dead cells.",
            "explanation": "Microphages are a subset of immune cells that play a critical role in the body's defense against pathogens by engulfing and digesting them. They are essential for maintaining tissue homeostasis and responding to infections.",
            "chineseTranslation": "小吞噬细胞",
            "traditionalChineseTranslation": "小吞噬細胞",
            "lesson": 3
        },
        {
            "word": "pronation",
            "prefix": "",
            "root": "pronat",
            "suffix": "ion",
            "meaning": "The action of rotating the forearm or foot so that the palm or sole faces downwards or backwards.",
            "explanation": "Pronation refers to the rotational movement of the arm or the inward roll of the foot while walking or running. In the forearm, it involves rotating the radius and ulna such that the palm faces down. In the foot, it refers to the posture where the arch flattens and the foot rolls inward upon landing.",
            "chineseTranslation": "旋前",
            "traditionalChineseTranslation": "旋前",
            "lesson": 3
        },
        {
            "word": "ribs",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The bony structures that form the framework of the thoracic cavity and protect the organs within it.",
            "explanation": "Ribs are elongated, curved bones that form a protective cage around the thoracic cavity, serving to protect vital organs such as the heart and lungs.",
            "chineseTranslation": "肋骨",
            "traditionalChineseTranslation": "肋骨",
            "lesson": 3
        },
        {
            "word": "fibula",
            "meaning": "the outer and thinner of the two bones between the knee and the ankle in humans and many other vertebrates",
            "chineseTranslation": "腓骨",
            "traditionalChineseTranslation": "腓骨",
            "explanation": "The fibula is the long, thin bone located on the lateral side of the tibia in the lower leg. It serves as a support for the muscles of the leg and helps stabilize the ankle joint.",
            "prefix": "",
            "root": "fibul-",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "tibialis anterior",
            "prefix": "",
            "root": "tibialis",
            "suffix": "anterior",
            "meaning": "the muscle located in the front of the lower leg that acts to dorsiflex and invert the foot",
            "explanation": "The tibialis anterior muscle is responsible for lifting the foot and is important for walking and running. It helps in dorsiflexion (raising the foot upwards towards the shin) and inversion (turning the sole of the foot inwards).",
            "chineseTranslation": "前胫骨肌",
            "traditionalChineseTranslation": "前脛骨肌",
            "lesson": 3
        },
        {
            "word": "xylocaine",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A local anesthetic used to numb tissue in a specific area.",
            "explanation": "Xylocaine is the brand name for lidocaine, which is used to prevent pain during medical procedures. It works by blocking nerve signals in the body.",
            "chineseTranslation": "氟卡卡因",
            "traditionalChineseTranslation": "氟卡卡因",
            "lesson": 3
        },
        {
            "word": "erythroderma",
            "prefix": "erythro-",
            "root": "derma",
            "suffix": "",
            "meaning": "a condition characterized by redness of the skin,",
            "chineseTranslation": "红皮病",
            "traditionalChineseTranslation": "紅皮病",
            "explanation": "Erythroderma is a condition characterized by widespread redness of the skin, often accompanied by inflammation and itching. It can be caused by various factors, including skin conditions, infections, and certain medications.",
            "lesson": 3
        },
        {
            "word": "cryosurgery",
            "prefix": "cry/o",
            "root": "surg",
            "suffix": "-ery",
            "meaning": "a surgical technique that involves using extreme cold to destroy tissue",
            "explanation": "Cryosurgery is often used to treat various conditions, including some types of cancer, by freezing abnormal tissues, which leads to cell death.",
            "chineseTranslation": "冷冻手术",
            "traditionalChineseTranslation": "冷凍手術",
            "lesson": 3
        },
        {
            "word": "metatarsals",
            "prefix": "meta-",
            "root": "tarsal",
            "suffix": "",
            "meaning": "The five long bones in the foot that connect the ankle bones to the toes.",
            "explanation": "The metatarsals are located in the midfoot region and play a crucial role in the structure and function of the foot, allowing for mobility and weight-bearing.",
            "chineseTranslation": "跖骨",
            "traditionalChineseTranslation": "跖骨",
            "lesson": 3
        },
        {
            "word": "fascia",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a band or sheet of connective tissue that surrounds muscles, organs, and other structures",
            "explanation": "Fascia is important for providing support and stability to the body, and plays a crucial role in the movement and functioning of the musculoskeletal system.",
            "chineseTranslation": "筋膜",
            "traditionalChineseTranslation": "筋膜",
            "lesson": 3
        },
        {
            "word": "fracture",
            "prefix": "",
            "root": "fract",
            "suffix": "",
            "meaning": "a break or crack in a bone",
            "explanation": "A fracture is a medical condition that occurs when there is a break in the continuity of the bone. Fractures can occur due to trauma, stress, or certain medical conditions.",
            "chineseTranslation": "骨折",
            "traditionalChineseTranslation": "骨折",
            "lesson": 3
        },
        {
            "word": "verruca",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a wart, especially one on the foot",
            "explanation": "Verruca refers to a type of wart caused by a viral infection that affects the outer layer of skin, often found on the sole of the foot (plantar wart).",
            "chineseTranslation": "疣",
            "traditionalChineseTranslation": "疣",
            "lesson": 3
        },
        {
            "word": "wheal",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A raised, itchy area of skin that is usually a sign of an allergic reaction or condition.",
            "explanation": "Wheals are often associated with conditions like hives and can appear suddenly as a result of exposure to allergens or irritants. They can vary in size and may be red or skin-colored.",
            "chineseTranslation": "风疹块",
            "traditionalChineseTranslation": "風疹塊",
            "lesson": 3
        },
        {
            "word": "macule",
            "prefix": "",
            "root": "macul-",
            "suffix": "",
            "meaning": "a small discoloration of the skin, usually flat and not raised",
            "explanation": "A macule is a flat, distinct, colored area of skin that is less than 1 centimeter wide. Unlike papules, which are raised, macules are flat and typically represent a change in color, often due to a variety of causes such as vascular changes, inflammatory processes, or pigmentation changes.",
            "chineseTranslation": "斑点",
            "traditionalChineseTranslation": "斑點",
            "lesson": 3
        },
        {
            "word": "miconazole",
            "prefix": "",
            "root": "miconazole",
            "suffix": "",
            "meaning": "a topical antifungal medication used to treat skin infections caused by fungi and yeast.",
            "explanation": "Miconazole is often used to treat conditions such as athlete's foot, ringworm, and yeast infections. It works by stopping the growth of fungi.",
            "chineseTranslation": "咪康唑",
            "traditionalChineseTranslation": "咪康唑",
            "lesson": 3
        },
        {
            "word": "cartilaginous joint",
            "prefix": "",
            "root": "cartilagin-",
            "suffix": "-ous",
            "meaning": "A type of joint in which the bones are connected entirely by cartilage.",
            "explanation": "Cartilaginous joints allow limited movement and provide stability. Examples include the joints between the ribs and the sternum, as well as the intervertebral discs in the spine.",
            "chineseTranslation": "软骨关节",
            "traditionalChineseTranslation": "軟骨關節",
            "lesson": 3
        },
        {
            "word": "lindane",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A colorless, odorless insecticide that is derived from benzene and is used in agriculture and for treating lice and scabies.",
            "explanation": "Lindane is a chlorinated hydrocarbon that was historically used as a pesticide and for medical purposes in treating certain parasitic infections. Its use is now restricted in many countries due to health concerns.",
            "chineseTranslation": "林丹",
            "traditionalChineseTranslation": "林丹",
            "lesson": 3
        },
        {
            "word": "myoplasty",
            "prefix": "myo-",
            "root": "plast",
            "suffix": "-y",
            "meaning": "surgical repair of a muscle",
            "explanation": "Myoplasty refers to a surgical procedure aimed at repairing or reconstructing muscle tissue.",
            "chineseTranslation": "肌肉成形術",
            "traditionalChineseTranslation": "肌肉成形術",
            "lesson": 3
        },
        {
            "word": "scapula",
            "prefix": "",
            "root": "scapul-",
            "suffix": "",
            "meaning": "the shoulder blade",
            "explanation": "The scapula is a flat, triangular bone located on the posterior side of the ribcage, forming the back of the shoulder and providing an attachment point for several muscles.",
            "chineseTranslation": "肩胛骨",
            "traditionalChineseTranslation": "肩胛骨",
            "lesson": 3
        },
        {
            "word": "hydrocortisone",
            "prefix": "hydro-",
            "root": "cortisone",
            "suffix": "",
            "meaning": "A corticosteroid hormone used to treat inflammation and adrenal insufficiency.",
            "explanation": "Hydrocortisone is a synthetic version of cortisol, a hormone produced by the adrenal cortex. It is used in treating conditions that occur due to low cortisol levels and has anti-inflammatory effects.",
            "chineseTranslation": "氢化可的松",
            "traditionalChineseTranslation": "氫化可的松",
            "lesson": 3
        },
        {
            "word": "perspiration",
            "prefix": "per-",
            "root": "spir",
            "suffix": "-ation",
            "meaning": "the process of sweating or the sweat itself",
            "explanation": "Perspiration is a physiological process that helps regulate body temperature by releasing moisture through the skin.",
            "chineseTranslation": "出汗",
            "traditionalChineseTranslation": "出汗",
            "lesson": 3
        },
        {
            "word": "collagen",
            "prefix": "",
            "root": "colla",
            "suffix": "",
            "meaning": "A protein that forms the connective tissues in the body, providing strength and structure.",
            "explanation": "Collagen is the most abundant protein in the body, making up a large portion of our skin, muscles, bones, and connective tissues. It plays a crucial role in maintaining the integrity of these structures.",
            "chineseTranslation": "胶原蛋白",
            "traditionalChineseTranslation": "膠原蛋白",
            "lesson": 3
        },
        {
            "word": "Benadryl",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "an antihistamine used to relieve symptoms of allergy, hay fever, and the common cold",
            "explanation": "Benadryl is a brand name for diphenhydramine, which is an antihistamine that blocks the effects of histamine in the body. It is commonly used to treat allergy symptoms such as runny nose, sneezing, and itching, as well as to alleviate cold symptoms. It may also be used to prevent and treat nausea, vomiting, and dizziness caused by motion sickness.",
            "chineseTranslation": "苯海拉明",
            "traditionalChineseTranslation": "苯海拉明",
            "lesson": 3
        },
        {
            "word": "myocardium",
            "prefix": "myo-",
            "root": "cardi-",
            "suffix": "-um",
            "meaning": "the muscular tissue of the heart",
            "explanation": "The myocardium is the thick middle layer of the heart wall, composed of cardiac muscle tissue responsible for the contraction and pumping of blood.",
            "chineseTranslation": "心肌",
            "traditionalChineseTranslation": "心肌",
            "lesson": 3
        },
        {
            "word": "arteries",
            "prefix": "",
            "root": "arteri",
            "suffix": "es",
            "meaning": "blood vessels that carry blood away from the heart",
            "explanation": "Arteries are a type of blood vessel in the circulatory system that transport oxygenated blood away from the heart to the tissues of the body, except for the pulmonary arteries which carry deoxygenated blood to the lungs.",
            "chineseTranslation": "动脉",
            "traditionalChineseTranslation": "動脈",
            "lesson": 3
        },
        {
            "word": "extensor digitorum",
            "prefix": "ex-",
            "root": "tens",
            "suffix": "-or",
            "meaning": "muscle that extends the fingers",
            "explanation": "The extensor digitorum is a muscle located in the posterior compartment of the forearm that is responsible for extending the digits (fingers) of the hand.",
            "chineseTranslation": "伸展手指肌",
            "traditionalChineseTranslation": "伸展手指肌",
            "lesson": 3
        },
        {
            "word": "fascial",
            "prefix": "",
            "root": "fasc",
            "suffix": "-ial",
            "meaning": "pertaining to fascia",
            "explanation": "Fascial refers to the connective tissue that surrounds muscles, groups of muscles, blood vessels, and nerves, providing support and structure.",
            "chineseTranslation": "筋膜的",
            "traditionalChineseTranslation": "筋膜的",
            "lesson": 3
        },
        {
            "word": "coccyx",
            "prefix": "",
            "root": "coccyg-",
            "suffix": "",
            "meaning": "the small triangular bone at the base of the vertebral column, commonly known as the tailbone",
            "explanation": "The coccyx is a small, bony structure located at the bottom of the vertebral column in humans. It is composed of three to five fused vertebrae and serves as an attachment site for ligaments, tendons, and muscles.",
            "chineseTranslation": "尾骨",
            "traditionalChineseTranslation": "尾骨",
            "lesson": 3
        },
        {
            "word": "vastus medialis",
            "prefix": "",
            "root": "vastus",
            "suffix": "",
            "meaning": "the inner part of the quadriceps muscle located in the thigh",
            "explanation": "Vastus medialis is one of the four muscles that make up the quadriceps group in the thigh. It is located on the medial side (inner side) and is responsible for extending the knee.",
            "chineseTranslation": "内侧阔肌",
            "traditionalChineseTranslation": "內側阔肌",
            "lesson": 3
        },
        {
            "word": "cuticle",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the thin layer of skin that covers the base of a nail",
            "explanation": "The cuticle is a protective layer of skin that forms a barrier between the nail and the surrounding skin, helping to prevent infection and maintain nail health.",
            "chineseTranslation": "指甲皮",
            "traditionalChineseTranslation": "指甲皮",
            "lesson": 3
        },
        {
            "word": "systemic lupus erythematosus",
            "prefix": "systemic",
            "root": "lupus erythematosus",
            "suffix": "",
            "meaning": "A chronic autoimmune disease characterized by inflammation and damage to various body systems.",
            "explanation": "Systemic lupus erythematosus (SLE) is an autoimmune condition in which the body's immune system mistakenly attacks healthy tissue, leading to widespread inflammation affecting various organs including skin, joints, kidneys, and the heart.",
            "chineseTranslation": "红斑狼疮",
            "traditionalChineseTranslation": "紅斑狼瘡",
            "lesson": 3
        },
        {
            "word": "plantarflexion",
            "prefix": "",
            "root": "plantar",
            "suffix": "flexion",
            "meaning": "The action of pointing the toes or decreasing the angle between the foot and the shin.",
            "explanation": "Plantarflexion refers to the movement that occurs at the ankle joint, where the foot is flexed downwards. This motion is essential for walking, running, and jumping as it allows the foot to push off the ground.",
            "chineseTranslation": "跖屈",
            "traditionalChineseTranslation": "跖屈",
            "lesson": 3
        },
        {
            "word": "electromyogram",
            "prefix": "electro-",
            "root": "myo",
            "suffix": "-gram",
            "meaning": "A diagnostic test that records the electrical activity of muscles.",
            "explanation": "Electromyography (EMG) is a technique for evaluating and recording the electrical activity produced by skeletal muscles. An electromyogram is the result of this process, displaying the electrical activity of muscles at rest and during contraction.",
            "chineseTranslation": "肌电图",
            "traditionalChineseTranslation": "肌電圖",
            "lesson": 3
        },
        {
            "word": "trochanter",
            "prefix": "",
            "root": "trochanter",
            "suffix": "",
            "meaning": "A trochanter is a large, bony prominence located on the femur (thigh bone) that serves as an attachment site for muscles.",
            "explanation": "Trochanters are important anatomical landmarks for the attachment of muscles in the hip region, particularly those involved in movements of the leg. There are two main trochanters: the greater trochanter and the lesser trochanter.",
            "chineseTranslation": "转子",
            "traditionalChineseTranslation": "轉子",
            "lesson": 3
        },
        {
            "word": "apocrine glands",
            "prefix": "apo-",
            "root": "crine",
            "suffix": "",
            "meaning": "glands that secrete a fluid containing proteins and lipids, typically associated with hair follicles.",
            "explanation": "Apocrine glands are a type of exocrine gland found in certain areas of the body, such as underarm and areola regions, that contribute to body odor as their secretion is broken down by bacteria on the skin.",
            "chineseTranslation": "顶浆腺",
            "traditionalChineseTranslation": "頂漿腺",
            "lesson": 3
        },
        {
            "word": "soleus",
            "prefix": "",
            "root": "sole",
            "suffix": "",
            "meaning": "A muscle in the calf of the leg that helps in walking and standing.",
            "explanation": "The soleus muscle is located beneath the gastrocnemius and plays a key role in plantar flexion of the foot.",
            "chineseTranslation": "比目鱼肌",
            "traditionalChineseTranslation": "比目魚肌",
            "lesson": 3
        },
        {
            "word": "brachioradialis",
            "prefix": "brachio-",
            "root": "radial",
            "suffix": "-alis",
            "meaning": "A muscle of the forearm that flexes the elbow.",
            "explanation": "The brachioradialis is located in the forearm and helps with the flexion of the elbow joint. It is particularly active when the forearm is in a mid-prone position, such as when you are holding a hammer.",
            "chineseTranslation": "肱桡肌",
            "traditionalChineseTranslation": "肱桡肌",
            "lesson": 3
        },
        {
            "word": "acne",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a skin condition characterized by red pimples, typically on the face, due to inflamed or infected sebaceous glands.",
            "explanation": "Acne occurs when hair follicles become clogged with oil and dead skin cells, leading to inflammation and the formation of pimples or cysts. It is most commonly seen in adolescents but can occur at any age.",
            "chineseTranslation": "痤疮",
            "traditionalChineseTranslation": "痤瘡",
            "lesson": 3
        },
        {
            "word": "serratus anterior",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a muscle located on the side of the chest that helps to move the scapula forward and upward.",
            "explanation": "The serratus anterior is important for the upward movement of the shoulder and is involved in the protraction of the scapula, allowing for arm elevation and movements like pushing or punching.",
            "chineseTranslation": "前锯肌",
            "traditionalChineseTranslation": "前鋸肌",
            "lesson": 3
        },
        {
            "word": "zygomatic bone",
            "prefix": "",
            "root": "zygomatic",
            "suffix": "bone",
            "meaning": "The bone that forms the prominence of the cheek and part of the lateral wall and floor of the orbit.",
            "explanation": "The zygomatic bone, also known as the cheekbone, articulates with several other facial bones and contributes to the shape of the face.",
            "chineseTranslation": "颧骨",
            "traditionalChineseTranslation": "顴骨",
            "lesson": 3
        },
        {
            "word": "fibrous joint",
            "prefix": "",
            "root": "fibrous",
            "suffix": "",
            "meaning": "A type of joint where the bones are connected by dense connective tissue, allowing for little to no movement.",
            "explanation": "Fibrous joints are connected by fibrous tissue and are typically immovable. Examples include sutures in the skull and the syndesmosis between the tibia and fibula.",
            "chineseTranslation": "纤维关节",
            "traditionalChineseTranslation": "纖維關節",
            "lesson": 3
        },
        {
            "word": "photosensitivity",
            "prefix": "photo-",
            "root": "sensitivity",
            "suffix": "",
            "meaning": "Increased sensitivity of the skin to sunlight.",
            "explanation": "Photosensitivity is a condition where the skin reacts excessively to sunlight, which can result in rashes, redness, or other skin reactions.",
            "chineseTranslation": "光敏感性",
            "traditionalChineseTranslation": "光敏感性",
            "lesson": 3
        },
        {
            "word": "purpura",
            "prefix": "",
            "root": "purpura",
            "suffix": "",
            "meaning": "a condition characterized by purple or red spots on the skin caused by bleeding underneath the skin",
            "explanation": "Purpura is a medical term that refers to the appearance of purple or red discolorations on the skin or mucous membranes that do not blanch on applying pressure. This is typically due to bleeding under the skin and can indicate various medical conditions or injuries.",
            "chineseTranslation": "紫癜",
            "traditionalChineseTranslation": "紫癜",
            "lesson": 3
        },
        {
            "word": "antipruritics",
            "meaning": "medications used to relieve or prevent itching.",
            "chineseTranslation": "抗瘙痒药",
            "traditionalChineseTranslation": "抗瘙癢藥",
            "explanation": "Antipruritics are used to alleviate itching associated with various conditions, such as eczema, allergies, or insect bites.",
            "prefix": "anti-",
            "root": "prurit",
            "suffix": "-ics",
            "lesson": 3
        },
        {
            "word": "sphenoid bone",
            "prefix": "",
            "root": "sphenoid",
            "suffix": "bone",
            "meaning": "a bone located at the base of the skull that helps form the eye socket and the nasal cavity.",
            "explanation": "The sphenoid bone is a complex bone situated at the central part of the skull base. It is shaped like a butterfly or a bat and articulates with several other skull bones, making it crucial for the structure of the skull. It contains the sphenoidal sinuses and contributes to the formation of the orbit and nasal cavity.",
            "chineseTranslation": "蝶骨",
            "traditionalChineseTranslation": "蝶骨",
            "lesson": 3
        },
        {
            "word": "debridement",
            "prefix": "de-",
            "root": "bridement",
            "suffix": "",
            "meaning": "the removal of dead, damaged, or infected tissue to improve the healing potential of the remaining healthy tissue",
            "explanation": "Debridement is a surgical procedure or a method used in wound care to clean chronic wounds by removing foreign material, dead tissue, and bacteria. This process promotes better healing and prevents infection.",
            "chineseTranslation": "去除坏死组织",
            "traditionalChineseTranslation": "去除壞死組織",
            "lesson": 3
        },
        {
            "word": "ischium",
            "prefix": "",
            "root": "ischi-",
            "suffix": "",
            "meaning": "the curved bone forming the base of each half of the pelvis",
            "explanation": "The ischium is one of the three primary bones that make up the pelvis, located at the lower and back part. It plays a crucial role in supporting the weight of the body when sitting and serves as an attachment point for various muscles and ligaments.",
            "chineseTranslation": "坐骨",
            "traditionalChineseTranslation": "坐骨",
            "lesson": 3
        },
        {
            "word": "psoriasis",
            "prefix": "",
            "root": "psor",
            "suffix": "iasis",
            "meaning": "a chronic skin condition characterized by red, itchy, scaly patches",
            "explanation": "Psoriasis is an autoimmune disease that causes the rapid growth of skin cells, leading to thick, silvery scales and dry, red patches that can be itchy and sometimes painful. It is often cyclical, with periods of flare-ups followed by remission.",
            "chineseTranslation": "银屑病",
            "traditionalChineseTranslation": "銀屑病",
            "lesson": 3
        },
        {
            "word": "pediculosis",
            "prefix": "pedicul-",
            "root": "",
            "suffix": "-osis",
            "meaning": "infestation with lice",
            "explanation": "Pediculosis is a condition characterized by the presence of lice on the body or scalp, which can cause itching and discomfort. It commonly affects the scalp (head lice), body (body lice), or the pubic area (pubic lice), leading to various symptoms dependent on the type of lice infesting the individual.",
            "chineseTranslation": "虱子病",
            "traditionalChineseTranslation": "蝨子病",
            "lesson": 3
        },
        {
            "word": "gastrocnemius",
            "prefix": "gastro-",
            "root": "cnemius",
            "suffix": "",
            "meaning": "the largest muscle in the calf of the leg",
            "explanation": "The gastrocnemius muscle is a powerful muscle that is located in the back part of the lower leg and is responsible for the movement of the foot and knee. It helps in walking, running, and jumping.",
            "chineseTranslation": "腓肠肌",
            "traditionalChineseTranslation": "腓腸肌",
            "lesson": 3
        },
        {
            "word": "permethrin",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A synthetic chemical used as an insect repellent and acaricide.",
            "explanation": "Permethrin is commonly used to repel insects and treat conditions such as scabies and lice. It works by affecting the nervous system of insects and other pests, leading to paralysis and death.",
            "chineseTranslation": "培曼噻棉",
            "traditionalChineseTranslation": "培曼噻棉",
            "lesson": 3
        },
        {
            "word": "ichthyoderma",
            "prefix": "ichthyo-",
            "root": "derma",
            "suffix": "",
            "meaning": "a skin condition characterized by fish-like scales",
            "explanation": "Ichthyoderma is a type of skin disorder where the skin appears scaly, similar to that of a fish. This condition can be congenital or acquired and often results in dry, flaky skin that may be itchy or uncomfortable.",
            "chineseTranslation": "鱼鳞病",
            "traditionalChineseTranslation": "魚鱗病",
            "lesson": 3
        },
        {
            "word": "sebaceous gland",
            "prefix": "",
            "root": "sebaceous",
            "suffix": "gland",
            "meaning": "a small gland in the skin that secretes an oily substance (sebum) to lubricate and protect skin and hair",
            "explanation": "Sebaceous glands are associated with hair follicles and play a vital role in maintaining skin and hair health by producing sebum, which helps to keep the skin moisturized and acts as a barrier against bacteria.",
            "chineseTranslation": "皮脂腺",
            "traditionalChineseTranslation": "皮脂腺",
            "lesson": 3
        },
        {
            "word": "cancellous bone",
            "prefix": "",
            "root": "cancellous",
            "suffix": "bone",
            "meaning": "a type of bone that is porous and spongy, found mostly at the ends of long bones and in the interior of others, allowing for lighter weight and the ability to house bone marrow.",
            "explanation": "Cancellous bone, also known as trabecular or spongy bone, consists of a network of trabecular rods or plates that provide structural support and flexibility while reducing bone weight. It plays a significant role in bone metabolism and helps to produce blood cells in the bone marrow.",
            "chineseTranslation": "海绵骨",
            "traditionalChineseTranslation": "海綿骨",
            "lesson": 3
        },
        {
            "word": "decubitus ulcer",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a sore that develops on the skin due to prolonged pressure, commonly known as a pressure sore or bed sore.",
            "explanation": "Decubitus ulcers occur when blood flow to an area of skin is restricted, usually due to immobility, which leads to tissue damage and can become infected if not treated properly.",
            "chineseTranslation": "褥疮",
            "traditionalChineseTranslation": "褥瘡",
            "lesson": 3
        },
        {
            "word": "neomycin",
            "prefix": "",
            "root": "neo",
            "suffix": "",
            "meaning": "An antibiotic used to treat bacterial infections.",
            "explanation": "Neomycin is part of the aminoglycoside class of antibiotics, commonly used topically or orally. It works by inhibiting bacterial protein synthesis.",
            "chineseTranslation": "新霉素",
            "traditionalChineseTranslation": "新霉素",
            "lesson": 3
        },
        {
            "word": "famvir",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "an antiviral medication used to treat infections caused by certain types of viruses, such as herpes viruses",
            "explanation": "Famvir is primarily used to treat herpes infections, including genital herpes and shingles. It works by inhibiting the replication of the virus, thereby helping to reduce symptoms and shorten the duration of the outbreak.",
            "chineseTranslation": "泛昔洛韦",
            "traditionalChineseTranslation": "泛昔洛韋",
            "lesson": 3
        },
        {
            "word": "external oblique",
            "prefix": "",
            "root": "oblique",
            "suffix": "",
            "meaning": "a muscle located on the side of the abdomen that helps with trunk rotation and lateral flexion",
            "explanation": "The external oblique muscle is one of the major muscles of the abdominal wall. It is located on the outer side of the abdomen, and its fibers run diagonally. This muscle is involved in various movements such as bending and twisting the torso.",
            "chineseTranslation": "外斜肌",
            "traditionalChineseTranslation": "外斜肌",
            "lesson": 3
        },
        {
            "word": "keratosis",
            "prefix": "kerato-",
            "root": "-osis",
            "suffix": "",
            "meaning": "a condition characterized by the thickening of the outer layer of the skin",
            "explanation": "Keratosis is a term used to describe various skin conditions that result in a thickening or abnormal growth of keratin on the skin's surface. This thickening can arise from various causes, such as sun exposure, irritation, or other factors.",
            "chineseTranslation": "角化症",
            "traditionalChineseTranslation": "角化症",
            "lesson": 3
        },
        {
            "word": "pustule",
            "prefix": "",
            "root": "pustul-",
            "suffix": "-ule",
            "meaning": "a small, inflamed, pus-filled blister on the skin",
            "explanation": "Pustules are often associated with infections, such as acne or other inflammatory skin conditions, where the accumulation of pus occurs in the epidermis or dermis.",
            "chineseTranslation": "脓疱",
            "traditionalChineseTranslation": "膿疱",
            "lesson": 3
        },
        {
            "word": "acne rosacea",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A chronic skin condition characterized by facial redness, swelling, and acne-like breakouts, typically affecting the central part of the face.",
            "explanation": "Acne rosacea is often confused with regular acne, but it is a distinct condition that primarily affects adults and can cause flushing, visible blood vessels, and thickening of the skin in more severe cases.",
            "chineseTranslation": "痤疮性红斑",
            "traditionalChineseTranslation": "痤瘡性紅斑",
            "lesson": 3
        },
        {
            "word": "squamous cell carcinoma",
            "prefix": "",
            "root": "squamous",
            "suffix": "carcinoma",
            "meaning": "一种起源于鳞状细胞的癌症",
            "explanation": "Squamous cell carcinoma (SCC) is a type of skin cancer that originates in squamous cells, which are flat cells found in the outer layer of the skin and also in the lining of certain organs.",
            "chineseTranslation": "鳞状细胞癌",
            "traditionalChineseTranslation": "鱗狀細胞癌",
            "lesson": 3
        },
        {
            "word": "sweat duct",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small tube in the skin that carries sweat from a sweat gland to the surface of the skin",
            "explanation": "Sweat ducts are responsible for transporting sweat, which helps regulate body temperature and remove waste. They connect sweat glands to the skin's surface, allowing sweat to exit the body during perspiration.",
            "chineseTranslation": "汗腺导管",
            "traditionalChineseTranslation": "汗腺導管",
            "lesson": 3
        },
        {
            "word": "hyperpigmentation",
            "prefix": "hyper-",
            "root": "pigment",
            "suffix": "-ation",
            "meaning": "excessive pigmentation of the skin",
            "explanation": "Hyperpigmentation refers to the darkening of an area of skin or nails caused by increased melanin, which is the pigment that gives skin its color. It can occur in various forms, such as age spots, melasma, or post-inflammatory hyperpigmentation.",
            "chineseTranslation": "色素沉着",
            "traditionalChineseTranslation": "色素沉著",
            "lesson": 3
        },
        {
            "word": "palmaris longus",
            "prefix": "",
            "root": "palmaris (from 'palm') + longus ('long')",
            "suffix": "",
            "meaning": "a long muscle of the forearm that is involved in flexing the wrist and tensing the palmar fascia.",
            "explanation": "The palmaris longus muscle is located in the forearm and contributes to the flexion of the wrist. It is absent in some individuals and serves as a tendon that helps to tighten the skin of the palm.",
            "chineseTranslation": "掌长肌",
            "traditionalChineseTranslation": "掌長肌",
            "lesson": 3
        },
        {
            "word": "striated muscle",
            "prefix": "",
            "root": "striated",
            "suffix": "muscle",
            "meaning": "a type of muscle tissue that has a striped appearance under a microscope and is involved in voluntary movements.",
            "explanation": "Striated muscles, also known as skeletal muscles, are muscles that are attached to bones and aid in the movement of the skeleton. They are characterized by their striated, or striped, appearance due to the arrangement of muscle fibers.",
            "chineseTranslation": "条纹肌肉",
            "traditionalChineseTranslation": "條紋肌肉",
            "lesson": 3
        },
        {
            "word": "cortical bone",
            "prefix": "",
            "root": "cortic-",
            "suffix": "-al",
            "meaning": "the dense, outer surface of bone that forms a protective layer around the internal cavity",
            "explanation": "Cortical bone, also known as compact bone, is dense and forms the outer layer of bones, providing strength and protection. It contrasts with trabecular bone, which is lighter and found inside the bone structure.",
            "chineseTranslation": "皮质骨",
            "traditionalChineseTranslation": "皮質骨",
            "lesson": 3
        },
        {
            "word": "tendon",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a fibrous connective tissue that attaches muscle to bone",
            "explanation": "Tendons are strong, flexible bands of connective tissue that connect muscles to the bones they move. They play a crucial role in movement by transmitting the force generated by muscles to the bones, facilitating joint motion.",
            "chineseTranslation": "肌腱",
            "traditionalChineseTranslation": "肌腱",
            "lesson": 3
        },
        {
            "word": "biceps brachii",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the large muscle at the front of the upper arm that helps with bending the elbow and lifting the forearm",
            "explanation": "Biceps brachii is a two-headed muscle located in the upper arm. It is responsible for flexion of the elbow and rotation of the forearm. The term 'biceps' refers to the two heads of the muscle, and 'brachii' refers to its location in the arm.",
            "chineseTranslation": "肱二頭肌",
            "traditionalChineseTranslation": "肱二頭肌",
            "lesson": 3
        },
        {
            "word": "extensor digitorum brevis",
            "prefix": "ex-",
            "root": "tensor; digit; brevis",
            "suffix": "",
            "meaning": "short muscle that extends the toes",
            "explanation": "The extensor digitorum brevis is a muscle located in the foot that helps extend the toes. It is part of the group of muscles that facilitate movement and provide stability.",
            "chineseTranslation": "短趾伸肌",
            "traditionalChineseTranslation": "短趾伸肌",
            "lesson": 3
        },
        {
            "word": "nodule",
            "prefix": "",
            "root": "nod",
            "suffix": "-ule",
            "meaning": "a small swollen mass or lump, especially one that is solid and raised above the surface of the skin or in organs",
            "explanation": "In medicine, a nodule typically refers to a small round or oval-shaped abnormal growth or mass, often found in the skin, lungs, or other organs.",
            "chineseTranslation": "小结",
            "traditionalChineseTranslation": "小結",
            "lesson": 3
        },
        {
            "word": "kinesiology",
            "prefix": "kinesi-",
            "root": "kinesis",
            "suffix": "-ology",
            "meaning": "the study of human movement",
            "explanation": "Kinesiology is a field that combines aspects of anatomy, physiology, biomechanics, and other disciplines to study how bodily movements and physical activity affect health and performance.",
            "chineseTranslation": "运动学",
            "traditionalChineseTranslation": "運動學",
            "lesson": 3
        },
        {
            "word": "flexor digitorum superficialis",
            "prefix": "",
            "root": "flexor, digit, superfacialis",
            "suffix": "",
            "meaning": "a muscle in the forearm that flexes the fingers",
            "explanation": "The flexor digitorum superficialis is a muscle located in the forearm that is responsible for flexing the middle phalanges of the fingers. It plays an essential role in gripping and various hand movements.",
            "chineseTranslation": "浅指屈肌",
            "traditionalChineseTranslation": "淺指屈肌",
            "lesson": 3
        },
        {
            "word": "fissure",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A narrow opening or crack in a structure, often referring to a split or break in biological tissue.",
            "explanation": "In medical terms, a fissure often describes a crack or split in the skin or mucous membrane, which can occur in various parts of the body such as the anus or lips.",
            "chineseTranslation": "裂缝",
            "traditionalChineseTranslation": "裂縫",
            "lesson": 3
        },
        {
            "word": "osteoblasts",
            "prefix": "osteo-",
            "root": "blast",
            "suffix": "s",
            "meaning": "Bone-forming cells",
            "explanation": "Osteoblasts are specialized cells that synthesize bone by secreting the bone matrix and are involved in the mineralization process of bone tissue. They play a critical role in bone growth, repair, and remodeling.",
            "chineseTranslation": "成骨细胞",
            "traditionalChineseTranslation": "成骨細胞",
            "lesson": 3
        },
        {
            "word": "occipital bone",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the bone located at the back and base of the skull",
            "explanation": "The occipital bone is one of the cranial bones that makes up the posterior part of the skull and contains the foramen magnum, through which the spinal cord connects to the brain.",
            "chineseTranslation": "枕骨",
            "traditionalChineseTranslation": "枕骨",
            "lesson": 3
        },
        {
            "word": "Kenalog",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A brand name for a corticosteroid medication used to treat inflammation and allergic reactions.",
            "explanation": "Kenalog contains triamcinolone acetonide, which helps to reduce inflammation and suppress the immune response in conditions such as allergies, skin diseases, and arthritis.",
            "chineseTranslation": "曲安奈德",
            "traditionalChineseTranslation": "曲安奈德",
            "lesson": 3
        },
        {
            "word": "biceps femoris",
            "prefix": "",
            "root": "biceps, femoris",
            "suffix": "",
            "meaning": "a muscle of the back of the thigh that is part of the hamstrings group",
            "explanation": "The biceps femoris is one of the three muscles that make up the hamstrings located at the back of the thigh. It is involved in knee flexion and hip extension.",
            "chineseTranslation": "股二头肌",
            "traditionalChineseTranslation": "股二頭肌",
            "lesson": 3
        },
        {
            "word": "arthroscopy",
            "prefix": "arthro-",
            "root": "scopy",
            "suffix": "",
            "meaning": "A minimally invasive surgical procedure used to visualize, diagnose, and treat conditions affecting the joints.",
            "explanation": "Arthroscopy involves the insertion of a thin viewing instrument called an arthroscope into the joint through small incisions. It allows the surgeon to see inside the joint and perform necessary procedures without making large incisions.",
            "chineseTranslation": "关节镜检查",
            "traditionalChineseTranslation": "關節鏡檢查",
            "lesson": 3
        },
        {
            "word": "rectus abdominis",
            "prefix": "",
            "root": "rectus (straight), abdominis (of the abdomen)",
            "suffix": "",
            "meaning": "a long muscle located in the front of the abdomen",
            "explanation": "The rectus abdominis is one of the major muscles of the core, commonly referred to as the 'abs'. It runs vertically along the length of the abdomen and is primarily responsible for flexing the spine and stabilizing the pelvis.",
            "chineseTranslation": "腹直肌",
            "traditionalChineseTranslation": "腹直肌",
            "lesson": 3
        },
        {
            "word": "malignant melanoma",
            "prefix": "malignant",
            "root": "melanoma",
            "suffix": "",
            "meaning": "a type of skin cancer that originates from melanocytes, the cells that produce the pigment melanin",
            "explanation": "Malignant melanoma is the most serious type of skin cancer, characterized by the uncontrolled growth of pigment-producing cells. It can spread to other parts of the body if not detected early.",
            "chineseTranslation": "恶性黑色素瘤",
            "traditionalChineseTranslation": "惡性黑色素瘤",
            "lesson": 3
        },
        {
            "word": "urea",
            "prefix": "",
            "root": "ure",
            "suffix": "a",
            "meaning": "a waste product formed in the liver and excreted in urine.",
            "explanation": "Urea is a compound that results from the breakdown of proteins in the body. It is produced in the liver and then transported to the kidneys, where it is filtered out of the blood and excreted in urine. Urea is an important component of the body's nitrogen removal processes.",
            "chineseTranslation": "尿素",
            "traditionalChineseTranslation": "尿素",
            "lesson": 3
        },
        {
            "word": "skull",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the bony structure that forms the head and encases the brain",
            "explanation": "The skull consists of various bones that protect the brain and support the structures of the face.",
            "chineseTranslation": "头骨",
            "traditionalChineseTranslation": "頭骨",
            "lesson": 3
        },
        {
            "word": "contusion",
            "prefix": "",
            "root": "contus",
            "suffix": "-ion",
            "meaning": "a bruise; an injury to the tissue with the skin still intact",
            "explanation": "A contusion occurs when small blood vessels are damaged, leading to bleeding under the skin, resulting in a discoloration or bruise without breaking the skin's surface.",
            "chineseTranslation": "挫伤",
            "traditionalChineseTranslation": "挫傷",
            "lesson": 3
        },
        {
            "word": "tinea",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a fungal infection of the skin",
            "explanation": "Tinea refers to a group of skin diseases caused by fungi, commonly known as ringworm, which can affect various body parts, including the scalp, feet, and body. It typically presents as itchy, red, ring-shaped patches.",
            "chineseTranslation": "癣",
            "traditionalChineseTranslation": "癬",
            "lesson": 3
        },
        {
            "word": "trichomycosis",
            "meaning": "A fungal infection of the hair.",
            "chineseTranslation": "毛发真菌病",
            "traditionalChineseTranslation": "毛髮真菌病",
            "explanation": "Trichomycosis is characterized by fungal colonization of the hair shafts, which can lead to discoloration and abnormal growth.",
            "prefix": "tricho-",
            "root": "mycosis",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "hyperhidrosis",
            "prefix": "hyper-",
            "root": "hidros",
            "suffix": "-osis",
            "meaning": "excessive sweating",
            "explanation": "Hyperhidrosis is a condition characterized by abnormally increased sweating, more than what is necessary for thermoregulation.",
            "chineseTranslation": "多汗症",
            "traditionalChineseTranslation": "多汗症",
            "lesson": 3
        },
        {
            "word": "leukoderma",
            "prefix": "leuko-",
            "root": "derma",
            "suffix": "",
            "meaning": "a condition characterized by white patches on the skin due to a loss of pigment",
            "explanation": "Leukoderma is often associated with various skin disorders and can occur as a result of factors such as vitiligo, albinism, or post-inflammatory changes.",
            "chineseTranslation": "白皮病",
            "traditionalChineseTranslation": "白皮病",
            "lesson": 3
        },
        {
            "word": "recticular layer",
            "prefix": "",
            "root": "reticul",
            "suffix": "ar",
            "meaning": "a layer of tissue that is network-like in structure",
            "explanation": "The reticular layer is the deeper layer of the dermis in the skin, consisting of dense irregular connective tissue that provides strength and elasticity.",
            "chineseTranslation": "网状层",
            "traditionalChineseTranslation": "網狀層",
            "lesson": 3
        },
        {
            "word": "antagonist",
            "prefix": "anti-",
            "root": "agon",
            "suffix": "-ist",
            "meaning": "a substance that opposes the action of another",
            "explanation": "In pharmacology, an antagonist refers to a drug or compound that inhibits the action of a receptor or blocks the effects of another substance, such as a neurotransmitter.",
            "chineseTranslation": "拮抗劑",
            "traditionalChineseTranslation": "拮抗劑",
            "lesson": 3
        },
        {
            "word": "melanoma",
            "prefix": "",
            "root": "melan",
            "suffix": "-oma",
            "meaning": "A type of skin cancer that develops from melanocytes, the cells that produce the pigment melanin.",
            "explanation": "Melanoma is known for being more aggressive than other types of skin cancer. It can spread to other parts of the body if not caught early.",
            "chineseTranslation": "黑色素瘤",
            "traditionalChineseTranslation": "黑色素瘤",
            "lesson": 3
        },
        {
            "word": "seborrhea",
            "prefix": "sebo-",
            "root": "rrhea",
            "suffix": "",
            "meaning": "excessive secretion of oil from the sebaceous glands",
            "explanation": "Seborrhea is a skin condition characterized by the overproduction of sebum (oil) by sebaceous glands, leading to greasy skin or scaling, often affecting the scalp, face, and sometimes the upper body.",
            "chineseTranslation": "脂溢性皮炎",
            "traditionalChineseTranslation": "脂溢性皮炎",
            "lesson": 3
        },
        {
            "word": "tenodesis",
            "prefix": "",
            "root": "teno",
            "suffix": "-desis",
            "meaning": "surgical fixation of a tendon to a bone",
            "explanation": "Tenodesis is a surgical procedure that involves fixing a tendon to a bone in order to stabilize a joint or restore function.",
            "chineseTranslation": "腱固定术",
            "traditionalChineseTranslation": "腱固定術",
            "lesson": 3
        },
        {
            "word": "clavicle",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a bone in the human body that connects the arm to the trunk",
            "explanation": "The clavicle, or collarbone, is the bone that serves as a strut between the shoulder blade and the sternum which supports the arm and stabilizes the shoulder.",
            "chineseTranslation": "锁骨",
            "traditionalChineseTranslation": "鎖骨",
            "lesson": 3
        },
        {
            "word": "adductor longus",
            "prefix": "ad-",
            "root": "duct",
            "suffix": "-or",
            "meaning": "a muscle in the thigh that is responsible for adduction and flexion of the hip.",
            "explanation": "The adductor longus is one of the muscles in the inner thigh that helps to bring the leg closer to the body and assists in flexing the hip joint.",
            "chineseTranslation": "长收肌",
            "traditionalChineseTranslation": "長收肌",
            "lesson": 3
        },
        {
            "word": "bacitracin",
            "prefix": "",
            "root": "bacitracin",
            "suffix": "",
            "meaning": "An antibiotic used to treat bacterial infections, particularly those caused by Gram-positive bacteria.",
            "explanation": "Bacitracin works by inhibiting bacterial cell wall synthesis, which ultimately leads to cell lysis and death of the bacteria.",
            "chineseTranslation": "百克霉素",
            "traditionalChineseTranslation": "百克霉素",
            "lesson": 3
        },
        {
            "word": "myopathy",
            "prefix": "myo-",
            "root": "path",
            "suffix": "-y",
            "meaning": "muscle disease",
            "explanation": "Myopathy refers to a disease of the muscle tissue, which can affect muscle function and strength.",
            "chineseTranslation": "肌病",
            "traditionalChineseTranslation": "肌病",
            "lesson": 3
        },
        {
            "word": "vastus lateralis",
            "prefix": "",
            "root": "vastus (Latin for 'large')",
            "suffix": "lateralis (Latin for 'side')",
            "meaning": "the large muscle located on the outer part of the thigh",
            "explanation": "Vastus lateralis is one of the four muscles of the quadriceps, located on the outer side of the thigh, responsible for extending the knee.",
            "chineseTranslation": "外侧阔肌",
            "traditionalChineseTranslation": "外側闊肌",
            "lesson": 3
        },
        {
            "word": "onychophagia",
            "prefix": "onycho-",
            "root": "phagia",
            "suffix": "",
            "meaning": "nail biting",
            "explanation": "Onychophagia is the compulsive habit of biting one's nails, often a form of stress relief or anxiety management.",
            "chineseTranslation": "咬指甲",
            "traditionalChineseTranslation": "咬指甲",
            "lesson": 3
        },
        {
            "word": "lacrimal bone",
            "meaning": "The small, thin bone located in the medial (inner) wall of the eye socket, which helps to form the structure of the eye and contains the lacrimal fossa for the lacrimal sac.",
            "chineseTranslation": "泪骨",
            "traditionalChineseTranslation": "淚骨",
            "explanation": "The lacrimal bone is one of the bones of the orbit and is involved in the drainage of tears from the eye into the nasal cavity.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "papillary layer",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The uppermost layer of the dermis of the skin that contains finger-like projections called dermal papillae.",
            "explanation": "The papillary layer is responsible for providing nutrients to the epidermis and contains a rich supply of blood vessels and sensory receptors.",
            "chineseTranslation": "乳头层",
            "traditionalChineseTranslation": "乳頭層",
            "lesson": 3
        },
        {
            "word": "extensor carpi ulnaris",
            "prefix": "extensor",
            "root": "carpi, ulnaris",
            "suffix": "",
            "meaning": "a muscle responsible for the extension of the wrist, located on the ulnar side (the side of the little finger)",
            "explanation": "The extensor carpi ulnaris is a muscle in the forearm that extends and adducts the wrist. It plays a key role in hand movements, especially those involving the little finger side.",
            "chineseTranslation": "尺侧伸腕肌",
            "traditionalChineseTranslation": "尺側伸腕肌",
            "lesson": 3
        },
        {
            "word": "insulation",
            "prefix": "in-",
            "root": "sulate",
            "suffix": "-ion",
            "meaning": "The act of insulating or the state of being insulated; a material used to insulate.",
            "explanation": "Insulation refers to the material or process used to prevent the transfer of heat, sound, or electricity. In medical terms, it often relates to the insulation of nerve fibers in the body which enhances the speed and efficiency of electrical signals.",
            "chineseTranslation": "绝缘",
            "traditionalChineseTranslation": "絕緣",
            "lesson": 3
        },
        {
            "word": "novocain",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a local anesthetic used to block pain during surgery or dental procedures",
            "explanation": "Novocain, also known as procaine, is a medication that is commonly used to induce a localized loss of sensation in a specific area of the body, typically during dental or surgical procedures.",
            "chineseTranslation": "地卡因",
            "traditionalChineseTranslation": "地卡因",
            "lesson": 3
        },
        {
            "word": "vitiligo",
            "prefix": "",
            "root": "vitil",
            "suffix": "-igo",
            "meaning": "a skin condition characterized by patches of skin losing their pigment",
            "explanation": "Vitiligo is an autoimmune disorder that causes the skin to lose melanin, resulting in light or white patches on the skin.",
            "chineseTranslation": "白癜风",
            "traditionalChineseTranslation": "白癜風",
            "lesson": 3
        },
        {
            "word": "subcutaneous",
            "prefix": "sub-",
            "root": "cutane",
            "suffix": "-ous",
            "meaning": "relating to or situated beneath the skin",
            "explanation": "The term refers to the layer of tissue that lies immediately beneath the skin, which is important in various medical procedures and conditions.",
            "chineseTranslation": "皮下的",
            "traditionalChineseTranslation": "皮下的",
            "lesson": 3
        },
        {
            "word": "adipocyte",
            "meaning": "A fat cell that stores energy in the form of fat.",
            "chineseTranslation": "脂肪细胞",
            "traditionalChineseTranslation": "脂肪細胞",
            "explanation": "Adipocytes are specialized cells responsible for storing energy as fat and releasing it when needed. They play a crucial role in energy balance and homeostasis.",
            "prefix": "adipo-",
            "root": "cyte",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "caladryl",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A topical medication used for relief of itching and minor skin irritations.",
            "explanation": "Caladryl typically contains calamine and is applied to the skin to soothe itching and discomfort from insect bites, poison ivy, and other skin irritations.",
            "chineseTranslation": "炉甘石洗剂",
            "traditionalChineseTranslation": "炉甘石洗劑",
            "lesson": 3
        },
        {
            "word": "leiomyosarcoma",
            "prefix": "leio-",
            "root": "myo",
            "suffix": "sarcoma",
            "meaning": "a malignant tumor of smooth muscle",
            "explanation": "Leiomyosarcoma is a type of cancer that arises from smooth muscle cells, commonly found in the uterus, gastrointestinal tract, and blood vessels.",
            "chineseTranslation": "平滑肌肉瘤",
            "traditionalChineseTranslation": "平滑肌肉瘤",
            "lesson": 3
        },
        {
            "word": "radiograph",
            "prefix": "",
            "root": "radio",
            "suffix": "graph",
            "meaning": "a visual image produced on a sensitive surface by radiation, such as X-rays, used for medical imaging.",
            "explanation": "Radiographs are primarily used to diagnose and monitor various medical conditions by creating images of the internal structures of the body, especially bones and certain organs.",
            "chineseTranslation": "放射线摄影",
            "traditionalChineseTranslation": "放射線攝影",
            "lesson": 3
        },
        {
            "word": "sebaceous cyst",
            "prefix": "",
            "root": "sebaceous",
            "suffix": "cyst",
            "meaning": "a closed sac beneath the skin filled with oil and other debris",
            "explanation": "Sebaceous cysts are common, noncancerous cysts filled with sebaceous fluid, usually resulting from blocked sebaceous glands or hair follicles.",
            "chineseTranslation": "皮脂囊肿",
            "traditionalChineseTranslation": "皮脂囊腫",
            "lesson": 3
        },
        {
            "word": "impetigo",
            "prefix": "",
            "root": "petigō",
            "suffix": "",
            "meaning": "a highly contagious skin infection that causes red sores, primarily in young children.",
            "explanation": "Impetigo is characterized by red sores that can break open, ooze fluid, and develop a yellowish-brown crust. It is caused by bacterial infection, typically by staphylococcus aureus or streptococcus pyogenes.",
            "chineseTranslation": "脓疱病",
            "traditionalChineseTranslation": "膿皰病",
            "lesson": 3
        },
        {
            "word": "supination",
            "prefix": "sup-",
            "root": "nation",
            "suffix": "",
            "meaning": "the act of rotating the arm or foot so that the palm or sole is facing upward",
            "explanation": "Supination is a movement that occurs primarily in the forearm and foot. In the forearm, it turns the palm up, and in the foot, it raises the arch and rotates the ankle inward.",
            "chineseTranslation": "向上旋转",
            "traditionalChineseTranslation": "向上旋轉",
            "lesson": 3
        },
        {
            "word": "hyperemia",
            "prefix": "hyper-",
            "root": "emia",
            "suffix": "",
            "meaning": "an increase in blood flow to a particular area of the body",
            "explanation": "Hyperemia is a condition characterized by an excess of blood in the vessels supplying an organ or body part, often resulting in redness and warmth in that area.",
            "chineseTranslation": "充血",
            "traditionalChineseTranslation": "充血",
            "lesson": 3
        },
        {
            "word": "medullary cavity",
            "prefix": "",
            "root": "medullary (medulla)",
            "suffix": "cavity",
            "meaning": "the central cavity of a long bone where bone marrow is stored",
            "explanation": "The medullary cavity is found within long bones, such as the femur and humerus. It is surrounded by the dense bone and is essential for storing bone marrow, which produces blood cells.",
            "chineseTranslation": "髓腔",
            "traditionalChineseTranslation": "髓腔",
            "lesson": 3
        },
        {
            "word": "cyst",
            "prefix": "",
            "root": "cyst",
            "suffix": "",
            "meaning": "a sac-like pocket of tissue that contains fluid, air, or other substances",
            "explanation": "Cysts can form in various tissues and can be benign or harmful, depending on their nature and location in the body.",
            "chineseTranslation": "囊肿",
            "traditionalChineseTranslation": "囊腫",
            "lesson": 3
        },
        {
            "word": "isopropyl alcohol",
            "prefix": "iso-",
            "root": "propyl alcohol",
            "suffix": "",
            "meaning": "A colorless, flammable chemical compound with the molecular formula C3H8O, used as an antiseptic and solvent.",
            "explanation": "Isopropyl alcohol is commonly used as a rubbing alcohol and disinfectant. It can also be used as a solvent in pharmaceutical and cosmetic products.",
            "chineseTranslation": "异丙醇",
            "traditionalChineseTranslation": "異丙醇",
            "lesson": 3
        },
        {
            "word": "diaphysis",
            "prefix": "dia-",
            "root": "physis",
            "suffix": "",
            "meaning": "the shaft or middle part of a long bone",
            "explanation": "The diaphysis is the elongated shaft of a long bone, primarily composed of compact bone and surrounding the medullary cavity, which contains bone marrow.",
            "chineseTranslation": "骨干",
            "traditionalChineseTranslation": "骨幹",
            "lesson": 3
        },
        {
            "word": "tendotomy",
            "prefix": "tend-",
            "root": "otomy",
            "suffix": "",
            "meaning": "surgical incision of a tendon",
            "explanation": "Tendotomy is a surgical procedure where an incision is made in a tendon to release tension or to correct deformities.",
            "chineseTranslation": "肌腱切开术",
            "traditionalChineseTranslation": "肌腱切開術",
            "lesson": 3
        },
        {
            "word": "condyle",
            "meaning": "a round prominence at the end of a bone, usually part of a joint",
            "chineseTranslation": "髁",
            "traditionalChineseTranslation": "髁",
            "explanation": "The condyle is an important anatomical structure that articulates with another bone, forming a joint. It plays a critical role in allowing movement and stability in the skeletal system.",
            "prefix": "",
            "root": "condyl-",
            "suffix": "-e",
            "lesson": 3
        },
        {
            "word": "hipbone",
            "prefix": "",
            "root": "hip",
            "suffix": "bone",
            "meaning": "the bony structure that forms the hip",
            "explanation": "The hipbone, also known as the pelvic bone or os coxae, is a bone that connects the trunk to the lower limbs and supports the body.",
            "chineseTranslation": "髖骨",
            "traditionalChineseTranslation": "髖骨",
            "lesson": 3
        },
        {
            "word": "pectineus",
            "prefix": "",
            "root": "pectin-",
            "suffix": "-us",
            "meaning": "a muscle located in the inner thigh that helps flex and adduct the hip.",
            "explanation": "The pectineus is a flat, quadrilateral muscle situated at the anterior part of the upper and medial aspect of the thigh. It is primarily involved in the movement of the thigh, assisting in its flexion and adduction.",
            "chineseTranslation": "耻骨肌",
            "traditionalChineseTranslation": "恥骨肌",
            "lesson": 3
        },
        {
            "word": "distal epiphysis",
            "prefix": "distal",
            "root": "epiphysis",
            "suffix": "",
            "meaning": "the end part of a long bone that is distant from the point of attachment",
            "explanation": "The distal epiphysis refers to the farthest end of a long bone, opposite the proximal epiphysis, and is involved in the formation of joints with adjacent bones. It plays a crucial role in joint function and bone development.",
            "chineseTranslation": "远端骨骺",
            "traditionalChineseTranslation": "遠端骨骺",
            "lesson": 3
        },
        {
            "word": "rhytidoplasty",
            "prefix": "rhytid-",
            "root": "plasty",
            "suffix": "",
            "meaning": "Surgical repair of wrinkles.",
            "explanation": "Rhytidoplasty is a cosmetic surgery procedure that involves removing wrinkles and excess skin to enhance the appearance of the face.",
            "chineseTranslation": "皱纹整形手术",
            "traditionalChineseTranslation": "皺紋整形手術",
            "lesson": 3
        },
        {
            "word": "petechiae",
            "prefix": "",
            "root": "petechia",
            "suffix": "-ae",
            "meaning": "small, round spots on the skin caused by bleeding underneath",
            "explanation": "Petechiae are tiny, pinpoint-sized red or purple spots that appear on the skin when small blood vessels (capillaries) bleed. They often indicate an underlying health issue, such as a blood clotting disorder or an infection.",
            "chineseTranslation": "瘀点",
            "traditionalChineseTranslation": "瘀點",
            "lesson": 3
        },
        {
            "word": "arrector pili muscle",
            "prefix": "",
            "root": "arrector pili",
            "suffix": "muscle",
            "meaning": "a smooth muscle attached to hair follicles that causes hair to stand upright (goosebumps) when contracted",
            "explanation": "The arrector pili muscle is a muscle associated with hair follicles in mammals. When contracted, it causes the hair to stand up, a reaction that can be triggered by cold or emotional responses such as fear. This process is commonly known as piloerection, which is often referred to as 'goosebumps'.",
            "chineseTranslation": "竖毛肌",
            "traditionalChineseTranslation": "豎毛肌",
            "lesson": 3
        },
        {
            "word": "periosteum",
            "prefix": "peri-",
            "root": "oste",
            "suffix": "-um",
            "meaning": "a dense layer of connective tissue enveloping the bones except at the surfaces of the joints",
            "explanation": "The periosteum is a vital part of the skeletal system, supplying blood and nutrients to the bone and serving as an attachment point for muscles and tendons.",
            "chineseTranslation": "骨膜",
            "traditionalChineseTranslation": "骨膜",
            "lesson": 3
        },
        {
            "word": "ligament",
            "prefix": "",
            "root": "ligament",
            "suffix": "",
            "meaning": "a fibrous connective tissue that connects bones to other bones",
            "explanation": "Ligaments are strong bands of tissue that provide stability and support to joints by connecting bones, allowing for limited movement and helping prevent excessive movement that could cause injury.",
            "chineseTranslation": "韧带",
            "traditionalChineseTranslation": "韌帶",
            "lesson": 3
        },
        {
            "word": "myalgia",
            "prefix": "myo-",
            "root": "alg",
            "suffix": "-ia",
            "meaning": "muscle pain",
            "explanation": "Myalgia refers to pain that occurs in the muscles. It can be caused by a variety of factors including injury, infection, or strain.",
            "chineseTranslation": "肌肉疼痛",
            "traditionalChineseTranslation": "肌肉疼痛",
            "lesson": 3
        },
        {
            "word": "clavicle",
            "prefix": "",
            "root": "clav-",
            "suffix": "-icle",
            "meaning": "the bone that connects the arm to the body, also known as the collarbone.",
            "explanation": "The clavicle is a long, thin bone located between the sternum (breastbone) and the scapula (shoulder blade). It plays a crucial role in shoulder movement and stability, serving as a support structure for the upper limb.",
            "chineseTranslation": "锁骨",
            "traditionalChineseTranslation": "鎖骨",
            "lesson": 3
        },
        {
            "word": "ulcer",
            "prefix": "",
            "root": "ulcer",
            "suffix": "",
            "meaning": "a sore that develops on the skin or mucous membrane, often associated with inflammation and infection.",
            "explanation": "An ulcer is a break in the skin or a mucous membrane that fails to heal, leading to tissue loss. Ulcers can occur in various parts of the body, including the stomach (gastric ulcer), intestines, and mouth.",
            "chineseTranslation": "溃疡",
            "traditionalChineseTranslation": "潰瘍",
            "lesson": 3
        },
        {
            "word": "musculotendinous",
            "prefix": "musculo-",
            "root": "tendin-",
            "suffix": "-ous",
            "meaning": "pertaining to both muscle and tendon",
            "explanation": "The term 'musculotendinous' refers to structures or conditions that involve both muscles and tendons, often seen in medical discussions about injuries or anatomical descriptions.",
            "chineseTranslation": "肌腱相关的",
            "traditionalChineseTranslation": "肌腱相關的",
            "lesson": 3
        },
        {
            "word": "pyoderma",
            "prefix": "pyo-",
            "root": "derm",
            "suffix": "",
            "meaning": "a bacterial skin infection characterized by pus production",
            "explanation": "Pyoderma refers to any skin condition that leads to the formation of pus due to bacterial infection. It is commonly seen in various forms such as impetigo, boils, and abscesses.",
            "chineseTranslation": "化脓性皮肤病",
            "traditionalChineseTranslation": "化膿性皮膚病",
            "lesson": 3
        },
        {
            "word": "kyphosis",
            "prefix": "",
            "root": "kyphos",
            "suffix": "-sis",
            "meaning": "abnormal convex curvature of the spine",
            "explanation": "Kyphosis is a condition where the spine has an excessive outward curve, typically occurring in the thoracic region, which can lead to a hunchback appearance.",
            "chineseTranslation": "驼背",
            "traditionalChineseTranslation": "駝背",
            "lesson": 3
        },
        {
            "word": "agonist",
            "prefix": "",
            "root": "agon",
            "suffix": "",
            "meaning": "A substance that activates a receptor to produce a biological response.",
            "explanation": "In pharmacology, an agonist is a chemical that binds to a receptor and triggers a response in the cell, mimicking the action of a naturally occurring substance.",
            "chineseTranslation": "激动剂",
            "traditionalChineseTranslation": "激動劑",
            "lesson": 3
        },
        {
            "word": "semitendinosis",
            "prefix": "semi-",
            "root": "tendin-",
            "suffix": "-osis",
            "meaning": "a muscle located in the back of the thigh, part of the hamstring group",
            "explanation": "The semitendinosis muscle helps in the flexion of the knee and extension of the hip. It is one of the three hamstring muscles.",
            "chineseTranslation": "半腱肌",
            "traditionalChineseTranslation": "半腱肌",
            "lesson": 3
        },
        {
            "word": "ilium",
            "prefix": "",
            "root": "ilium",
            "suffix": "",
            "meaning": "the large, flaring portion of the hip bone",
            "explanation": "The ilium is one of the three bones that make up the pelvis, and it is the uppermost and largest of the three. It plays a crucial role in supporting the weight of the body when sitting and standing, as well as providing attachment points for various muscles.",
            "chineseTranslation": "髂骨",
            "traditionalChineseTranslation": "髂骨",
            "lesson": 3
        },
        {
            "word": "ganglion cyst",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a noncancerous, fluid-filled sac that typically forms on or near a joint or tendon",
            "explanation": "Ganglion cysts are benign lumps that often appear along the tendons or joints of the wrists or hands, but they can also occur in other areas. They are filled with a jelly-like fluid and can vary in size. While they are usually painless, they can sometimes cause discomfort or restrict movement.",
            "chineseTranslation": "神經節囊腫",
            "traditionalChineseTranslation": "神經節囊腫",
            "lesson": 3
        },
        {
            "word": "extensor carpi radialis",
            "prefix": "extens-",
            "root": "carpi radialis",
            "suffix": "",
            "meaning": "a muscle that extends the wrist and is located on the radial side of the forearm",
            "explanation": "The extensor carpi radialis is one of the muscles in the forearm that helps in extending and abducting the wrist. It plays a crucial role in hand movements.",
            "chineseTranslation": "桡侧伸腕肌",
            "traditionalChineseTranslation": "小拇指側伸腕肌",
            "lesson": 3
        },
        {
            "word": "purulent",
            "prefix": "pur-",
            "root": "ulent",
            "suffix": "",
            "meaning": "containing, discharging, or caused by pus",
            "explanation": "The term 'purulent' describes a type of fluid or discharge that is thick and typically yellowish or greenish, commonly associated with infection.",
            "chineseTranslation": "脓性的",
            "traditionalChineseTranslation": "膿性的",
            "lesson": 3
        },
        {
            "word": "Nasal Septum",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The wall dividing the nasal cavity into two nostrils.",
            "explanation": "The nasal septum is composed of bone and cartilage and helps to support the structure of the nose while also separating the two air passages in the nasal cavity.",
            "chineseTranslation": "鼻中隔",
            "traditionalChineseTranslation": "鼻中隔",
            "lesson": 3
        },
        {
            "word": "lesion",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a region in an organ or tissue that has suffered damage through injury or disease.",
            "explanation": "Lesions can be classified as open (wounds) or closed (bruises), and they can occur in various forms such as tumors, ulcers, or rashes.",
            "chineseTranslation": "损伤",
            "traditionalChineseTranslation": "損傷",
            "lesson": 3
        },
        {
            "word": "antifungals",
            "prefix": "anti-",
            "root": "fung",
            "suffix": "als",
            "meaning": "Medications used to treat fungal infections.",
            "explanation": "Antifungals are a class of drugs that are used to manage infections caused by fungi. They can be used to treat various conditions including ringworm, athlete's foot, and systemic fungal infections.",
            "chineseTranslation": "抗真菌药",
            "traditionalChineseTranslation": "抗真菌藥",
            "lesson": 3
        },
        {
            "word": "diphenhydramine",
            "prefix": "di-",
            "root": "phen",
            "suffix": "-amine",
            "meaning": "an antihistamine used to relieve symptoms of allergy, hay fever, and the common cold",
            "explanation": "Diphenhydramine works by blocking the effects of histamine, a substance in the body that causes allergic symptoms. It is often used to treat allergic reactions, motion sickness, and as a sleep aid due to its sedative properties.",
            "chineseTranslation": "苯海拉明",
            "traditionalChineseTranslation": "苯海拉明",
            "lesson": 3
        },
        {
            "word": "pyogenic",
            "prefix": "pyo-",
            "root": "gen",
            "suffix": "-ic",
            "meaning": "producing or causing pus",
            "explanation": "The term 'pyogenic' refers to organisms or substances that produce pus, typically associated with infections and inflammation.",
            "chineseTranslation": "脓性",
            "traditionalChineseTranslation": "膿性",
            "lesson": 3
        },
        {
            "word": "medulla",
            "prefix": "",
            "root": "medulla",
            "suffix": "",
            "meaning": "the innermost part of an organ or structure, often referring to the inner region of the adrenal glands or the spinal cord",
            "explanation": "In anatomy, 'medulla' refers to the central region of certain organs. It is most commonly associated with the medulla oblongata in the brain, which is crucial for various autonomic functions, as well as the medullary region in other organs.",
            "chineseTranslation": "髓質",
            "traditionalChineseTranslation": "髓質",
            "lesson": 3
        },
        {
            "word": "scabies",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a contagious skin infestation caused by the mite Sarcoptes scabiei",
            "explanation": "Scabies is characterized by intense itching and a rash that often appears in small red bumps or blisters. It is most often spread through prolonged skin-to-skin contact and can also affect multiple individuals in close quarters.",
            "chineseTranslation": "疥疮",
            "traditionalChineseTranslation": "疥瘡",
            "lesson": 3
        },
        {
            "word": "sacrum",
            "prefix": "",
            "root": "sacr-",
            "suffix": "",
            "meaning": "the triangular bone at the base of the spine, consisting of five fused vertebrae",
            "explanation": "The sacrum is situated between the two hip bones and forms the posterior part of the pelvis. It plays a crucial role in supporting the weight of the upper body when sitting and standing.",
            "chineseTranslation": "骶骨",
            "traditionalChineseTranslation": "骶骨",
            "lesson": 3
        },
        {
            "word": "spine",
            "meaning": "The bony structure that forms the backbone of vertebrate animals, providing support and protection for the spinal cord.",
            "chineseTranslation": "脊柱",
            "traditionalChineseTranslation": "脊柱",
            "explanation": "The spine consists of vertebrae stacked on top of each other, forming a flexible column that enables upright posture and movement while encasing the spinal cord, which is vital for communication between the brain and the rest of the body.",
            "prefix": "",
            "root": "spine",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "gluteus maximus",
            "prefix": "",
            "root": "gluteus",
            "suffix": "",
            "meaning": "the largest muscle in the human body, located in the buttocks",
            "explanation": "The gluteus maximus is responsible for the movement of the hip and thigh, playing a key role in maintaining the upright posture and in activities such as walking, running, and climbing.",
            "chineseTranslation": "臀大肌",
            "traditionalChineseTranslation": "臀大肌",
            "lesson": 3
        },
        {
            "word": "epicondyle",
            "prefix": "epi-",
            "root": "condyle",
            "suffix": "",
            "meaning": "a bony prominence on a bone, typically located near a joint",
            "explanation": "An epicondyle is a raised area on the surface of a bone, which serves as an attachment point for tendons and ligaments. It is found at the ends of long bones, such as the humerus and femur, and is important for joint stability and movement.",
            "chineseTranslation": "上髁",
            "traditionalChineseTranslation": "上髁",
            "lesson": 3
        },
        {
            "word": "cyanosis",
            "prefix": "cyan-",
            "root": "-osis",
            "suffix": "",
            "meaning": "a bluish discoloration of the skin due to lack of oxygen in the blood",
            "explanation": "Cyanosis occurs when there is a high level of deoxygenated hemoglobin in the blood, leading to a bluish tint, often seen in the lips, fingers, and toes.",
            "chineseTranslation": "发绀",
            "traditionalChineseTranslation": "發紕",
            "lesson": 3
        },
        {
            "word": "fasciitis",
            "prefix": "",
            "root": "fasc(i)",
            "suffix": "itis",
            "meaning": "inflammation of the fascia",
            "explanation": "Fasciitis refers to the inflammation of the fascia, which is a connective tissue layer that surrounds muscles, blood vessels, and nerves. This condition can lead to pain and swelling in the affected area.",
            "chineseTranslation": "筋膜炎",
            "traditionalChineseTranslation": "筋膜炎",
            "lesson": 3
        },
        {
            "word": "dermis",
            "prefix": "",
            "root": "derm",
            "suffix": "",
            "meaning": "the thick layer of living tissue below the epidermis that forms the true skin",
            "explanation": "The dermis contains connective tissue, hair follicles, and other structures, and is responsible for the structural integrity of the skin.",
            "chineseTranslation": "真皮",
            "traditionalChineseTranslation": "真皮",
            "lesson": 3
        },
        {
            "word": "metacarpals",
            "prefix": "meta-",
            "root": "carp",
            "suffix": "-als",
            "meaning": "the five bones of the hand found between the wrist and the fingers",
            "explanation": "The metacarpals are the long bones in the middle of the hand that connect the wrist (carpals) to the fingers (phalanges). They are numbered from one to five, starting from the thumb side of the hand.",
            "chineseTranslation": "掌骨",
            "traditionalChineseTranslation": "掌骨",
            "lesson": 3
        },
        {
            "word": "sternocleidomastoid",
            "prefix": "stern/o, cleid/o",
            "root": "mastoid",
            "suffix": "-oid",
            "meaning": "A muscle in the neck that helps with the rotation and flexion of the head.",
            "explanation": "The sternocleidomastoid muscle extends from the sternum and clavicle to the mastoid process of the temporal bone. It is responsible for the movement and stabilization of the head and neck.",
            "chineseTranslation": "胸锁乳突肌",
            "traditionalChineseTranslation": "胸鎖乳突肌",
            "lesson": 3
        },
        {
            "word": "mandible",
            "prefix": "",
            "root": "mandible",
            "suffix": "",
            "meaning": "the lower jawbone in vertebrates",
            "explanation": "The mandible is the bone that forms the lower jaw in vertebrates. It is the largest and strongest bone of the face, providing structure for the mouth and holding the lower teeth.",
            "chineseTranslation": "下颌骨",
            "traditionalChineseTranslation": "下頜骨",
            "lesson": 3
        },
        {
            "word": "scoliosis",
            "prefix": "",
            "root": "scoli",
            "suffix": "-osis",
            "meaning": "abnormal lateral curvature of the spine",
            "explanation": "Scoliosis is a condition characterized by an abnormal curvature of the spine, which can affect posture and may lead to pain and discomfort. It is often diagnosed in childhood or adolescence, although it can also occur in adults.",
            "chineseTranslation": "脊柱侧弯",
            "traditionalChineseTranslation": "脊柱側彎",
            "lesson": 3
        },
        {
            "word": "nonsteroidal anti-inflammatory drugs",
            "prefix": "non-",
            "root": "steroid",
            "suffix": "-al",
            "meaning": "a class of medications that provide analgesic (pain-relieving) and anti-inflammatory effects without the use of steroids",
            "explanation": "Nonsteroidal anti-inflammatory drugs (NSAIDs) are commonly used to treat pain, inflammation, and fever. They work by inhibiting enzymes involved in the production of substances that mediate inflammation and pain. Unlike corticosteroids, NSAIDs do not have steroid properties, which means they have a different mechanism of action and side effect profile.",
            "chineseTranslation": "非类固醇抗炎药",
            "traditionalChineseTranslation": "非類固醇抗炎藥",
            "lesson": 3
        },
        {
            "word": "myoneural",
            "prefix": "myo-",
            "root": "neural",
            "suffix": "",
            "meaning": "pertaining to muscle and nerve",
            "explanation": "The term 'myoneural' refers to the relationship or connection between muscle tissue and nerve cells, particularly in contexts related to muscle stimulation and nerve activity.",
            "chineseTranslation": "肌神经的",
            "traditionalChineseTranslation": "肌神經的",
            "lesson": 3
        },
        {
            "word": "sternum",
            "prefix": "",
            "root": "stern",
            "suffix": "um",
            "meaning": "the flat bone in the center of the chest that anchors the ribs.",
            "explanation": "The sternum, commonly known as the breastbone, is a long flat bone located in the middle of the chest. It connects to the ribs via cartilage and helps protect the heart and lungs.",
            "chineseTranslation": "胸骨",
            "traditionalChineseTranslation": "胸骨",
            "lesson": 3
        },
        {
            "word": "cortaid",
            "prefix": "",
            "root": "cort",
            "suffix": "aid",
            "meaning": "a medication used to reduce inflammation",
            "explanation": "Cortaid is a topical corticosteroid that is used to relieve skin irritation and inflammation. It works by suppressing the immune response and reducing the redness and swelling in the area where it is applied.",
            "chineseTranslation": "可的松",
            "traditionalChineseTranslation": "可的松",
            "lesson": 3
        },
        {
            "word": "pectoral girdle",
            "meaning": "the bony structure that supports the arms, consisting of the clavicles and scapulae",
            "chineseTranslation": "胸带",
            "traditionalChineseTranslation": "胸帶",
            "explanation": "The pectoral girdle, also known as the shoulder girdle, connects the upper limbs to the axial skeleton and provides attachment for muscles that move the arms.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 3
        },
        {
            "word": "yellow bone marrow",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A type of bone marrow that contains a high amount of fat cells and is responsible for the storage of fats, found in the central cavities of long bones.",
            "explanation": "Yellow bone marrow is primarily composed of adipocytes (fat cells), which serve as an energy reserve, and it can convert back to red bone marrow if necessary, such as in cases of severe blood loss or demand for increased blood cell production.",
            "chineseTranslation": "黄色骨髓",
            "traditionalChineseTranslation": "黃色骨髓",
            "lesson": 3
        },
        {
            "word": "lidocaine",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A local anesthetic used to numb tissue in a specific area.",
            "explanation": "Lidocaine works by blocking the signals at the nerve endings in the area where it is applied, preventing the sensation of pain.",
            "chineseTranslation": "利多卡因",
            "traditionalChineseTranslation": "利多卡因",
            "lesson": 3
        },
        {
            "word": "gluteus maximus",
            "prefix": "",
            "root": "gluteus",
            "suffix": "",
            "meaning": "the largest of the three gluteal muscles located in the buttocks",
            "explanation": "The gluteus maximus is one of the major muscles in the body, responsible for movement of the hip and thigh. It plays a crucial role in maintaining the stability of the pelvis and assisting in activities such as walking, running, and climbing.",
            "chineseTranslation": "臀大肌",
            "traditionalChineseTranslation": "臀大肌",
            "lesson": 3
        },
        {
            "word": "trapezius",
            "prefix": "",
            "root": "trapez-",
            "suffix": "ius",
            "meaning": "A large triangular muscle located on the upper back that is responsible for moving, rotating, and stabilizing the shoulder blade (scapula) and extending the neck.",
            "explanation": "The trapezius muscle extends from the back of the skull down to the mid-back and laterally to the shoulder. It is involved in various movements such as shoulder elevation, retraction of the scapula, and neck extension.",
            "chineseTranslation": "斜方肌",
            "traditionalChineseTranslation": "斜方肌",
            "lesson": 3
        },
        {
            "word": "triamcinolone",
            "meaning": "a synthetic glucocorticoid used to treat inflammation and immune-related conditions",
            "chineseTranslation": "曲安奈德",
            "traditionalChineseTranslation": "曲安奈德",
            "explanation": "Triamcinolone is a corticosteroid that is used to relieve inflammation and alleviate allergic and autoimmune conditions. It can be administered via injection, topical cream, or inhalation.",
            "prefix": "tri-",
            "root": "amcinolone",
            "suffix": "-one",
            "lesson": 3
        },
        {
            "word": "sweat pore",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The tiny openings on the skin through which sweat is excreted.",
            "explanation": "Sweat pores are openings in the skin that allow sweat (perspiration) to be released, helping to regulate body temperature and maintain skin hydration.",
            "chineseTranslation": "汗孔",
            "traditionalChineseTranslation": "汗孔",
            "lesson": 3
        },
        {
            "word": "dislocation",
            "prefix": "dis-",
            "root": "locate",
            "suffix": "-ion",
            "meaning": "The displacement of a bone from its normal joint position.",
            "explanation": "Dislocation occurs when bones in a joint become displaced or misaligned. It commonly affects the shoulders, fingers, and knees, often due to injury or trauma.",
            "chineseTranslation": "脱位",
            "traditionalChineseTranslation": "脫位",
            "lesson": 3
        },
        {
            "word": "rectus femoris",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a large muscle located in the front of the thigh",
            "explanation": "The rectus femoris is one of the four quadriceps muscles. It is responsible for extending the knee and flexing the hip.",
            "chineseTranslation": "股直肌",
            "traditionalChineseTranslation": "股直肌",
            "lesson": 3
        },
        {
            "word": "tensor fasciae latae",
            "prefix": "",
            "root": "tensor",
            "suffix": "",
            "meaning": "a muscle located in the outer thigh that helps to stabilize and support the hip and knee.",
            "explanation": "The tensor fasciae latae (TFL) is a narrow muscle situated on the lateral aspect of the thigh, responsible for the tension of the iliotibial band, aiding in the stabilization of the hip and knee joints during movement.",
            "chineseTranslation": "阔筋膜张肌",
            "traditionalChineseTranslation": "闊筋膜張肌",
            "lesson": 3
        },
        {
            "word": "extensor carpi",
            "meaning": "a muscle that extends the wrist",
            "chineseTranslation": "腕伸肌",
            "traditionalChineseTranslation": "腕伸肌",
            "explanation": "The extensor carpi is a group of muscles that are responsible for extending and moving the wrist in specific directions. They play an important role in hand and wrist movement during activities such as gripping or lifting.",
            "prefix": "ex-",
            "root": "tens",
            "suffix": "or",
            "lesson": 3
        },
        {
            "word": "intradermal",
            "prefix": "intra-",
            "root": "derm",
            "suffix": "-al",
            "meaning": "pertaining to within the skin",
            "explanation": "Intradermal refers to the administration of a substance within the dermis layer of the skin. This method is often used for allergy tests and vaccinations.",
            "chineseTranslation": "皮内的",
            "traditionalChineseTranslation": "皮內的",
            "lesson": 3
        },
        {
            "word": "temporal bone",
            "prefix": "",
            "root": "temporal",
            "suffix": "bone",
            "meaning": "the bone on the sides of the skull that houses the structures of the ear",
            "explanation": "The temporal bone is a paired bone in the skull that helps protect the brain and supports the structures of the ear.",
            "chineseTranslation": "颞骨",
            "traditionalChineseTranslation": "顳骨",
            "lesson": 3
        },
        {
            "word": "liposuction",
            "prefix": "lipo-",
            "root": "suction",
            "suffix": "",
            "meaning": "A surgical procedure that removes fat from specific areas of the body.",
            "explanation": "Liposuction is a cosmetic surgery technique that involves the removal of excess fat deposits in order to improve body contours and proportions. It is commonly performed on areas such as the abdomen, thighs, buttocks, and arms.",
            "chineseTranslation": "抽脂手术",
            "traditionalChineseTranslation": "抽脂手術",
            "lesson": 3
        },
        {
            "word": "antiseptics",
            "prefix": "anti-",
            "root": "sept",
            "suffix": "ics",
            "meaning": "substances that prevent infection by killing or inhibiting the growth of microorganisms.",
            "explanation": "Antiseptics are used in medical settings to disinfect and clean wounds, surgical instruments, and skin to prevent infection.",
            "chineseTranslation": "抗菌剂",
            "traditionalChineseTranslation": "抗菌劑",
            "lesson": 3
        },
        {
            "word": "deltoid",
            "meaning": "A muscles shaped like a delta that is located in the shoulder region",
            "chineseTranslation": "三角肌",
            "traditionalChineseTranslation": "三角肌",
            "explanation": "The deltoid muscle is responsible for the abduction of the arm, among other functions, and it covers the shoulder joint.",
            "prefix": "",
            "root": "delt",
            "suffix": "oid",
            "lesson": 3
        },
        {
            "word": "onychomalacia",
            "prefix": "onycho-",
            "root": "malacia",
            "suffix": "",
            "meaning": "softening of the nails",
            "explanation": "Onychomalacia refers to the condition characterized by the abnormal softening of the nails, which can lead to changes in their texture and integrity.",
            "chineseTranslation": "指甲软化",
            "traditionalChineseTranslation": "指甲軟化",
            "lesson": 3
        },
        {
            "word": "fasciotomy",
            "prefix": "fasci-",
            "root": "otomy",
            "suffix": "",
            "meaning": "surgical incision into the fascia",
            "explanation": "A fasciotomy is a surgical procedure in which incisions are made in the fascia, the connective tissue surrounding muscles, to relieve pressure and improve blood flow, usually performed in cases of compartment syndrome.",
            "chineseTranslation": "筋膜切开术",
            "traditionalChineseTranslation": "筋膜切開術",
            "lesson": 3
        },
        {
            "word": "lipectomy",
            "prefix": "lip-",
            "root": "-ectomy",
            "suffix": "",
            "meaning": "surgical removal of fat tissue",
            "explanation": "Lipectomy is a surgical procedure that involves the removal of fat from specific areas of the body, commonly performed for cosmetic reasons or to improve health.",
            "chineseTranslation": "脂肪切除术",
            "traditionalChineseTranslation": "脂肪切除術",
            "lesson": 3
        },
        {
            "word": "acyclovir",
            "prefix": "a-",
            "root": "cyclo",
            "suffix": "vir",
            "meaning": "an antiviral medication used to treat infections caused by certain types of viruses, mainly herpes viruses.",
            "explanation": "Acyclovir is used to manage conditions such as genital herpes, shingles, and chickenpox. It works by inhibiting the replication of viral DNA, thereby reducing the severity and duration of the infection.",
            "chineseTranslation": "阿昔洛韦",
            "traditionalChineseTranslation": "阿昔洛韋",
            "lesson": 3
        },
        {
            "word": "dorsiflexion",
            "prefix": "dorsi-",
            "root": "flexion",
            "suffix": "",
            "meaning": "the action of raising the foot upwards towards the shin",
            "explanation": "Dorsiflexion refers to the movement of the foot where the toes are brought closer to the shin, which decreases the angle between the dorsum (top) of the foot and the leg. It is the opposite of plantar flexion.",
            "chineseTranslation": "背屈",
            "traditionalChineseTranslation": "背屈",
            "lesson": 3
        },
        {
            "word": "scleroderma",
            "prefix": "sclero-",
            "root": "derma",
            "suffix": "",
            "meaning": "a disease characterized by the hardening and tightening of the skin and connective tissues",
            "explanation": "Scleroderma is an autoimmune disorder in which the skin and connective tissues become progressively hardened due to collagen accumulation. It can affect both the skin and internal organs.",
            "chineseTranslation": "硬皮病",
            "traditionalChineseTranslation": "硬皮病",
            "lesson": 3
        },
        {
            "word": "valacyclovir",
            "prefix": "val-",
            "root": "cyclo",
            "suffix": "-vir",
            "meaning": "an antiviral medication used to treat infections caused by certain viruses, notably herpes viruses.",
            "explanation": "Valacyclovir is a prodrug that converts to acyclovir in the body. It is primarily used to treat conditions caused by the herpes simplex virus, including genital herpes and herpes zoster (shingles), and it helps reduce the frequency of outbreaks.",
            "chineseTranslation": "伐昔洛韦",
            "traditionalChineseTranslation": "伐昔洛韋",
            "lesson": 3
        },
        {
            "word": "rhomboid",
            "prefix": "",
            "root": "rhombo-",
            "suffix": "-oid",
            "meaning": "A muscle or structure shaped like a rhombus, often referring to the rhomboid muscles located in the upper back that connect the scapula to the spine.",
            "explanation": "The rhomboid muscles play a crucial role in the movement and stabilization of the shoulder blade. They are responsible for retracting the scapula, which brings the shoulder blades closer together, and are also involved in the elevation and rotation of the scapula along with the trapezius muscle.",
            "chineseTranslation": "菱形肌",
            "traditionalChineseTranslation": "菱形肌",
            "lesson": 3
        },
        {
            "word": "rheumatoid arthritis",
            "prefix": "",
            "root": "rheumat/o",
            "suffix": "itis",
            "meaning": "A chronic inflammatory disorder affecting many joints, including those in the hands and feet.",
            "explanation": "Rheumatoid arthritis is an autoimmune disease where the body's immune system mistakenly attacks healthy joint tissues, leading to inflammation, pain, and possible joint damage.",
            "chineseTranslation": "类风湿性关节炎",
            "traditionalChineseTranslation": "類風濕性關節炎",
            "lesson": 3
        },
        {
            "word": "pruritus",
            "prefix": "",
            "root": "pruritus",
            "suffix": "",
            "meaning": "itching or an uncomfortable sensation that causes the desire to scratch",
            "explanation": "Pruritus is a medical term used to describe the sensation of itching, which can arise from a variety of conditions, including allergies, skin disorders, and systemic diseases.",
            "chineseTranslation": "瘙痒",
            "traditionalChineseTranslation": "瘙癢",
            "lesson": 3
        },
        {
            "word": "cystic acne",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A severe form of acne characterized by cysts or large, inflamed lesions under the skin.",
            "explanation": "Cystic acne occurs when oil and dead skin cells clog hair follicles, leading to deep inflammation and the formation of painful cysts. It is often associated with hormonal changes and can leave scars if not treated properly.",
            "chineseTranslation": "囊肿性痤疮",
            "traditionalChineseTranslation": "囊腫性痤瘡",
            "lesson": 3
        },
        {
            "word": "anhidrosis",
            "prefix": "an-",
            "root": "hidr(o)-",
            "suffix": "-osis",
            "meaning": "the inability to sweat normally",
            "explanation": "Anhidrosis is a medical condition characterized by a decreased or absent ability to sweat, which can lead to overheating and heat-related illnesses.",
            "chineseTranslation": "无汗症",
            "traditionalChineseTranslation": "無汗症",
            "lesson": 3
        },
        {
            "word": "clotrimazole",
            "prefix": "",
            "root": "trimazole",
            "suffix": "",
            "meaning": "an antifungal medication used to treat various fungal infections",
            "explanation": "Clotrimazole is primarily used to treat skin infections such as athlete's foot, ringworm, and yeast infections by inhibiting the growth of fungi.",
            "chineseTranslation": "克霉唑",
            "traditionalChineseTranslation": "克霉唑",
            "lesson": 3
        },
        {
            "word": "eustachian tube",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A tube that connects the middle ear to the nasopharynx, helping to equalize air pressure on both sides of the eardrum.",
            "explanation": "The Eustachian tube helps to ventilate the middle ear and drain any fluid that may accumulate. It plays a crucial role in hearing and maintaining balance.",
            "chineseTranslation": "咽鼓管",
            "traditionalChineseTranslation": "咽鼓管",
            "lesson": 3
        },
        {
            "word": "synovial joint",
            "prefix": "",
            "root": "synovial",
            "suffix": "joint",
            "meaning": "a type of joint in which the ends of the bones are surrounded by a fluid-filled joint capsule, allowing for free movement",
            "explanation": "Synovial joints are characterized by the presence of a synovial membrane that secretes synovial fluid, which lubricates the joint and reduces friction during movement. They are the most movable type of joint in the body.",
            "chineseTranslation": "滑液关节",
            "traditionalChineseTranslation": "滑液關節",
            "lesson": 3
        },
        {
            "word": "latissimus dorsi",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the largest muscle in the back, responsible for the movement of the shoulder joint",
            "explanation": "The latissimus dorsi is a broad, flat muscle that extends from the lower spine to the back of the arm. It plays a crucial role in various movements of the upper body, including adduction, extension, and internal rotation of the shoulder.",
            "chineseTranslation": "阔背肌",
            "traditionalChineseTranslation": "闊背肌",
            "lesson": 3
        },
        {
            "word": "rhytidectomy",
            "prefix": "rhytid-",
            "root": "-ectomy",
            "suffix": "",
            "meaning": "surgical removal of wrinkles",
            "explanation": "Rhytidectomy, commonly known as a facelift, is a surgical procedure aimed at reducing the signs of aging in the face and neck by removing excess skin and tightening the underlying tissues.",
            "chineseTranslation": "皮肤皱纹切除术",
            "traditionalChineseTranslation": "皮膚皺紋切除術",
            "lesson": 3
        },
        {
            "word": "hydrogen peroxide",
            "prefix": "hydro-",
            "root": "gen",
            "suffix": "oxide",
            "meaning": "A chemical compound (H2O2) used as an antiseptic and bleaching agent.",
            "explanation": "Hydrogen peroxide is a colorless liquid that is a powerful oxidizing agent. It is commonly used for disinfection, sterilization, and as a bleaching agent in various applications.",
            "chineseTranslation": "过氧化氢",
            "traditionalChineseTranslation": "過氧化氫",
            "lesson": 3
        }
    ]
}