{
    "version": "0.0.1",
    "words": [
        {
            "word": "cardiovascular",
            "prefix": "cardio-",
            "root": "vascul-",
            "suffix": "-ar",
            "meaning": "pertaining to the heart and blood vessels",
            "explanation": "The term 'cardiovascular' encompasses the entire system involving the heart (cardio) and the network of blood vessels (vascular) responsible for circulating blood throughout the body.",
            "chineseTranslation": "心血管的",
            "traditionalChineseTranslation": "心血管的",
            "lesson": 4
        },
        {
            "word": "arteries",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Blood vessels that carry oxygenated blood away from the heart to the tissues of the body.",
            "explanation": "Arteries are part of the cardiovascular system and are essential for transporting oxygen and nutrients to various organs and tissues. They have thick, elastic walls to accommodate the high pressure of blood pumped from the heart.",
            "chineseTranslation": "动脉",
            "traditionalChineseTranslation": "動脈",
            "lesson": 4
        },
        {
            "word": "capillaries",
            "prefix": "",
            "root": "capill-",
            "suffix": "-aries",
            "meaning": "Small blood vessels that connect arterioles and venules",
            "explanation": "Capillaries are tiny blood vessels where the exchange of oxygen, carbon dioxide, nutrients, and waste occurs between blood and surrounding tissues.",
            "chineseTranslation": "毛细血管",
            "traditionalChineseTranslation": "毛細血管",
            "lesson": 4
        },
        {
            "word": "veins",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Blood vessels that carry blood towards the heart.",
            "explanation": "Veins are the blood vessels that are responsible for transporting deoxygenated blood from the body back to the heart, except for the pulmonary veins, which carry oxygenated blood from the lungs to the heart.",
            "chineseTranslation": "静脉",
            "traditionalChineseTranslation": "靜脈",
            "lesson": 4
        },
        {
            "word": "pericardium",
            "prefix": "peri-",
            "root": "cardio",
            "suffix": "-ium",
            "meaning": "the membrane enclosing the heart",
            "explanation": "The pericardium is a double-walled sac containing the heart and the roots of the great vessels. It provides protection and prevents the heart from over-expanding. The outer fibrous layer is called the fibrous pericardium, and the inner serous layer is divided into parietal and visceral layers.",
            "chineseTranslation": "心包",
            "traditionalChineseTranslation": "心包",
            "lesson": 4
        },
        {
            "word": "fibrous pericardium",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The tough, outer layer of the pericardium that surrounds the heart.",
            "explanation": "The fibrous pericardium provides protection to the heart and anchors it within the mediastinum. It is composed of dense connective tissue and serves to prevent excessive movement of the heart within the thoracic cavity.",
            "chineseTranslation": "纖維性心包",
            "traditionalChineseTranslation": "纖維性心包",
            "lesson": 4
        },
        {
            "word": "parietal pericardium",
            "prefix": "parietal",
            "root": "cardi",
            "suffix": "ium",
            "meaning": "The outer layer of the pericardium, which is the fibrous sac surrounding the heart.",
            "explanation": "The parietal pericardium is the outer layer of the pericardial cavity that serves to anchor the heart and protect it while allowing for movement during heartbeats.",
            "chineseTranslation": "壁心包",
            "traditionalChineseTranslation": "壁心包",
            "lesson": 4
        },
        {
            "word": "epicardium",
            "prefix": "epi-",
            "root": "cardi",
            "suffix": "-um",
            "meaning": "the outermost layer of the heart wall",
            "explanation": "The epicardium is a thin layer that covers the heart and is part of the pericardium, providing a protective layer as well as containing the coronary arteries.",
            "chineseTranslation": "心外膜",
            "traditionalChineseTranslation": "心外膜",
            "lesson": 4
        },
        {
            "word": "endocardium",
            "prefix": "endo-",
            "root": "card",
            "suffix": "-ium",
            "meaning": "the innermost layer of tissue lining the chambers of the heart",
            "explanation": "The endocardium is a thin membrane that lines the interior of the heart cavities, providing a smooth surface for blood flow and contributing to the proper functioning of the heart.",
            "chineseTranslation": "心内膜",
            "traditionalChineseTranslation": "心內膜",
            "lesson": 4
        },
        {
            "word": "atria",
            "prefix": "",
            "root": "atrium",
            "suffix": "",
            "meaning": "The plural form of atrium, referring to the upper chambers of the heart that receive blood from the veins.",
            "explanation": "The heart has two atria—right and left—which play a crucial role in circulating blood throughout the body.",
            "chineseTranslation": "心房",
            "traditionalChineseTranslation": "心房",
            "lesson": 4
        },
        {
            "word": "ventricle",
            "prefix": "",
            "root": "ventricul-",
            "suffix": "",
            "meaning": "a small cavity or chamber, especially in the heart or brain",
            "explanation": "The ventricles are cavities in the heart that pump blood, as well as cavities in the brain that contain cerebrospinal fluid.",
            "chineseTranslation": "心室",
            "traditionalChineseTranslation": "心室",
            "lesson": 4
        },
        {
            "word": "interatrial septum",
            "prefix": "inter-",
            "root": "atrial",
            "suffix": "septum",
            "meaning": "A wall (septum) that separates the two upper chambers (atria) of the heart.",
            "explanation": "The interatrial septum is a crucial structure of the heart that separates the right atrium from the left atrium, preventing the mixing of oxygenated and deoxygenated blood.",
            "chineseTranslation": "心房中隔",
            "traditionalChineseTranslation": "心房中隔",
            "lesson": 4
        },
        {
            "word": "interventricular septum",
            "prefix": "inter-",
            "root": "ventricul-",
            "suffix": "-ar",
            "meaning": "The wall separating the left and right ventricles of the heart.",
            "explanation": "The interventricular septum is a muscular wall that divides the heart's ventricles, which helps prevent the mixing of oxygenated and deoxygenated blood.",
            "chineseTranslation": "心室间隔",
            "traditionalChineseTranslation": "心室間隔",
            "lesson": 4
        },
        {
            "word": "heart valves",
            "meaning": "Structures in the heart that open and close to regulate blood flow through the chambers of the heart.",
            "chineseTranslation": "心脏瓣膜",
            "traditionalChineseTranslation": "心臟瓣膜",
            "explanation": "Heart valves prevent the backflow of blood and ensure it flows in the correct direction within the heart. There are four main heart valves: the mitral valve, tricuspid valve, aortic valve, and pulmonary valve.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 4
        },
        {
            "word": "aortic valve",
            "prefix": "aort-",
            "root": "valve",
            "suffix": "",
            "meaning": "The valve located between the left ventricle of the heart and the aorta, preventing backflow of blood.",
            "explanation": "The aortic valve regulates blood flow from the heart into the aorta and subsequently to the rest of the body. It is essential for maintaining proper circulation and heart function.",
            "chineseTranslation": "主动脉瓣",
            "traditionalChineseTranslation": "主動脈瓣",
            "lesson": 4
        },
        {
            "word": "pulmonary valve",
            "prefix": "pulmo-",
            "root": "valv",
            "suffix": "",
            "meaning": "a valve located between the right ventricle of the heart and the pulmonary artery",
            "explanation": "The pulmonary valve helps regulate blood flow from the right ventricle to the lungs, preventing backflow into the heart when the ventricle relaxes.",
            "chineseTranslation": "肺动脉瓣",
            "traditionalChineseTranslation": "肺動脈瓣",
            "lesson": 4
        },
        {
            "word": "atrioventricular valve",
            "prefix": "atrio-",
            "root": "ventricul-",
            "suffix": "-valve",
            "meaning": "a valve located between the atria and ventricles of the heart",
            "explanation": "The atrioventricular valves, which include the tricuspid and mitral valves, prevent backflow of blood from the ventricles to the atria during ventricular contraction.",
            "chineseTranslation": "房室瓣",
            "traditionalChineseTranslation": "房室瓣",
            "lesson": 4
        },
        {
            "word": "mitral valve-bicuspid valve",
            "meaning": "a valve located between the left atrium and left ventricle of the heart, preventing backflow of blood when the ventricle contracts.",
            "chineseTranslation": "二尖瓣",
            "traditionalChineseTranslation": "二尖瓣",
            "explanation": "The mitral valve, also known as the bicuspid valve, consists of two flaps (cusps) that open and close to regulate blood flow from the left atrium into the left ventricle and prevent backflow into the atrium.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 4
        },
        {
            "word": "tricuspid valve",
            "prefix": "tri-",
            "root": "cuspid",
            "suffix": "valve",
            "meaning": "a heart valve located between the right atrium and right ventricle, having three flaps (leaflets)",
            "explanation": "The tricuspid valve regulates blood flow from the right atrium to the right ventricle. It prevents backflow of blood into the atrium during ventricular contraction.",
            "chineseTranslation": "三尖瓣",
            "traditionalChineseTranslation": "三尖瓣",
            "lesson": 4
        },
        {
            "word": "aorta",
            "prefix": "",
            "root": "aort-",
            "suffix": "",
            "meaning": "the main artery that carries blood away from the heart to the rest of the body",
            "explanation": "The aorta is the largest artery in the body, originating from the left ventricle of the heart and branching out to deliver oxygenated blood to the tissues through systemic circulation.",
            "chineseTranslation": "主动脉",
            "traditionalChineseTranslation": "主動脈",
            "lesson": 4
        },
        {
            "word": "pulmonary artery",
            "prefix": "pulmo-",
            "root": "nary",
            "suffix": "",
            "meaning": "The vessel that carries blood from the heart to the lungs.",
            "explanation": "The pulmonary artery is responsible for transporting deoxygenated blood from the right ventricle of the heart to the lungs for oxygenation.",
            "chineseTranslation": "肺动脉",
            "traditionalChineseTranslation": "肺動脈",
            "lesson": 4
        },
        {
            "word": "pulmonary vein",
            "prefix": "",
            "root": "pulmon-",
            "suffix": "-ary",
            "meaning": "血管，负责将氧化血液从肺部送回心脏的静脉",
            "explanation": "Pulmonary veins are blood vessels that carry oxygenated blood from the lungs to the heart. Unlike most veins, which carry deoxygenated blood, pulmonary veins carry oxygen-rich blood, allowing it to be distributed to the rest of the body.",
            "chineseTranslation": "肺静脉",
            "traditionalChineseTranslation": "肺靜脈",
            "lesson": 4
        },
        {
            "word": "vena cava",
            "meaning": "A large vein that carries deoxygenated blood from the body to the heart.",
            "chineseTranslation": "大静脉",
            "traditionalChineseTranslation": "大靜脈",
            "explanation": "There are two main venae cavae in the human body: the superior vena cava, which carries blood from the upper body, and the inferior vena cava, which carries blood from the lower body.",
            "prefix": "",
            "root": "vena (vein) + cava (hollow)",
            "suffix": "",
            "lesson": 4
        },
        {
            "word": "inferior vena cava",
            "prefix": "inferior",
            "root": "vena cava",
            "suffix": "",
            "meaning": "a large vein that carries deoxygenated blood from the lower body to the heart",
            "explanation": "The inferior vena cava is one of the two main veins (the other being the superior vena cava) that drain blood back to the heart. It specifically returns blood from the lower half of the body.",
            "chineseTranslation": "下腔静脉",
            "traditionalChineseTranslation": "下腔靜脈",
            "lesson": 4
        },
        {
            "word": "superior vena cava",
            "prefix": "superior",
            "root": "vena",
            "suffix": "cava",
            "meaning": "the large vein that carries deoxygenated blood from the upper half of the body to the heart",
            "explanation": "The superior vena cava is one of the major veins in the human body. It is responsible for returning blood to the heart from the upper regions, including the head, neck, arms, and upper torso. It functions by collecting blood from smaller veins and channels it into the right atrium of the heart, where it can be pumped to the lungs for oxygenation.",
            "chineseTranslation": "上腔静脉",
            "traditionalChineseTranslation": "上腔靜脈",
            "lesson": 4
        },
        {
            "word": "pulmonary circulation",
            "prefix": "pulmon-",
            "root": "circulation",
            "suffix": "",
            "meaning": "The movement of blood from the heart to the lungs and back to the heart.",
            "explanation": "Pulmonary circulation specifically refers to the route of blood flow where deoxygenated blood is transported from the right side of the heart to the lungs to get oxygenated, and then the oxygen-rich blood is returned to the left side of the heart.",
            "chineseTranslation": "肺循环",
            "traditionalChineseTranslation": "肺循環",
            "lesson": 4
        },
        {
            "word": "systemic circulation",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the circulatory system that carries oxygenated blood away from the heart to the body and returns deoxygenated blood back to the heart.",
            "explanation": "Systemic circulation refers to the circuit of blood flow that supplies the body tissues with oxygen and nutrients while removing waste products. This circulation begins when oxygenated blood is pumped from the left ventricle of the heart into the aorta and then distributed to various parts of the body.",
            "chineseTranslation": "全身循环",
            "traditionalChineseTranslation": "全身循環",
            "lesson": 4
        },
        {
            "word": "coronary artery",
            "prefix": "",
            "root": "coronary",
            "suffix": "artery",
            "meaning": "A blood vessel that supplies blood to the heart muscle.",
            "explanation": "Coronary arteries branch off from the aorta and are responsible for delivering oxygen-rich blood to the heart tissues. They are critical for maintaining the function of the heart as they provide the necessary nutrients and oxygen for cardiac tissue to survive.",
            "chineseTranslation": "冠状动脉",
            "traditionalChineseTranslation": "冠狀動脈",
            "lesson": 4
        },
        {
            "word": "diastole",
            "prefix": "dia-",
            "root": "stole",
            "suffix": "",
            "meaning": "the phase of the heartbeat when the heart muscle relaxes and the chambers fill with blood.",
            "explanation": "Diastole is a phase of the cardiac cycle during which the heart's chambers (the atria and ventricles) relax and fill with blood. This is followed by systole, which is the contraction phase where blood is pumped out of the heart.",
            "chineseTranslation": "舒张期",
            "traditionalChineseTranslation": "舒張期",
            "lesson": 4
        },
        {
            "word": "systole",
            "prefix": "",
            "root": "systol-",
            "suffix": "",
            "meaning": "the contraction phase of the heart cycle",
            "explanation": "Systole refers to the phase in the cardiac cycle where the heart muscle contracts, resulting in the pumping of blood out of the heart chambers.",
            "chineseTranslation": "收缩",
            "traditionalChineseTranslation": "收縮",
            "lesson": 4
        },
        {
            "word": "sinoatrial node",
            "prefix": "sino-",
            "root": "atrial",
            "suffix": "node",
            "meaning": "the natural pacemaker of the heart, responsible for initiating the heartbeat.",
            "explanation": "The sinoatrial node (SA node) is a small mass of tissue located in the right atrium of the heart. It generates electrical impulses that spread through the heart muscle, causing it to contract and pump blood. It is crucial for maintaining the heart's rhythm.",
            "chineseTranslation": "窦房结",
            "traditionalChineseTranslation": "竇房結",
            "lesson": 4
        },
        {
            "word": "pacemaker",
            "prefix": "",
            "root": "maker",
            "suffix": "",
            "meaning": "a device that produces electrical impulses to regulate the heartbeat",
            "explanation": "A pacemaker is an electronic device implanted in the body to help control abnormal heart rhythms. It sends electrical impulses to the heart to maintain a consistent heartbeat, particularly in cases of arrhythmia where the natural pacing of the heart is disrupted.",
            "chineseTranslation": "起搏器",
            "traditionalChineseTranslation": "起搏器",
            "lesson": 4
        },
        {
            "word": "myocardial infarction",
            "prefix": "myo-",
            "root": "cardi",
            "suffix": "-al infarction",
            "meaning": "a blockage of blood flow to the heart muscle causing tissue damage or death",
            "explanation": "Myocardial infarction, commonly known as a heart attack, occurs when blood supply to part of the heart muscle is interrupted or blocked, leading to damage or death of that part of the muscle due to lack of oxygen.",
            "chineseTranslation": "心肌梗死",
            "traditionalChineseTranslation": "心肌梗死",
            "lesson": 4
        },
        {
            "word": "ischemia",
            "prefix": "isch-",
            "root": "emia",
            "suffix": "",
            "meaning": "a condition characterized by insufficient blood flow to a part of the body.",
            "explanation": "Ischemia occurs when there is a restriction in blood supply to tissues, leading to a shortage of oxygen and nutrients needed for cellular metabolism.",
            "chineseTranslation": "缺血",
            "traditionalChineseTranslation": "缺血",
            "lesson": 4
        },
        {
            "word": "angina pectoris",
            "prefix": "",
            "root": "angina",
            "suffix": "pectoris",
            "meaning": "chest pain due to reduced blood flow to the heart muscle",
            "explanation": "Angina pectoris is a type of chest pain caused by reduced blood flow to the heart. It often feels like pressure or squeezing in the chest and may also be felt in the shoulders, neck, arms, back, teeth, or jaw. It is typically triggered by physical exertion or stress and relieved by rest or medication.",
            "chineseTranslation": "心绞痛",
            "traditionalChineseTranslation": "心絞痛",
            "lesson": 4
        },
        {
            "word": "heart failure",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a condition in which the heart is unable to pump sufficiently to maintain blood flow to meet the body's needs",
            "explanation": "Heart failure can result from a variety of conditions, including coronary artery disease, high blood pressure, and other heart conditions. It can lead to a buildup of fluid in the lungs and other tissues, causing symptoms such as shortness of breath, fatigue, and fluid retention.",
            "chineseTranslation": "心力衰竭",
            "traditionalChineseTranslation": "心力衰竭",
            "lesson": 4
        },
        {
            "word": "cardiac arrest",
            "prefix": "cardi-",
            "root": "ac",
            "suffix": "",
            "meaning": "a sudden stop in effective blood circulation due to the failure of the heart to contract effectively",
            "explanation": "Cardiac arrest occurs when the heart suddenly stops beating and can't pump blood to the rest of the body, leading to a loss of consciousness and, if not treated immediately, can result in death.",
            "chineseTranslation": "心脏骤停",
            "traditionalChineseTranslation": "心臟驟停",
            "lesson": 4
        },
        {
            "word": "palpitation",
            "prefix": "",
            "root": "palpit-",
            "suffix": "-ation",
            "meaning": "a noticeably rapid, strong, or irregular heartbeat",
            "explanation": "Palpitation refers to the feeling of having a fast-beating, fluttering, or pounding heart. It can occur due to various factors, including anxiety, stress, caffeine, exercise, or underlying medical conditions.",
            "chineseTranslation": "心悸",
            "traditionalChineseTranslation": "心悸",
            "lesson": 4
        },
        {
            "word": "arrhythmia",
            "prefix": "a-",
            "root": "rhythm",
            "suffix": "-ia",
            "meaning": "an irregular heartbeat",
            "explanation": "Arrhythmia is a condition in which the heart beats with an irregular or abnormal rhythm. This can lead to various symptoms and may require medical intervention.",
            "chineseTranslation": "心律失常",
            "traditionalChineseTranslation": "心律失常",
            "lesson": 4
        },
        {
            "word": "arteriosclerosis",
            "prefix": "arterio-",
            "root": "sclerosis",
            "suffix": "",
            "meaning": "hardening of the arteries",
            "explanation": "Arteriosclerosis refers to the thickening and hardening of the walls of the arteries, which can lead to reduced blood flow and various cardiovascular problems.",
            "chineseTranslation": "动脉硬化",
            "traditionalChineseTranslation": "動脈硬化",
            "lesson": 4
        },
        {
            "word": "hypotension",
            "prefix": "hypo-",
            "root": "tens",
            "suffix": "-ion",
            "meaning": "abnormally low blood pressure",
            "explanation": "Hypotension refers to a condition where a person's blood pressure is lower than what is considered normal, which can lead to symptoms such as dizziness or fainting.",
            "chineseTranslation": "低血压",
            "traditionalChineseTranslation": "低血壓",
            "lesson": 4
        },
        {
            "word": "coronary artery disease",
            "prefix": "",
            "root": "coronary artery",
            "suffix": "disease",
            "meaning": "A condition characterized by the narrowing or blockage of the coronary arteries, often due to atherosclerosis, leading to reduced blood flow to the heart muscle.",
            "explanation": "Coronary artery disease (CAD) is a common heart condition that can result in chest pain (angina) or heart attacks. It is typically caused by the buildup of plaque in the coronary arteries, which supply blood to the heart. Risk factors include high cholesterol, hypertension, smoking, and diabetes.",
            "chineseTranslation": "冠状动脉疾病",
            "traditionalChineseTranslation": "冠狀動脈疾病",
            "lesson": 4
        },
        {
            "word": "thrombolytic therapy",
            "prefix": "",
            "root": "thrombo- (clot) + lytic (breaking down)",
            "suffix": "therapy",
            "meaning": "a treatment that dissolves blood clots",
            "explanation": "Thrombolytic therapy is a medical treatment that aims to break down and dissolve blood clots that have formed in blood vessels, often used in cases of heart attacks or strokes.",
            "chineseTranslation": "溶栓治疗",
            "traditionalChineseTranslation": "溶栓治療",
            "lesson": 4
        },
        {
            "word": "bypass",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A surgical procedure to create an alternative pathway for blood flow or to redirect a bodily fluid around an obstruction.",
            "explanation": "Bypass is often used in the context of cardiovascular surgery where blood flow is rerouted around a blocked artery, but it can also refer to similar procedures in other systems of the body.",
            "chineseTranslation": "旁路手术",
            "traditionalChineseTranslation": "旁路手術",
            "lesson": 4
        },
        {
            "word": "stent",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a device used to keep a passageway open, commonly used in arteries",
            "explanation": "A stent is a small, tube-like structure that is placed in the body to help keep a passage open and assist in maintaining the flow of fluids, such as blood in blood vessels or bile in the bile ducts. They are often used in procedures related to coronary artery disease.",
            "chineseTranslation": "支架",
            "traditionalChineseTranslation": "支架",
            "lesson": 4
        },
        {
            "word": "cardiac catheterization",
            "prefix": "cardi-",
            "root": "catheter",
            "suffix": "-ization",
            "meaning": "A medical procedure used to diagnose and treat certain cardiovascular conditions by inserting a thin tube (catheter) into the heart through a blood vessel.",
            "explanation": "Cardiac catheterization allows doctors to determine how well the heart is functioning and to detect abnormalities in the coronary arteries. The catheter can also be used to perform interventions such as angioplasty.",
            "chineseTranslation": "心导管插入术",
            "traditionalChineseTranslation": "心導管插入術",
            "lesson": 4
        },
        {
            "word": "intravenous",
            "prefix": "intra-",
            "root": "ven",
            "suffix": "-ous",
            "meaning": "pertaining to within a vein",
            "explanation": "The term intravenous is used to describe the administration of substances directly into the bloodstream through a vein, typically for hydration, medication, or nutrition delivery.",
            "chineseTranslation": "静脉内的",
            "traditionalChineseTranslation": "靜脈內的",
            "lesson": 4
        },
        {
            "word": "beta-blocker",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A class of medication that blocks the effects of adrenaline on beta-adrenergic receptors, leading to a decrease in heart rate and blood pressure.",
            "explanation": "Beta-blockers are primarily used to manage abnormal heart rhythms, protect the heart after a heart attack, and treat high blood pressure.",
            "chineseTranslation": "β-阻滯劑",
            "traditionalChineseTranslation": "β-阻滯劑",
            "lesson": 4
        },
        {
            "word": "metoprolol",
            "prefix": "meta-",
            "root": "prolol",
            "suffix": "",
            "meaning": "A medication used to treat high blood pressure and heart-related conditions.",
            "explanation": "Metoprolol is a selective beta-1 adrenergic receptor blocker that decreases heart rate and blood pressure by blocking the effects of adrenaline on the heart.",
            "chineseTranslation": "美托洛尔",
            "traditionalChineseTranslation": "美托洛爾",
            "lesson": 4
        },
        {
            "word": "inderal",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A medication used to treat high blood pressure, anxiety, and certain types of tremors.",
            "explanation": "Inderal is a brand name for propranolol, a non-selective beta-blocker that works by blocking the action of certain natural substances in the body on the heart and blood vessels.",
            "chineseTranslation": "心得安",
            "traditionalChineseTranslation": "心得安",
            "lesson": 4
        },
        {
            "word": "lipoprotein",
            "prefix": "lipo-",
            "root": "protein",
            "suffix": "",
            "meaning": "A complex of lipids and proteins that transport fats in the bloodstream.",
            "explanation": "Lipoproteins are essential for the transport of lipids (fats) through the aqueous environment of the blood. They are categorized based on their density, and include low-density lipoproteins (LDL) and high-density lipoproteins (HDL).",
            "chineseTranslation": "脂蛋白",
            "traditionalChineseTranslation": "脂蛋白",
            "lesson": 4
        },
        {
            "word": "antilipidemic",
            "prefix": "anti-",
            "root": "lipid",
            "suffix": "-emic",
            "meaning": "A drug or substance that reduces levels of lipids in the blood.",
            "explanation": "Antilipidemic agents are used primarily to lower cholesterol and triglyceride levels in the bloodstream, thereby reducing the risk of cardiovascular diseases.",
            "chineseTranslation": "抗脂肪的",
            "traditionalChineseTranslation": "抗脂肪的",
            "lesson": 4
        },
        {
            "word": "diuretic",
            "prefix": "di-",
            "root": "uret",
            "suffix": "-ic",
            "meaning": "A substance that promotes the production of urine.",
            "explanation": "Diuretics are commonly used in medicine to help reduce blood pressure and remove excess fluid from the body through increased urination.",
            "chineseTranslation": "利尿剂",
            "traditionalChineseTranslation": "利尿劑",
            "lesson": 4
        },
        {
            "word": "echocardiography",
            "prefix": "echo-",
            "root": "cardio-",
            "suffix": "-graphy",
            "meaning": "a diagnostic procedure that uses ultrasound to visualize the heart's structure and function",
            "explanation": "Echocardiography allows doctors to see the heart in real-time, helping to diagnose various heart conditions such as valve problems, heart failure, and congenital heart defects.",
            "chineseTranslation": "超声心动图",
            "traditionalChineseTranslation": "超聲心動圖",
            "lesson": 4
        },
        {
            "word": "electrocardiography",
            "prefix": "electro-",
            "root": "cardio",
            "suffix": "-graphy",
            "meaning": "the process of recording the electrical activity of the heart over a period of time",
            "explanation": "Electrocardiography is a medical diagnostic tool that records the electrical signals of the heart to assess its rhythm, size, and overall function. It is commonly used to detect abnormalities in heart activity and diagnose conditions such as arrhythmias, heart attacks, and other cardiac issues.",
            "chineseTranslation": "心电图",
            "traditionalChineseTranslation": "心電圖",
            "lesson": 4
        },
        {
            "word": "holter monitor",
            "prefix": "",
            "root": "holter",
            "suffix": "monitor",
            "meaning": "A portable device that continuously records the heart's rhythms for 24 hours or more.",
            "explanation": "Holter monitors are often used to detect irregular heartbeats and other cardiac conditions by providing a comprehensive view of a patient's heart activity over an extended period.",
            "chineseTranslation": "霍尔特监测仪",
            "traditionalChineseTranslation": "霍爾特監測儀",
            "lesson": 4
        },
        {
            "word": "stethoscope",
            "prefix": "",
            "root": "stetho",
            "suffix": "scope",
            "meaning": "An instrument used for listening to internal body sounds, typically the heart and lungs.",
            "explanation": "A stethoscope amplifies sounds made by the heart, lungs, and other organs, allowing healthcare providers to assess patients' health.",
            "chineseTranslation": "听诊器",
            "traditionalChineseTranslation": "聽診器",
            "lesson": 4
        },
        {
            "word": "auscultation",
            "prefix": "aus-",
            "root": "cult",
            "suffix": "-ation",
            "meaning": "The act of listening to internal body sounds, typically using a stethoscope.",
            "explanation": "Auscultation is a clinical examination method used by healthcare providers to assess the condition of a patient's heart, lungs, and other organs by listening to sounds produced within the body.",
            "chineseTranslation": "听诊",
            "traditionalChineseTranslation": "聽診",
            "lesson": 4
        },
        {
            "word": "cardiopulmonary resuscitation (CPR)",
            "prefix": "cardio-",
            "root": "pulmon-",
            "suffix": "-ation",
            "meaning": "a life-saving procedure used when someone's heart stops beating or they stop breathing, aiming to restore circulation and breathing.",
            "explanation": "CPR involves chest compressions and rescue breaths to maintain blood flow and oxygenation to preserve brain function until further measures can be taken.",
            "chineseTranslation": "心肺复苏",
            "traditionalChineseTranslation": "心肺復甦",
            "lesson": 4
        },
        {
            "word": "defibrillation",
            "prefix": "de-",
            "root": "fibrill",
            "suffix": "-ation",
            "meaning": "the restoration of a normal heartbeat by delivering an electric shock to the heart.",
            "explanation": "Defibrillation is a medical procedure used to treat life-threatening cardiac dysrhythmias, specifically ventricular fibrillation and pulseless ventricular tachycardia. It involves the use of a defibrillator to deliver a dose of electric current to the heart, which can help re-establish an effective rhythm.",
            "chineseTranslation": "去颤",
            "traditionalChineseTranslation": "去顫",
            "lesson": 4
        },
        {
            "word": "hemorrhoid",
            "prefix": "hem-",
            "root": "rrhoid",
            "suffix": "",
            "meaning": "Swollen veins in the lower rectum and anus that can cause discomfort and bleeding.",
            "explanation": "Hemorrhoids occur when the blood vessels in the rectal area become engorged and swollen, often resulting in pain, itching, and bleeding during bowel movements.",
            "chineseTranslation": "痔疮",
            "traditionalChineseTranslation": "痔瘡",
            "lesson": 4
        },
        {
            "word": "albumin",
            "prefix": "",
            "root": "albumin",
            "suffix": "",
            "meaning": "A type of protein found in blood plasma and in other bodily fluids.",
            "explanation": "Albumin helps maintain oncotic pressure in the blood and transports various substances including hormones, vitamins, and drugs.",
            "chineseTranslation": "白蛋白",
            "traditionalChineseTranslation": "白蛋白",
            "lesson": 4
        },
        {
            "word": "globulin",
            "prefix": "",
            "root": "globul-",
            "suffix": "-in",
            "meaning": "A group of proteins in blood plasma that play roles in immune function and transporting substances.",
            "explanation": "Globulins are different types of proteins found in blood plasma, and they are involved in various physiological processes such as immune responses and transport of hormones and vitamins.",
            "chineseTranslation": "球蛋白",
            "traditionalChineseTranslation": "球蛋白",
            "lesson": 4
        },
        {
            "word": "fibrinogen",
            "prefix": "fibr-",
            "root": "inogen",
            "suffix": "",
            "meaning": "a glycoprotein that is converted into fibrin in the clotting process",
            "explanation": "Fibrinogen is a blood plasma protein that's essential for blood clot formation. When bleeding occurs, fibrinogen is converted into fibrin by the enzyme thrombin, forming a mesh that helps stop bleeding.",
            "chineseTranslation": "纤维蛋白原",
            "traditionalChineseTranslation": "纖維蛋白原",
            "lesson": 4
        },
        {
            "word": "amino acid",
            "prefix": "amino",
            "root": "acid",
            "suffix": "",
            "meaning": "A simple organic compound containing both a carboxyl (-COOH) and an amino (-NH2) group, which are the building blocks of proteins.",
            "explanation": "Amino acids are organic compounds that serve as the building blocks of proteins. They are essential for the synthesis of enzymes and are vital for many metabolic processes.",
            "chineseTranslation": "氨基酸",
            "traditionalChineseTranslation": "氨基酸",
            "lesson": 4
        },
        {
            "word": "hemoglobin",
            "prefix": "hemo-",
            "root": "globin",
            "suffix": "",
            "meaning": "A protein in red blood cells that carries oxygen throughout the body.",
            "explanation": "Hemoglobin is composed of four subunits, each containing an iron ion that can bind to oxygen. It is the molecule responsible for the red color of blood and plays a crucial role in transporting oxygen from the lungs to other parts of the body, as well as carrying carbon dioxide back to the lungs for exhalation.",
            "chineseTranslation": "血红蛋白",
            "traditionalChineseTranslation": "血紅蛋白",
            "lesson": 4
        },
        {
            "word": "bilirubin",
            "prefix": "",
            "root": "bilirubin",
            "suffix": "",
            "meaning": "a yellow pigment found in bile, produced from the breakdown of red blood cells.",
            "explanation": "Bilirubin is formed when heme is broken down in the body, and it is excreted in bile. Elevated levels can indicate liver problems or hemolysis.",
            "chineseTranslation": "胆红素",
            "traditionalChineseTranslation": "膽紅素",
            "lesson": 4
        },
        {
            "word": "pathogens",
            "prefix": "",
            "root": "pathogen",
            "suffix": "s",
            "meaning": "Microorganisms that cause disease.",
            "explanation": "Pathogens are often bacteria, viruses, fungi, or parasites that can lead to infections and illnesses in a host.",
            "chineseTranslation": "病原体",
            "traditionalChineseTranslation": "病原體",
            "lesson": 4
        },
        {
            "word": "granulocyte",
            "prefix": "granulo-",
            "root": "cyte",
            "suffix": "",
            "meaning": "a type of white blood cell characterized by the presence of granules in its cytoplasm.",
            "explanation": "Granulocytes are a category of white blood cells that play a significant role in the immune response. They include neutrophils, eosinophils, and basophils, all of which contain granules filled with enzymes and proteins that help the body fight infections.",
            "chineseTranslation": "粒细胞",
            "traditionalChineseTranslation": "粒細胞",
            "lesson": 4
        },
        {
            "word": "basophil",
            "prefix": "baso-",
            "root": "phil",
            "suffix": "",
            "meaning": "A type of white blood cell that is involved in allergic responses and inflammation.",
            "explanation": "Basophils are a type of granulocyte (white blood cell) that contain granules filled with histamine and other chemicals and play a vital role in the body's immune response, particularly during allergic reactions.",
            "chineseTranslation": "嗜碱性细胞",
            "traditionalChineseTranslation": "嗜鹼性細胞",
            "lesson": 4
        },
        {
            "word": "eosinophil",
            "prefix": "eosino-",
            "root": "phil",
            "suffix": "",
            "meaning": "a type of white blood cell that becomes active during allergic reactions and infections.",
            "explanation": "Eosinophils are a type of granulocyte, which are white blood cells characterized by their ability to fight off parasites and participate in allergic responses. They stain well with eosin, a red dye, hence the name eosinophil.",
            "chineseTranslation": "嗜酸性粒细胞",
            "traditionalChineseTranslation": "嗜酸性粒細胞",
            "lesson": 4
        },
        {
            "word": "neutrophil",
            "prefix": "neutro-",
            "root": "phil",
            "suffix": "",
            "meaning": "a type of white blood cell that helps fight infections",
            "explanation": "Neutrophils are a key component of the immune system, involved in the inflammatory response and in the defense against pathogens such as bacteria and fungi. They are the most abundant type of white blood cells and are characterized by their ability to engulf and digest microorganisms and debris.",
            "chineseTranslation": "中性粒细胞",
            "traditionalChineseTranslation": "中性粒細胞",
            "lesson": 4
        },
        {
            "word": "agranulocyte",
            "prefix": "a-",
            "root": "granulocyte",
            "suffix": "",
            "meaning": "a type of white blood cell that lacks granules in its cytoplasm",
            "explanation": "Agranulocytes are a category of leukocytes (white blood cells) characterized by the absence of granules in their cytoplasm and include lymphocytes and monocytes. They play crucial roles in the immune response.",
            "chineseTranslation": "无颗粒白血球",
            "traditionalChineseTranslation": "無顆粒白血球",
            "lesson": 4
        },
        {
            "word": "monocyte",
            "prefix": "mono-",
            "root": "cyte",
            "suffix": "",
            "meaning": "a type of white blood cell that has a single nucleus",
            "explanation": "Monocytes are a type of leukocyte (white blood cell) that play a vital role in the immune system by differentiating into macrophages and dendritic cells that help to fight infections.",
            "chineseTranslation": "单核细胞",
            "traditionalChineseTranslation": "單核細胞",
            "lesson": 4
        },
        {
            "word": "lymphocyte",
            "prefix": "lympho-",
            "root": "cyte",
            "suffix": "",
            "meaning": "a type of white blood cell that is part of the immune system",
            "explanation": "Lymphocytes are a subset of leukocytes (white blood cells) that play a central role in the immune response, including the production of antibodies and the destruction of infected or cancerous cells.",
            "chineseTranslation": "淋巴细胞",
            "traditionalChineseTranslation": "淋巴細胞",
            "lesson": 4
        },
        {
            "word": "hematology",
            "prefix": "hema-",
            "root": "logy",
            "suffix": "",
            "meaning": "the study of blood and its disorders",
            "explanation": "Hematology is a branch of medicine concerned with the study of blood, the blood-forming organs, and blood diseases. It involves the diagnosis, treatment, and prevention of blood-related conditions.",
            "chineseTranslation": "血液学",
            "traditionalChineseTranslation": "血液學",
            "lesson": 4
        },
        {
            "word": "hematoma",
            "prefix": "hema-",
            "root": "-toma",
            "suffix": "",
            "meaning": "a localized collection of blood outside of blood vessels, often caused by trauma or injury.",
            "explanation": "Hematomas occur when blood leaks out of damaged vessels and collects in surrounding tissues, leading to swelling and discoloration in the affected area.",
            "chineseTranslation": "血肿",
            "traditionalChineseTranslation": "血腫",
            "lesson": 4
        },
        {
            "word": "hemostasis",
            "prefix": "hemo-",
            "root": "stasis",
            "suffix": "",
            "meaning": "the process that prevents and stops bleeding, or hemorrhage.",
            "explanation": "Hemostasis involves a series of physiological responses that lead to the cessation of blood loss from damaged vessels, which includes the formation of a platelet plug and clotting factors activation.",
            "chineseTranslation": "止血",
            "traditionalChineseTranslation": "止血",
            "lesson": 4
        },
        {
            "word": "stagnation",
            "prefix": "stag-",
            "root": "nation",
            "suffix": "",
            "meaning": "the state of not moving or progressing",
            "explanation": "Stagnation refers to the lack of movement, development, or advancement in a particular context, often in a medical or physiological sense where fluid accumulates in the body or an organ due to lack of circulation.",
            "chineseTranslation": "停滯",
            "traditionalChineseTranslation": "停滯",
            "lesson": 4
        },
        {
            "word": "hemophilia",
            "prefix": "hemo-",
            "root": "philia",
            "suffix": "",
            "meaning": "a disorder in which blood doesn't clot normally due to the lack of sufficient blood-clotting proteins (clotting factors).",
            "explanation": "Individuals with hemophilia tend to bleed excessively after an injury or spontaneously due to the absence or deficiency of specific clotting factors in the blood.",
            "chineseTranslation": "血友病",
            "traditionalChineseTranslation": "血友病",
            "lesson": 4
        },
        {
            "word": "hyperlipidemia",
            "prefix": "hyper-",
            "root": "lipid",
            "suffix": "-emia",
            "meaning": "A medical condition characterized by elevated levels of lipids in the blood.",
            "explanation": "Hyperlipidemia is commonly associated with a higher risk of cardiovascular diseases and can result from genetic factors, poor diet, obesity, or other health conditions.",
            "chineseTranslation": "高脂血症",
            "traditionalChineseTranslation": "高脂血症",
            "lesson": 4
        },
        {
            "word": "septicemia",
            "prefix": "septo-",
            "root": "aemia",
            "suffix": "",
            "meaning": "a serious bloodstream infection caused by bacteria",
            "explanation": "Septicemia, also known as blood poisoning, occurs when an infection in the body enters the bloodstream, leading to systemic inflammation and potentially resulting in septic shock.",
            "chineseTranslation": "败血症",
            "traditionalChineseTranslation": "敗血症",
            "lesson": 4
        },
        {
            "word": "anemia",
            "prefix": "a-",
            "root": "nemia",
            "suffix": "",
            "meaning": "A condition characterized by a deficiency of red blood cells or hemoglobin in the blood.",
            "explanation": "Anemia leads to reduced oxygen transport in the body, causing fatigue, weakness, and various other health issues. It can be caused by factors such as nutritional deficiencies, chronic diseases, or genetic disorders.",
            "chineseTranslation": "贫血",
            "traditionalChineseTranslation": "貧血",
            "lesson": 4
        },
        {
            "word": "7:52",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "",
            "explanation": "",
            "chineseTranslation": "",
            "traditionalChineseTranslation": "",
            "lesson": 4
        },
        {
            "word": "leukemia",
            "prefix": "leuko-",
            "root": "emia",
            "suffix": "",
            "meaning": "A type of cancer that affects the blood and bone marrow.",
            "explanation": "Leukemia is characterized by an increase in the number of immature white blood cells, which interfere with the production of normal blood cells.",
            "chineseTranslation": "白血病",
            "traditionalChineseTranslation": "白血病",
            "lesson": 4
        },
        {
            "word": "iron-deficiency anemia",
            "prefix": "iron-",
            "root": "deficiency",
            "suffix": "anemia",
            "meaning": "A condition characterized by a lack of adequate iron in the body, leading to reduced hemoglobin production and decreased oxygen delivery to tissues.",
            "explanation": "Iron-deficiency anemia occurs when the body's iron stores are insufficient to produce hemoglobin for red blood cells, often resulting in fatigue and weakness.",
            "chineseTranslation": "缺铁性贫血",
            "traditionalChineseTranslation": "缺鐵性貧血",
            "lesson": 4
        },
        {
            "word": "complete blood count (CBC)",
            "prefix": "",
            "root": "count",
            "suffix": "",
            "meaning": "A blood test that provides information about the cells in a person's blood, including red blood cells, white blood cells, and platelets.",
            "explanation": "A complete blood count (CBC) measures various components of blood and is commonly used to assess overall health and detect a variety of disorders, such as anemia, infection, and leukemia.",
            "chineseTranslation": "全血细胞计数",
            "traditionalChineseTranslation": "全血細胞計數",
            "lesson": 4
        },
        {
            "word": "erythrocyte sedimentation rate (ESR)",
            "prefix": "",
            "root": "erythrocyte",
            "suffix": "sedimentation rate",
            "meaning": "a blood test that measures how quickly red blood cells settle at the bottom of a test tube; used to detect inflammation in the body",
            "explanation": "The erythrocyte sedimentation rate (ESR) test is often a non-specific indicator of inflammation. It measures the rate at which red blood cells (erythrocytes) fall to the bottom of a vertical tube of blood over a specified period. The rate at which the sedimentation occurs can help determine the presence of inflammatory conditions or diseases in the body.",
            "chineseTranslation": "红细胞沉降率",
            "traditionalChineseTranslation": "紅細胞沉降率",
            "lesson": 4
        },
        {
            "word": "phlebotomy",
            "prefix": "phlebo-",
            "root": "tom",
            "suffix": "-y",
            "meaning": "the practice of making an incision in a vein to draw blood",
            "explanation": "Phlebotomy is a medical procedure used to collect blood from patients for tests, transfusions, or donations. It involves puncturing a vein, usually in the arm, with a needle to obtain blood samples.",
            "chineseTranslation": "静脉切开术",
            "traditionalChineseTranslation": "靜脈切開術",
            "lesson": 4
        },
        {
            "word": "bone marrow transplant",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A medical procedure in which bone marrow is replaced by healthy stem cells, often used to treat certain cancers and blood disorders.",
            "explanation": "Bone marrow transplant involves harvesting stem cells from a donor or the patient's own body and infusing them into the bloodstream after the patient has undergone treatments (like chemotherapy) to destroy their diseased bone marrow.",
            "chineseTranslation": "骨髓移植",
            "traditionalChineseTranslation": "骨髓移植",
            "lesson": 4
        },
        {
            "word": "anticoagulant",
            "prefix": "anti-",
            "root": "coagul",
            "suffix": "-ant",
            "meaning": "a substance that prevents blood coagulation",
            "explanation": "Anticoagulants are medications that decrease the blood's ability to clot, used in the treatment or prevention of thrombosis or embolism.",
            "chineseTranslation": "抗凝剂",
            "traditionalChineseTranslation": "抗凝劑",
            "lesson": 4
        },
        {
            "word": "lymph nodes",
            "prefix": "",
            "root": "lymph",
            "suffix": "nodes",
            "meaning": "small, bean-shaped structures that are part of the lymphatic system, helping to filter lymph fluid and support the immune system.",
            "explanation": "Lymph nodes act as filters for harmful substances and contain immune cells that can help fight infections. They are distributed throughout the body, particularly in areas such as the neck, armpits, and groin.",
            "chineseTranslation": "淋巴结",
            "traditionalChineseTranslation": "淋巴結",
            "lesson": 4
        },
        {
            "word": "lymphatic vessels",
            "prefix": "lymph-",
            "root": "vessel",
            "suffix": "",
            "meaning": "Tubes that carry lymph fluid throughout the body.",
            "explanation": "Lymphatic vessels are a network of small tubes that transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. They are an essential part of the lymphatic system, which helps maintain fluid balance and plays a crucial role in immune function.",
            "chineseTranslation": "淋巴管",
            "traditionalChineseTranslation": "淋巴管",
            "lesson": 4
        },
        {
            "word": "spleen",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A highly vascularized organ involved in filtering blood, producing lymphocytes, and storing blood cells, located in the upper left abdomen.",
            "explanation": "The spleen plays a crucial role in the immune system and blood filtration. It helps remove old or damaged red blood cells and produces white blood cells to fight infection.",
            "chineseTranslation": "脾脏",
            "traditionalChineseTranslation": "脾臟",
            "lesson": 4
        },
        {
            "word": "tonsils",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Lymphoid tissues located at the back of the throat that help fight infections.",
            "explanation": "Tonsils are part of the lymphatic system and play a role in immune defense. They help trap pathogens that enter the body through the mouth or nose.",
            "chineseTranslation": "扁桃体",
            "traditionalChineseTranslation": "扁桃體",
            "lesson": 4
        },
        {
            "word": "thymus gland",
            "prefix": "",
            "root": "thymus",
            "suffix": "",
            "meaning": "A gland located in the upper chest that plays a role in the development of the immune system, particularly in the maturation of T-cells.",
            "explanation": "The thymus gland is crucial in the immune system as it produces hormones that stimulate the growth and differentiation of T-cells, which are important for immune responses.",
            "chineseTranslation": "胸腺腺",
            "traditionalChineseTranslation": "胸腺腺",
            "lesson": 4
        },
        {
            "word": "lacteals",
            "prefix": "",
            "root": "lact-",
            "suffix": "-eals",
            "meaning": "small lymphatic vessels that transport chyle, which is rich in fats, from the intestine.",
            "explanation": "Lacteals are specialized lymphatic vessels located in the lining of the small intestine. They play a crucial role in the absorption and transport of fatty acids and other lipids from the digestive tract to the bloodstream.",
            "chineseTranslation": "乳管",
            "traditionalChineseTranslation": "乳管",
            "lesson": 4
        },
        {
            "word": "phagocytic macrophages",
            "prefix": "phago-",
            "root": "cyt",
            "suffix": "",
            "meaning": "A type of immune cell that engulfs and digests foreign particles, bacteria, and dead cells.",
            "explanation": "Phagocytic macrophages are large white blood cells that are part of the immune system. They are responsible for detecting, engulfing, and destroying pathogens and cellular debris through a process called phagocytosis.",
            "chineseTranslation": "吞噬性巨噬细胞",
            "traditionalChineseTranslation": "吞噬性巨噬細胞",
            "lesson": 4
        },
        {
            "word": "cellular immunity",
            "prefix": "",
            "root": "cellul- (from cell)",
            "suffix": "-arity",
            "meaning": "the immune response that involves the activation of immune cells to fight pathogens, rather than antibodies",
            "explanation": "Cellular immunity is a crucial part of the immune system that uses T cells and other immune cells to respond to pathogens. It is distinct from humoral immunity, which uses antibodies.",
            "chineseTranslation": "细胞免疫",
            "traditionalChineseTranslation": "細胞免疫",
            "lesson": 4
        },
        {
            "word": "humoral immunity",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The aspect of immunity that is mediated by antibodies produced by B cells, which are found in bodily fluids (humors), as opposed to cell-mediated immunity.",
            "explanation": "Humoral immunity involves the production of antibodies by B lymphocytes (B cells) in response to antigens, which circulate in the body's fluids to identify and neutralize pathogens.",
            "chineseTranslation": "体液免疫",
            "traditionalChineseTranslation": "體液免疫",
            "lesson": 4
        },
        {
            "word": "placenta",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the organ that develops in the uterus during pregnancy, providing nutrients and oxygen to the growing fetus and removing waste products",
            "explanation": "The placenta serves as a lifeline between the mother and the fetus, facilitating the exchange of substances and supporting fetal development.",
            "chineseTranslation": "胎盘",
            "traditionalChineseTranslation": "胎盤",
            "lesson": 4
        },
        {
            "word": "antitoxin injections",
            "prefix": "anti-",
            "root": "toxin",
            "suffix": "",
            "meaning": "injections that contain antibodies to neutralize toxins in the body",
            "explanation": "Antitoxin injections are used to provide passive immunity against certain toxins by introducing antibodies that can neutralize these harmful substances and help the body fight infections caused by them.",
            "chineseTranslation": "抗毒素注射",
            "traditionalChineseTranslation": "抗毒素注射",
            "lesson": 4
        },
        {
            "word": "macrophages",
            "prefix": "macro-",
            "root": "phag",
            "suffix": "-es",
            "meaning": "large immune cells that engulf and digest cellular debris and pathogens",
            "explanation": "Macrophages are a type of white blood cell that plays a crucial role in the immune system by identifying, engulfing, and destroying pathogens and dead cells in the body. They are derived from monocytes and are found in virtually all body tissues.",
            "chineseTranslation": "巨噬细胞",
            "traditionalChineseTranslation": "巨噬細胞",
            "lesson": 4
        },
        {
            "word": "nosocomial infection",
            "prefix": "noso-",
            "root": "comis",
            "suffix": "ial",
            "meaning": "an infection acquired in a hospital or healthcare facility",
            "explanation": "Nosocomial infections are infections that patients acquire while receiving treatment for medical or surgical conditions in hospitals or other healthcare settings. These infections can occur due to various bacteria, viruses, or fungi and can complicate recovery.",
            "chineseTranslation": "院内感染",
            "traditionalChineseTranslation": "院內感染",
            "lesson": 4
        },
        {
            "word": "self-inoculation",
            "prefix": "self-",
            "root": "inoculate",
            "suffix": "",
            "meaning": "The process of introducing a pathogen or vaccine into one's own body to provoke an immune response.",
            "explanation": "Self-inoculation is often used in the context of vaccines, where an individual administers a vaccine to themselves to stimulate immunity against a specific disease.",
            "chineseTranslation": "自接种",
            "traditionalChineseTranslation": "自接種",
            "lesson": 4
        },
        {
            "word": "allergen",
            "prefix": "all-",
            "root": "-erg-",
            "suffix": "-en",
            "meaning": "A substance that causes an allergic reaction.",
            "explanation": "Allergens are usually harmless substances like pollen, pet dander, or certain foods that some people's immune systems misidentify as threats, leading to allergic reactions.",
            "chineseTranslation": "过敏原",
            "traditionalChineseTranslation": "過敏原",
            "lesson": 4
        },
        {
            "word": "anaphylactic shock",
            "prefix": "ana-",
            "root": "phylaxis",
            "suffix": "-tic",
            "meaning": "a severe and potentially life-threatening allergic reaction",
            "explanation": "Anaphylactic shock occurs when the immune system has a severe reaction to an allergen, leading to symptoms such as difficulty breathing, swelling, and a drop in blood pressure.",
            "chineseTranslation": "过敏性休克",
            "traditionalChineseTranslation": "過敏性休克",
            "lesson": 4
        },
        {
            "word": "lymphadenitis",
            "prefix": "lymph-",
            "root": "aden-",
            "suffix": "-itis",
            "meaning": "inflammation of the lymph nodes",
            "explanation": "Lymphadenitis is commonly caused by an infection that can spread to the lymph nodes, leading to swelling and discomfort.",
            "chineseTranslation": "淋巴腺炎",
            "traditionalChineseTranslation": "淋巴腺炎",
            "lesson": 4
        },
        {
            "word": "autoimmune disease",
            "prefix": "auto-",
            "root": "immune",
            "suffix": "disease",
            "meaning": "a condition in which the immune system mistakenly attacks the body’s own cells and tissues",
            "explanation": "Autoimmune diseases occur when the immune system fails to recognize the body's own cells as 'self' and starts attacking them, leading to inflammation and damage to tissues and organs.",
            "chineseTranslation": "自身免疫疾病",
            "traditionalChineseTranslation": "自身免疫疾病",
            "lesson": 4
        },
        {
            "word": "antihistamine",
            "prefix": "anti-",
            "root": "histamine",
            "suffix": "",
            "meaning": "A drug that inhibits the action of histamine, often used to relieve allergy symptoms.",
            "explanation": "Antihistamines block the effects of histamine, a substance in the body that causes allergic symptoms. They are commonly used to treat allergies, hay fever, and cold symptoms.",
            "chineseTranslation": "抗組胺藥",
            "traditionalChineseTranslation": "抗組胺藥",
            "lesson": 4
        },
        {
            "word": "immunoglobulin",
            "prefix": "immuno-",
            "root": "globulin",
            "suffix": "",
            "meaning": "A type of antibody found in the blood and other bodily fluids that helps to identify and neutralize pathogens such as bacteria and viruses.",
            "explanation": "Immunoglobulins are produced by plasma cells and are crucial for the immune response. They can bind to specific antigens, leading to their destruction or neutralization.",
            "chineseTranslation": "免疫球蛋白",
            "traditionalChineseTranslation": "免疫球蛋白",
            "lesson": 4
        }
    ]
}