{
    "version": "0.0.1",
    "words": [
        {
            "word": "inhale",
            "prefix": "in-",
            "root": "hale",
            "suffix": "",
            "meaning": "to breathe in air or other substances into the lungs",
            "explanation": "Inhale refers to the action of drawing air into the lungs through the nose or mouth, which is a fundamental aspect of breathing.",
            "chineseTranslation": "吸入",
            "traditionalChineseTranslation": "吸入",
            "lesson": 5
        },
        {
            "word": "exhale",
            "prefix": "ex-",
            "root": "hale",
            "suffix": "",
            "meaning": "to breathe out",
            "explanation": "Exhale refers to the process of breathing out air from the lungs. It is the opposite of inhalation, where air is drawn into the lungs.",
            "chineseTranslation": "呼气",
            "traditionalChineseTranslation": "呼氣",
            "lesson": 5
        },
        {
            "word": "alveoli",
            "prefix": "",
            "root": "alveol",
            "suffix": "i",
            "meaning": "small air sacs in the lungs where gas exchange occurs.",
            "explanation": "Alveoli are the tiny, balloon-like structures in the lungs that allow for the exchange of oxygen and carbon dioxide during the breathing process. They are surrounded by capillaries which facilitate this exchange.",
            "chineseTranslation": "肺泡",
            "traditionalChineseTranslation": "肺泡",
            "lesson": 5
        },
        {
            "word": "nasal cavity",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The hollow space within the nose that filters, warms, and moistens air; it is involved in the sense of smell.",
            "explanation": "The nasal cavity is lined with mucous membranes and is divided into two nostrils; it plays a significant role in respiration and olfaction (sense of smell).",
            "chineseTranslation": "鼻腔",
            "traditionalChineseTranslation": "鼻腔",
            "lesson": 5
        },
        {
            "word": "pharynx",
            "prefix": "",
            "root": "pharynx",
            "suffix": "",
            "meaning": "the muscular tube that connects the mouth and nasal passages with the esophagus and larynx",
            "explanation": "The pharynx is a part of the digestive and respiratory systems that extends from the back of the mouth to the esophagus and the larynx. It plays a crucial role in swallowing and breathing.",
            "chineseTranslation": "咽",
            "traditionalChineseTranslation": "咽",
            "lesson": 5
        },
        {
            "word": "larynx",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The voice box located in the neck responsible for producing sound and protecting the trachea against food aspiration.",
            "explanation": "The larynx is an organ that houses the vocal cords and is involved in breathing, producing sound, and protecting the trachea against food aspiration. It is situated between the pharynx and the trachea.",
            "chineseTranslation": "喉部",
            "traditionalChineseTranslation": "喉部",
            "lesson": 5
        },
        {
            "word": "trachea",
            "prefix": "",
            "root": "trachea",
            "suffix": "",
            "meaning": "the windpipe; a tube that connects the throat to the lungs",
            "explanation": "The trachea is a vital passageway in the respiratory system that carries air to and from the lungs, allowing for breathing.",
            "chineseTranslation": "气管",
            "traditionalChineseTranslation": "氣管",
            "lesson": 5
        },
        {
            "word": "bronchial tubes",
            "prefix": "bronch-",
            "root": "bronchi",
            "suffix": "al",
            "meaning": "The air passages that lead from the trachea to the lungs.",
            "explanation": "Bronchial tubes are the major air passages that branch from the trachea to the lungs and further split into smaller bronchi and bronchioles, allowing air to reach different parts of the lungs.",
            "chineseTranslation": "支气管",
            "traditionalChineseTranslation": "支氣管",
            "lesson": 5
        },
        {
            "word": "cilia",
            "prefix": "",
            "root": "cil",
            "suffix": "ia",
            "meaning": "hair-like structures that help in the movement of cells or the movement of fluids across the cell surface",
            "explanation": "Cilia are microscopic, hair-like structures on the surface of some cells that beat in coordinated waves to move fluids or to propel the cell itself.",
            "chineseTranslation": "纤毛",
            "traditionalChineseTranslation": "纖毛",
            "lesson": 5
        },
        {
            "word": "nares",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the external openings of the nasal cavity; nostrils",
            "explanation": "Nares are the two nostrils through which air enters and exits the nasal cavity. They play a key role in respiration and the sense of smell.",
            "chineseTranslation": "鼻孔",
            "traditionalChineseTranslation": "鼻孔",
            "lesson": 5
        },
        {
            "word": "palate",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The roof of the mouth separating the cavities of the mouth and nose in vertebrates.",
            "explanation": "The palate is a structure in the mouth that forms the upper boundary of the oral cavity. It consists of two parts: the hard palate, which is bony, and the soft palate, which is muscular and extends toward the rear of the mouth. It plays a key role in swallowing and speech.",
            "chineseTranslation": "上颚",
            "traditionalChineseTranslation": "上顎",
            "lesson": 5
        },
        {
            "word": "paranasal sinuses",
            "prefix": "para-",
            "root": "nasal",
            "suffix": "sinuses",
            "meaning": "air-filled spaces located around the nasal cavity",
            "explanation": "Paranasal sinuses are a group of air-filled spaces in the bones surrounding the nasal cavity that help to lighten the skull, enhance voice resonance, and provide insulation.",
            "chineseTranslation": "鼻旁窦",
            "traditionalChineseTranslation": "鼻旁竇",
            "lesson": 5
        },
        {
            "word": "nasal conchae",
            "prefix": "",
            "root": "nasal/conchae",
            "suffix": "",
            "meaning": "The bony structures within the nasal cavity that help to filter and humidify the air we breathe.",
            "explanation": "Nasal conchae are thin, scroll-like bones located on the lateral walls of the nasal cavity. They increase the surface area of the nasal cavity, aiding in air filtration, humidification, and temperature regulation during respiration.",
            "chineseTranslation": "鼻甲",
            "traditionalChineseTranslation": "鼻甲",
            "lesson": 5
        },
        {
            "word": "olfactory region",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the part of the nasal cavity responsible for the sense of smell.",
            "explanation": "The olfactory region is a specialized area within the nasal cavity where olfactory receptors are located. These receptors detect airborne chemical substances and are integral to the sense of smell, allowing for the identification of different odors.",
            "chineseTranslation": "嗅觉区域",
            "traditionalChineseTranslation": "嗅覺區域",
            "lesson": 5
        },
        {
            "word": "nasopharynx",
            "meaning": "the upper part of the pharynx located behind the nose.",
            "chineseTranslation": "鼻咽",
            "traditionalChineseTranslation": "鼻咽",
            "explanation": "The nasopharynx is the section of the pharynx that lies above the soft palate and connects the nasal cavity with the oropharynx. It plays a role in the respiratory system and is involved in processes such as breathing and equalizing pressure in the ears.",
            "prefix": "naso-",
            "root": "pharynx",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "oropharynx",
            "prefix": "oro-",
            "root": "pharynx",
            "suffix": "",
            "meaning": "The part of the pharynx located behind the mouth.",
            "explanation": "The oropharynx is the middle part of the pharynx that lies behind the oral cavity and extends from the soft palate to the level of the hyoid bone. It plays a crucial role in the digestive and respiratory systems.",
            "chineseTranslation": "口咽",
            "traditionalChineseTranslation": "口咽",
            "lesson": 5
        },
        {
            "word": "laryngopharynx",
            "prefix": "",
            "root": "laryng/phil/ pharynx",
            "suffix": "",
            "meaning": "The lower part of the pharynx that opens into the larynx and esophagus.",
            "explanation": "The laryngopharynx is the section of the pharynx located behind the larynx (voice box) that serves as a passageway for both air and food, leading into the larynx and esophagus. It plays a critical role in the respiratory and digestive systems.",
            "chineseTranslation": "喉咽",
            "traditionalChineseTranslation": "喉嚨",
            "lesson": 5
        },
        {
            "word": "pharyngeal tonsils",
            "prefix": "pharyng-",
            "root": "tonsil",
            "suffix": "",
            "meaning": "a mass of lymphoid tissue located in the roof of the nasopharynx, commonly known as adenoids.",
            "explanation": "Pharyngeal tonsils are part of the immune system and help to protect against infections. They are situated at the back of the nasal cavity.",
            "chineseTranslation": "咽扁桃体",
            "traditionalChineseTranslation": "咽扁桃體",
            "lesson": 5
        },
        {
            "word": "palatine tonsils",
            "prefix": "",
            "root": "tonsil",
            "suffix": "",
            "meaning": "The two oval-shaped masses of lymphoid tissue located at the back of the throat, which play a role in the immune system.",
            "explanation": "Palatine tonsils are part of the body's lymphatic system. They help to protect against infection by trapping pathogens that enter the body via the mouth or nose. They are commonly referred to simply as 'tonsils'.",
            "chineseTranslation": "腭扁桃体",
            "traditionalChineseTranslation": "腭扁桃腺",
            "lesson": 5
        },
        {
            "word": "lingual tonsils",
            "prefix": "",
            "root": "lingual",
            "suffix": "",
            "meaning": "the tonsils located at the base of the tongue",
            "explanation": "Lingual tonsils are a collection of lymphoid tissues located at the back of the tongue, part of the immune system that helps protect against pathogens entering through the oral cavity.",
            "chineseTranslation": "舌扁桃体",
            "traditionalChineseTranslation": "舌扁桃體",
            "lesson": 5
        },
        {
            "word": "auditory tube",
            "prefix": "",
            "root": "auditory",
            "suffix": "",
            "meaning": "a canal that connects the middle ear to the nasopharynx, helping to equalize air pressure on either side of the eardrum",
            "explanation": "The auditory tube, also known as the Eustachian tube, plays a crucial role in maintaining the balance of air pressure in the ear, which is essential for proper hearing. It opens during swallowing or yawning to equalize pressure and drain mucus from the middle ear.",
            "chineseTranslation": "耳管",
            "traditionalChineseTranslation": "耳管",
            "lesson": 5
        },
        {
            "word": "thyroid cartilage",
            "prefix": "",
            "root": "thyroid",
            "suffix": "cartilage",
            "meaning": "The largest cartilage of the larynx, which forms the Adam's apple.",
            "explanation": "The thyroid cartilage is a shield-shaped structure that is part of the laryngeal framework and is crucial for protecting the vocal cords.",
            "chineseTranslation": "甲状软骨",
            "traditionalChineseTranslation": "甲狀軟骨",
            "lesson": 5
        },
        {
            "word": "vocal cords",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the folds of tissue in the larynx that vibrate to produce sound",
            "explanation": "Vocal cords, also known as vocal folds, are a pair of muscle-controlled folds in the larynx (voice box). When air passes through the larynx, the vocal cords vibrate, producing sound. They are essential for phonation (the production of voice) and are involved in speech and singing.",
            "chineseTranslation": "声带",
            "traditionalChineseTranslation": "聲帶",
            "lesson": 5
        },
        {
            "word": "glottis",
            "prefix": "",
            "root": "glott-",
            "suffix": "",
            "meaning": "the part of the larynx consisting of the vocal cords and the opening between them",
            "explanation": "The glottis is the vocal apparatus of the larynx. It includes the vocal cords and the space between them, crucial for sound production during speech and vocalization.",
            "chineseTranslation": "声门",
            "traditionalChineseTranslation": "聲門",
            "lesson": 5
        },
        {
            "word": "epiglottis",
            "prefix": "epi-",
            "root": "glottis",
            "suffix": "",
            "meaning": "a flap of tissue that covers the windpipe during swallowing",
            "explanation": "The epiglottis is a leaf-shaped flap of cartilage located behind the tongue at the top of the larynx. During swallowing, it folds down to prevent food and liquid from entering the trachea, directing it into the esophagus instead.",
            "chineseTranslation": "会厌",
            "traditionalChineseTranslation": "會厭",
            "lesson": 5
        },
        {
            "word": "bronchi",
            "prefix": "",
            "root": "bronch-",
            "suffix": "",
            "meaning": "The larger air passages that lead from the trachea to the lungs.",
            "explanation": "Bronchi are the main passageways that branch off from the trachea (windpipe) and direct air into the lungs. There are two primary bronchi—one for each lung—and as they branch further into smaller tubes, they are referred to as bronchioles.",
            "chineseTranslation": "支气管",
            "traditionalChineseTranslation": "支氣管",
            "lesson": 5
        },
        {
            "word": "secondary bronchi",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The air passages that branch off from the primary bronchi and enter the lungs, further dividing into smaller bronchi.",
            "explanation": "Secondary bronchi are the division of the primary bronchi that lead directly into the lobes of the lungs. Each secondary bronchus corresponds to a lobe of the lung: the right lung has three secondary bronchi, while the left lung has two.",
            "chineseTranslation": "次级支气管",
            "traditionalChineseTranslation": "次級支氣管",
            "lesson": 5
        },
        {
            "word": "tertiary bronchi",
            "prefix": "ter-",
            "root": "bronch-",
            "suffix": "-i",
            "meaning": "the third level of branching of the bronchial tubes that leads to the lungs",
            "explanation": "Tertiary bronchi are the smaller air passages that branch off from the secondary bronchi and lead directly into the bronchioles, becoming the pathways that deliver air to the specific lobes of the lungs.",
            "chineseTranslation": "三级支气管",
            "traditionalChineseTranslation": "三級支氣管",
            "lesson": 5
        },
        {
            "word": "bronchioles",
            "prefix": "",
            "root": "bronch",
            "suffix": "-iole",
            "meaning": "Smallest air passages of the lungs that lead to the alveoli.",
            "explanation": "Bronchioles are the smaller branches of the bronchial tree, responsible for conducting air to the alveoli where gas exchange occurs.",
            "chineseTranslation": "细支气管",
            "traditionalChineseTranslation": "細支氣管",
            "lesson": 5
        },
        {
            "word": "pleura",
            "prefix": "",
            "root": "pleura",
            "suffix": "",
            "meaning": "The serous membrane surrounding each lung and lining the thoracic cavity.",
            "explanation": "The pleura consists of two layers: the visceral pleura, which covers the lungs, and the parietal pleura, which lines the thoracic cavity. It plays a key role in facilitating lung movement during breathing and reducing friction between the lungs and the chest wall.",
            "chineseTranslation": "胸膜",
            "traditionalChineseTranslation": "胸膜",
            "lesson": 5
        },
        {
            "word": "lobes",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Regions or subdivisions of an organ, typically with a distinct structure or function.",
            "explanation": "Lobes are often found in various organs such as the brain, lungs, and liver, where they help to organize the functional and anatomical structure.",
            "chineseTranslation": "叶",
            "traditionalChineseTranslation": "葉",
            "lesson": 5
        },
        {
            "word": "hilum",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The indentation or small opening in an organ where blood vessels, nerves, and ducts enter or leave.",
            "explanation": "The hilum is a crucial anatomical feature of many organs, such as the lungs and kidneys, where structures such as blood vessels and nerves enter or exit. It serves as the gateway for essential systems to supply the organ with necessary nutrients and signals.",
            "chineseTranslation": "门",
            "traditionalChineseTranslation": "門",
            "lesson": 5
        },
        {
            "word": "intercostal muscles",
            "meaning": "The muscles located between the ribs that aid in the expansion and contraction of the chest during respiration.",
            "chineseTranslation": "肋間肌",
            "traditionalChineseTranslation": "肋間肌",
            "explanation": "Intercostal muscles play a crucial role in the respiratory process by assisting in the movement of the rib cage.",
            "prefix": "inter-",
            "root": "costal",
            "suffix": "muscles",
            "lesson": 5
        },
        {
            "word": "vital sign",
            "prefix": "",
            "root": "vital",
            "suffix": "sign",
            "meaning": "a measurement of the body's most basic functions, indicating health status.",
            "explanation": "Vital signs are physiological measurements that indicate the state of a person's essential body functions. The most common vital signs include body temperature, pulse rate, respiration rate, and blood pressure.",
            "chineseTranslation": "生命体征",
            "traditionalChineseTranslation": "生命體徵",
            "lesson": 5
        },
        {
            "word": "asphyxia",
            "prefix": "a-",
            "root": "sphyx",
            "suffix": "-ia",
            "meaning": "a condition of severely deficient supply of oxygen to the body that arises from being unable to breathe normally.",
            "explanation": "Asphyxia occurs when the body does not receive enough oxygen, which can be caused by choking, suffocation, or other factors leading to a lack of air.",
            "chineseTranslation": "窒息",
            "traditionalChineseTranslation": "窒息",
            "lesson": 5
        },
        {
            "word": "dyspnea on exertion",
            "prefix": "dys-",
            "root": "pnea",
            "suffix": "",
            "meaning": "shortness of breath during physical activity",
            "explanation": "Dyspnea on exertion refers to difficulty in breathing that occurs during any physical activity. It can be a symptom of various underlying health issues, especially pulmonary or cardiovascular conditions.",
            "chineseTranslation": "运动性呼吸困难",
            "traditionalChineseTranslation": "運動性呼吸困難",
            "lesson": 5
        },
        {
            "word": "ventilator",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A medical device that mechanically assists or controls the process of breathing in patients who are unable to breathe adequately on their own.",
            "explanation": "Ventilators are used in medical settings to provide oxygen to patients when they are incapacitated or during surgery. They can deliver breaths at a set rate or in response to the patient's own breathing efforts.",
            "chineseTranslation": "呼吸机",
            "traditionalChineseTranslation": "呼吸機",
            "lesson": 5
        },
        {
            "word": "bronchiectasis",
            "prefix": "bronchi-",
            "root": "ectasis",
            "suffix": "",
            "meaning": "A condition involving the abnormal dilation of the bronchi.",
            "explanation": "Bronchiectasis is a chronic condition characterized by the permanent enlargement of parts of the airways of the lung. This enlargement can lead to various complications, including recurrent infections, mucus buildup, and breathing difficulties.",
            "chineseTranslation": "支气管扩张症",
            "traditionalChineseTranslation": "支氣管擴張症",
            "lesson": 5
        },
        {
            "word": "chronic obstructive pulmonary disease",
            "meaning": "A progressive lung disease characterized by increasing breathlessness due to airflow obstruction.",
            "chineseTranslation": "慢性阻塞性肺病",
            "traditionalChineseTranslation": "慢性阻塞性肺病",
            "explanation": "Chronic obstructive pulmonary disease (COPD) is a common lung disease that makes it hard to breathe. It is primarily caused by long-term exposure to irritating gases or particulate matter, most often from cigarette smoke. Symptoms include coughing, mucus production, and shortness of breath.",
            "prefix": "chronic",
            "root": "obstruct, pulmonary, disease",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "pneumothorax",
            "prefix": "pneumo-",
            "root": "thorax",
            "suffix": "",
            "meaning": "presence of air in the pleural cavity",
            "explanation": "Pneumothorax occurs when air leaks into the space between the lung and chest wall, which can cause the lung to collapse. It can result from injury, certain medical procedures, or spontaneously without an apparent cause.",
            "chineseTranslation": "气胸",
            "traditionalChineseTranslation": "氣胸",
            "lesson": 5
        },
        {
            "word": "emphysema",
            "meaning": "A lung condition characterized by the destruction of the air sacs (alveoli), leading to difficulty in breathing.",
            "chineseTranslation": "肺气肿",
            "traditionalChineseTranslation": "肺氣腫",
            "explanation": "In emphysema, the alveoli are damaged, resulting in reduced elastic recoil and difficulty in exhaling air from the lungs. This often leads to breathlessness and decreased oxygen intake.",
            "prefix": "em-",
            "root": "physema",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "tuberculosis",
            "prefix": "tuber-",
            "root": "culosis",
            "suffix": "",
            "meaning": "an infectious disease caused by Mycobacterium tuberculosis, primarily affecting the lungs but can also affect other parts of the body.",
            "explanation": "Tuberculosis is a contagious bacterial infection that can spread through the air when a person with the active infection coughs or sneezes. It can cause severe lung damage and other systemic complications if left untreated.",
            "chineseTranslation": "肺結核",
            "traditionalChineseTranslation": "肺結核",
            "lesson": 5
        },
        {
            "word": "pleural effusion",
            "prefix": "",
            "root": "pleur-",
            "suffix": "",
            "meaning": "accumulation of fluid in the pleural space",
            "explanation": "Pleural effusion occurs when excess fluid builds up in the pleural cavity, the space between the two layers of pleura that surround the lungs. This condition can be caused by various factors, including infections, malignancies, or heart failure.",
            "chineseTranslation": "胸腔积液",
            "traditionalChineseTranslation": "胸腔積液",
            "lesson": 5
        },
        {
            "word": "pleurisy",
            "prefix": "",
            "root": "pleur-",
            "suffix": "-isy",
            "meaning": "inflammation of the pleura, the membrane surrounding the lungs",
            "explanation": "Pleurisy is a condition characterized by sharp pain in the chest when breathing or coughing due to inflammation of the pleura. This inflammation can be caused by infections, autoimmune diseases, or other factors.",
            "chineseTranslation": "胸膜炎",
            "traditionalChineseTranslation": "胸膜炎",
            "lesson": 5
        },
        {
            "word": "endotracheal intubation",
            "prefix": "endo-",
            "root": "trachea",
            "suffix": "tion",
            "meaning": "the process of placing a tube into the trachea to maintain an open airway",
            "explanation": "Endotracheal intubation is a medical procedure in which a tube is inserted into the trachea through the mouth or nose to provide ventilation and secure the airway during surgeries or in emergency situations.",
            "chineseTranslation": "气管内插管",
            "traditionalChineseTranslation": "氣管內插管",
            "lesson": 5
        },
        {
            "word": "epistaxis",
            "prefix": "epi-",
            "root": "stax",
            "suffix": "",
            "meaning": "nosebleed",
            "explanation": "Epistaxis refers to the bleeding from the nasal cavity, typically from the nostrils. It can happen due to various factors such as dry air, trauma, or underlying medical conditions.",
            "chineseTranslation": "鼻出血",
            "traditionalChineseTranslation": "鼻出血",
            "lesson": 5
        },
        {
            "word": "hemoptysis",
            "prefix": "hemo-",
            "root": "ptysis",
            "suffix": "",
            "meaning": "coughing up blood",
            "explanation": "Hemoptysis refers to the act of coughing up blood or blood-stained mucus from the respiratory tract, specifically from the lungs or bronchi.",
            "chineseTranslation": "咳血",
            "traditionalChineseTranslation": "咳血",
            "lesson": 5
        },
        {
            "word": "phlegm",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A thick, viscous substance produced by the mucous membranes of the respiratory tract, often associated with respiratory infections or allergies.",
            "explanation": "Phlegm is secreted by the lining of the respiratory system and can accumulate in the airways, leading to coughing and difficulty breathing. It is commonly produced during infections such as the common cold or bronchitis.",
            "chineseTranslation": "痰",
            "traditionalChineseTranslation": "痰",
            "lesson": 5
        },
        {
            "word": "sputum",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A mixture of saliva and mucus coughed up from the respiratory tract.",
            "explanation": "Sputum is often produced in response to an infection or irritation in the airways, and it can be analyzed to diagnose conditions such as pneumonia, bronchitis, and tuberculosis.",
            "chineseTranslation": "痰",
            "traditionalChineseTranslation": "痰",
            "lesson": 5
        },
        {
            "word": "diphtheria",
            "prefix": "",
            "root": "diphther",
            "suffix": "-ia",
            "meaning": "a bacterial infection affecting the mucous membranes, primarily in the throat and nose, characterized by a thick covering in the throat that can lead to difficulty breathing, heart failure, or even death if left untreated.",
            "explanation": "Diphtheria is caused by the bacterium Corynebacterium diphtheriae, which produces a toxin that can lead to tissue damage. It is preventable by vaccination.",
            "chineseTranslation": "白喉",
            "traditionalChineseTranslation": "白喉",
            "lesson": 5
        },
        {
            "word": "pertussis",
            "prefix": "",
            "root": "tussis",
            "suffix": "",
            "meaning": "a highly contagious bacterial infection characterized by severe coughing fits",
            "explanation": "Pertussis, commonly known as whooping cough, is caused by the bacterium Bordetella pertussis. It results in uncontrollable, violent coughing that often makes it hard to breathe, leading to a whooping sound when inhaling. Vaccination can prevent the disease.",
            "chineseTranslation": "百日咳",
            "traditionalChineseTranslation": "百日咳",
            "lesson": 5
        },
        {
            "word": "percussion",
            "meaning": "the act of tapping on a surface to assess for abnormalities",
            "chineseTranslation": "叩诊",
            "traditionalChineseTranslation": "叩診",
            "explanation": "Percussion is a diagnostic technique used by healthcare providers to determine the size, density, and borders of organs or to identify the presence of fluid or air in body cavities. It involves tapping on the body surface to produce sounds that inform the practitioner about the underlying structures.",
            "prefix": "per-",
            "root": "cuss",
            "suffix": "-ion",
            "lesson": 5
        },
        {
            "word": "bronchoscopy",
            "prefix": "bronch-",
            "root": "-scopy",
            "suffix": "",
            "meaning": "A procedure that allows doctors to examine the air passages of the lungs, including the trachea and bronchi.",
            "explanation": "During a bronchoscopy, a thin tube equipped with a camera and light (bronchoscope) is inserted into the airways through the nose or mouth to visualize the lungs and collect samples if needed.",
            "chineseTranslation": "支气管镜检查",
            "traditionalChineseTranslation": "支氣管鏡檢查",
            "lesson": 5
        },
        {
            "word": "tuberculin skin test",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A diagnostic test for tuberculosis where a small amount of tuberculin is injected into the skin to check for a reaction.",
            "explanation": "The test involves intradermal injection of tuberculin, a purifed protein derivative, and observing the skin reaction after 48-72 hours. A positive result indicates potential exposure to the bacteria that cause tuberculosis.",
            "chineseTranslation": "结核菌素皮肤试验",
            "traditionalChineseTranslation": "結核菌素皮膚試驗",
            "lesson": 5
        },
        {
            "word": "antihistamine",
            "prefix": "anti-",
            "root": "histamine",
            "suffix": "",
            "meaning": "A class of drugs that inhibit the action of histamine, used to treat allergic reactions and symptoms.",
            "explanation": "Antihistamines block the effects of histamine, a substance released during allergic reactions, thus alleviating symptoms such as itching, runny nose, and hives.",
            "chineseTranslation": "抗组胺药",
            "traditionalChineseTranslation": "抗組胺藥",
            "lesson": 5
        },
        {
            "word": "antitussive",
            "prefix": "anti-",
            "root": "cough",
            "suffix": "-ive",
            "meaning": "a drug that prevents coughing",
            "explanation": "Antitussives are medications used to suppress the cough reflex, providing relief from persistent coughing.",
            "chineseTranslation": "止咳药",
            "traditionalChineseTranslation": "止咳藥",
            "lesson": 5
        },
        {
            "word": "bronchodilator",
            "prefix": "broncho-",
            "root": "dilat",
            "suffix": "-or",
            "meaning": "a medication that expands the air passages of the lungs",
            "explanation": "Bronchodilators are primarily used to treat conditions such as asthma and chronic obstructive pulmonary disease (COPD) by relaxing the muscles around the airways and allowing them to widen, making breathing easier.",
            "chineseTranslation": "支气管扩张剂",
            "traditionalChineseTranslation": "支氣管擴張劑",
            "lesson": 5
        },
        {
            "word": "expectorant",
            "prefix": "ex-",
            "root": "pector",
            "suffix": "-ant",
            "meaning": "a medication that helps to clear mucus from the airways by promoting coughing",
            "explanation": "Expectorants work by thinning mucus and making it easier to expel from the respiratory tract, thus aiding in relief from coughs associated with colds or respiratory infections.",
            "chineseTranslation": "祛痰药",
            "traditionalChineseTranslation": "祛痰藥",
            "lesson": 5
        },
        {
            "word": "salivary gland",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a gland that produces saliva",
            "explanation": "Salivary glands are exocrine glands located in the mouth that secrete saliva to aid in digestion and keep the mouth moist.",
            "chineseTranslation": "唾液腺",
            "traditionalChineseTranslation": "唾液腺",
            "lesson": 5
        },
        {
            "word": "taste bud",
            "meaning": "A sensory structure in the mouth that detects taste.",
            "chineseTranslation": "味蕾",
            "traditionalChineseTranslation": "味蕾",
            "explanation": "Taste buds are located on the tongue and other parts of the oral cavity and are responsible for the perception of taste, identifying sweet, sour, salty, bitter, and umami flavors.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "uvula",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the small, fleshy piece of tissue that hangs at the back of the throat.",
            "explanation": "The uvula plays a role in speech and helps in the swallowing process by preventing food from entering the nasal cavity.",
            "chineseTranslation": "悬雍垂",
            "traditionalChineseTranslation": "懸雍垂",
            "lesson": 5
        },
        {
            "word": "gag reflex",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a reflex contraction of the throat muscles that one experiences when the back of the throat is touched or stimulated, which helps to prevent choking.",
            "explanation": "The gag reflex serves as a protective mechanism to prevent obstruction of the airway by foreign objects, and it can be triggered by various stimuli, including touch and strong odors.",
            "chineseTranslation": "呕吐反射",
            "traditionalChineseTranslation": "嘔吐反射",
            "lesson": 5
        },
        {
            "word": "mucous membrane",
            "meaning": "A protective layer of tissue that lines various cavities and structures in the body, secreting mucus to keep them moist and facilitate absorption and secretion.",
            "chineseTranslation": "粘膜",
            "traditionalChineseTranslation": "黏膜",
            "explanation": "Mucous membranes are found in areas such as the mouth, nose, and respiratory tract, providing a barrier to pathogens while allowing for secretion and absorption.",
            "prefix": "",
            "root": "mucous",
            "suffix": "membrane",
            "lesson": 5
        },
        {
            "word": "dentin",
            "prefix": "",
            "root": "dent",
            "suffix": "",
            "meaning": "The dense, bony tissue forming the bulk of a tooth beneath the enamel.",
            "explanation": "Dentin is a hard tissue that makes up the majority of a tooth's structure. It is less mineralized than enamel but is still quite strong and serves as a protective layer for the pulp chamber and nerves inside the tooth.",
            "chineseTranslation": "牙本质",
            "traditionalChineseTranslation": "牙本質",
            "lesson": 5
        },
        {
            "word": "enamel",
            "prefix": "e-",
            "root": "namel",
            "suffix": "",
            "meaning": "the hard, outer surface of a tooth",
            "explanation": "Enamel is the hardest substance in the human body and serves to protect teeth from decay and damage.",
            "chineseTranslation": "牙釉質",
            "traditionalChineseTranslation": "牙釉質",
            "lesson": 5
        },
        {
            "word": "pulp cavity",
            "prefix": "",
            "root": "pulp",
            "suffix": "cavity",
            "meaning": "the central part of a tooth containing nerves and blood vessels",
            "explanation": "The pulp cavity is the innermost area of a tooth where the dental pulp resides. The dental pulp is made up of connective tissue, nerves, and blood vessels that provide nourishment and sensation to the tooth.",
            "chineseTranslation": "髓腔",
            "traditionalChineseTranslation": "髓腔",
            "lesson": 5
        },
        {
            "word": "cementum",
            "prefix": "",
            "root": "cement",
            "suffix": "-um",
            "meaning": "the calcified substance covering the roots of teeth",
            "explanation": "Cementum is a specialized bony substance covering the root of a tooth, helping anchor it to the periodontal ligament and gum tissue.",
            "chineseTranslation": "牙骨质",
            "traditionalChineseTranslation": "牙骨質",
            "lesson": 5
        },
        {
            "word": "periodontal ligament",
            "prefix": "perio-",
            "root": "dont",
            "suffix": "-al",
            "meaning": "The connective tissue that surrounds and supports the tooth, anchoring it to the bone.",
            "explanation": "The periodontal ligament is a group of specialized connective tissue fibers that attach a tooth to the surrounding alveolar bone. It plays a crucial role in tooth support, stability, and the overall health of the periodontal tissue.",
            "chineseTranslation": "牙周韧带",
            "traditionalChineseTranslation": "牙周韌帶",
            "lesson": 5
        },
        {
            "word": "cutting teeth",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the process of teeth emerging through the gums in infants",
            "explanation": "Cutting teeth refers to the phenomenon when a baby's teeth start to break through the gums, which typically occurs between 6 months and 1 year of age, causing discomfort and irritability.",
            "chineseTranslation": "长牙",
            "traditionalChineseTranslation": "長牙",
            "lesson": 5
        },
        {
            "word": "incisors",
            "prefix": "",
            "root": "incis",
            "suffix": "or",
            "meaning": "The front teeth in humans and many animals, primarily used for cutting food.",
            "explanation": "Incisors are the sharp, chisel-shaped teeth located at the front of the mouth. They are crucial for biting and cutting food into smaller pieces before swallowing.",
            "chineseTranslation": "切牙",
            "traditionalChineseTranslation": "切牙",
            "lesson": 5
        },
        {
            "word": "cuspids",
            "prefix": "",
            "root": "cuspid",
            "suffix": "s",
            "meaning": "the pointed teeth located at the corners of the mouth, also known as canine teeth.",
            "explanation": "Cuspids, or canine teeth, are the sharp, pointed teeth found on either side of the incisors in the mouth. They are primarily used for tearing food.",
            "chineseTranslation": "尖牙",
            "traditionalChineseTranslation": "尖牙",
            "lesson": 5
        },
        {
            "word": "grinding teeth",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the act of involuntarily clenching or grinding the teeth, often during sleep",
            "explanation": "Grinding teeth, also known as bruxism, can lead to dental issues, jaw pain, and can be a sign of stress or anxiety.",
            "chineseTranslation": "磨牙",
            "traditionalChineseTranslation": "磨牙",
            "lesson": 5
        },
        {
            "word": "bicuspids",
            "prefix": "bi-",
            "root": "cuspid",
            "suffix": "-s",
            "meaning": "Teeth that have two cusps, commonly known as premolars.",
            "explanation": "Bicuspids, or premolars, are the teeth located between canines and molars, characterized by having two cusps, which helps in grinding food.",
            "chineseTranslation": "双尖牙",
            "traditionalChineseTranslation": "雙尖牙",
            "lesson": 5
        },
        {
            "word": "molars",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "large teeth at the back of the mouth used for grinding food",
            "explanation": "Molars are the large, flat teeth located at the back of the mouth, primarily used for grinding and chewing food. They are designed to break down food into smaller pieces to aid in digestion.",
            "chineseTranslation": "磨牙",
            "traditionalChineseTranslation": "磨牙",
            "lesson": 5
        },
        {
            "word": "fundus",
            "meaning": "the base or bottom of an anatomical structure, often referring to the interior surface of a hollow organ, such as the stomach or eye.",
            "chineseTranslation": "底部",
            "traditionalChineseTranslation": "底部",
            "explanation": "In medical terminology, 'fundus' commonly refers to the part of an organ that is opposite from the opening or the top part of a hollow structure. For example, the fundus of the stomach is the upper part, while the fundus of the eye refers to the interior surface visible during an eye examination.",
            "prefix": "",
            "root": "fundus",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "hydrochloric acid",
            "prefix": "hydro-",
            "root": "chlor",
            "suffix": "ic",
            "meaning": "a strong acid formed from hydrogen and chlorine, commonly found in gastric acid.",
            "explanation": "Hydrochloric acid is a colorless, odorless solution of hydrogen chloride in water. It is a strong acid that is used in digestion in the stomach and in various industrial processes.",
            "chineseTranslation": "盐酸",
            "traditionalChineseTranslation": "鹽酸",
            "lesson": 5
        },
        {
            "word": "chyme",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The semi-fluid mass of partially digested food that is expelled by the stomach into the duodenum.",
            "explanation": "Chyme is formed in the stomach during digestion, where food is mixed with gastric juices. Its consistency is like a thick liquid, and it is essential for further digestion in the small intestine.",
            "chineseTranslation": "食糜",
            "traditionalChineseTranslation": "食糜",
            "lesson": 5
        },
        {
            "word": "sphincters",
            "prefix": "",
            "root": "sphincter",
            "suffix": "s",
            "meaning": "circular muscles that constrict passageways or openings in the body",
            "explanation": "Sphincters are muscles that encircle a passage or opening and can contract to close off the passage. They play a crucial role in various bodily functions, including the digestive system (e.g., anal sphincter) and the urinary system (e.g., external urethral sphincter).",
            "chineseTranslation": "括约肌",
            "traditionalChineseTranslation": "括約肌",
            "lesson": 5
        },
        {
            "word": "cardiac sphincter",
            "meaning": "A muscular valve located at the lower end of the esophagus that controls the entry of food into the stomach and prevents the backflow of stomach contents.",
            "chineseTranslation": "心脏括约肌",
            "traditionalChineseTranslation": "心臟括約肌",
            "explanation": "The cardiac sphincter, also known as the lower esophageal sphincter, is crucial for preventing acid reflux by maintaining a tight closure between the esophagus and the stomach.",
            "prefix": "",
            "root": "cardiac, sphincter",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "pyloric sphincter",
            "prefix": "",
            "root": "pyloric",
            "suffix": "sphincter",
            "meaning": "the muscle that controls the passage of food from the stomach to the small intestine.",
            "explanation": "The pyloric sphincter is a ring of muscle at the junction of the stomach and the small intestine (duodenum) that regulates the release of partially digested food into the intestine, allowing for proper digestion and absorption of nutrients.",
            "chineseTranslation": "幽门括约肌",
            "traditionalChineseTranslation": "幽門括約肌",
            "lesson": 5
        },
        {
            "word": "duodenum",
            "prefix": "",
            "root": "duodenum",
            "suffix": "",
            "meaning": "the first part of the small intestine, immediately beyond the stomach",
            "explanation": "The duodenum is a critical section of the gastrointestinal tract where a significant amount of digestion and nutrient absorption occurs. It receives partially digested food from the stomach and enzymes from the pancreas and bile from the liver.",
            "chineseTranslation": "十二指肠",
            "traditionalChineseTranslation": "十二指腸",
            "lesson": 5
        },
        {
            "word": "jejunum",
            "prefix": "",
            "root": "jejun-",
            "suffix": "-um",
            "meaning": "the second portion of the small intestine",
            "explanation": "The jejunum is primarily responsible for the absorption of nutrients from digested food.",
            "chineseTranslation": "空肠",
            "traditionalChineseTranslation": "空腸",
            "lesson": 5
        },
        {
            "word": "ileum",
            "prefix": "",
            "root": "ile-",
            "suffix": "",
            "meaning": "The final section of the small intestine, extending from the cecum to the jejunum.",
            "explanation": "The ileum is responsible for the absorption of nutrients and minerals from food. It is typically 3-4 meters long and connects to the cecum, which is the beginning of the large intestine.",
            "chineseTranslation": "回肠",
            "traditionalChineseTranslation": "回腸",
            "lesson": 5
        },
        {
            "word": "cecum",
            "meaning": "The blind pouch forming the beginning of the large intestine, located at the junction of the small intestine and the colon.",
            "chineseTranslation": "盲腸",
            "traditionalChineseTranslation": "盲腸",
            "explanation": "The cecum is a part of the digestive system that connects the ileum of the small intestine to the ascending colon of the large intestine. It plays a role in the absorption of fluids and salts that remain after the intestinal digestion and absorption, and it is also a site where various microorganisms reside to assist in the fermentation of undigested materials.",
            "prefix": "",
            "root": "cec-",
            "suffix": "-um",
            "lesson": 5
        },
        {
            "word": "vermiform appendix",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small, tube-like structure attached to the large intestine, often considered to be a vestigial organ",
            "explanation": "The vermiform appendix is a narrow, finger-like pouch that extends from the cecum, which is the beginning of the large intestine. It is thought to have a role in gut immunity and maintaining a healthy microbiome, although its exact function is not fully understood. It can become inflamed and infected, leading to appendicitis.",
            "chineseTranslation": "阑尾",
            "traditionalChineseTranslation": "闌尾",
            "lesson": 5
        },
        {
            "word": "ascending colon",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the part of the colon that extends upward from the cecum",
            "explanation": "The ascending colon is a section of the large intestine that runs vertically along the right side of the abdominal cavity, beginning at the cecum and terminating at the hepatic flexure, where it bends to become the transverse colon.",
            "chineseTranslation": "上升结肠",
            "traditionalChineseTranslation": "上升結腸",
            "lesson": 5
        },
        {
            "word": "transverse colon",
            "prefix": "trans-",
            "root": "verse",
            "suffix": "",
            "meaning": "the part of the large intestine that crosses the abdomen from right to left, connecting the ascending colon and descending colon",
            "explanation": "The transverse colon is a segment of the large intestine located horizontally across the upper part of the abdominal cavity, playing a key role in the digestive process by absorbing water and salts from the material that has not been digested as food, as well as storing the waste until it is excreted.",
            "chineseTranslation": "横结肠",
            "traditionalChineseTranslation": "橫結腸",
            "lesson": 5
        },
        {
            "word": "descending colon",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the large intestine that runs downward from the splenic flexure to the sigmoid colon.",
            "explanation": "The descending colon is part of the colon (large intestine), located on the left side of the abdomen. It plays a role in the storage and transportation of waste before it moves to the sigmoid colon and then expels it from the body.",
            "chineseTranslation": "降結腸",
            "traditionalChineseTranslation": "降結腸",
            "lesson": 5
        },
        {
            "word": "sigmoid colon",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the large intestine that is closest to the rectum, shaped like an 'S'.",
            "explanation": "The sigmoid colon is the final section of the colon, typically forming an 'S' shape before it connects to the rectum. It plays a crucial role in storing fecal waste until it is ready to be excreted.",
            "chineseTranslation": "乙狀結腸",
            "traditionalChineseTranslation": "乙狀結腸",
            "lesson": 5
        },
        {
            "word": "rectum",
            "prefix": "",
            "root": "rect-",
            "suffix": "",
            "meaning": "the final section of the large intestine, terminating at the anus",
            "explanation": "The rectum is the last part of the large intestine, where the stool is stored before being expelled from the body. It connects the sigmoid colon to the anus and plays a critical role in the elimination of waste.",
            "chineseTranslation": "直肠",
            "traditionalChineseTranslation": "直腸",
            "lesson": 5
        },
        {
            "word": "anus",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the opening at the end of the digestive tract through which solid waste leaves the body",
            "explanation": "The anus is the terminal part of the gastrointestinal tract, allowing for the excretion of feces as waste from the body. It is surrounded by sphincter muscles that control the passage of stool.",
            "chineseTranslation": "肛门",
            "traditionalChineseTranslation": "肛門",
            "lesson": 5
        },
        {
            "word": "bile",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A digestive fluid produced by the liver that helps in the digestion of fats.",
            "explanation": "Bile is a yellowish-green fluid that is secreted by the liver and stored in the gallbladder. It contains bile salts, bilirubin, cholesterol, and electrolytes, which aid in emulsifying fats, allowing them to be absorbed by the intestines.",
            "chineseTranslation": "胆汁",
            "traditionalChineseTranslation": "膽汁",
            "lesson": 5
        },
        {
            "word": "emulsification",
            "prefix": "emulsi-",
            "root": "fication",
            "suffix": "",
            "meaning": "The process of mixing two immiscible liquids, such as oil and water, to form a stable emulsion.",
            "explanation": "Emulsification is vital in digestion and food preparation, allowing fats to be mixed with water-based substances, enhancing flavor and absorption.",
            "chineseTranslation": "乳化",
            "traditionalChineseTranslation": "乳化",
            "lesson": 5
        },
        {
            "word": "glucagon",
            "prefix": "",
            "root": "gluc-",
            "suffix": "-agon",
            "meaning": "A hormone released by the pancreas that raises blood glucose levels",
            "explanation": "Glucagon stimulates the liver to release glucose into the bloodstream, which is essential for maintaining normal blood sugar levels, especially during fasting or low-carbohydrate intake.",
            "chineseTranslation": "胰高血糖素",
            "traditionalChineseTranslation": "胰高血糖素",
            "lesson": 5
        },
        {
            "word": "bowel incontinence",
            "meaning": "the inability to control bowel movements, leading to involuntary fecal leakage.",
            "chineseTranslation": "肠道失禁",
            "traditionalChineseTranslation": "腸道失禁",
            "explanation": "Bowel incontinence can result from various conditions, including nerve damage, muscle damage, or certain medical conditions that affect bowel control.",
            "prefix": "",
            "root": "bowel",
            "suffix": "incontinence",
            "lesson": 5
        },
        {
            "word": "Constipation",
            "prefix": "",
            "root": "stipare",
            "suffix": "",
            "meaning": "A condition characterized by difficulty in emptying the bowels, usually associated with hardened feces.",
            "explanation": "Constipation occurs when a person has infrequent bowel movements or difficulty in passing stool. This can lead to discomfort and can be caused by factors such as diet, lack of exercise, or certain medications.",
            "chineseTranslation": "便秘",
            "traditionalChineseTranslation": "便秘",
            "lesson": 5
        },
        {
            "word": "jaundice",
            "prefix": "",
            "root": "jaundice",
            "suffix": "",
            "meaning": "A medical condition characterized by yellowing of the skin and eyes due to an excess of bilirubin in the blood.",
            "explanation": "Jaundice occurs when there is a high level of bilirubin, a yellow pigment produced during the breakdown of red blood cells. It can result from various conditions affecting the liver, bile ducts, or red blood cells.",
            "chineseTranslation": "黄疸",
            "traditionalChineseTranslation": "黃疸",
            "lesson": 5
        },
        {
            "word": "pyrosis",
            "prefix": "pyr-",
            "root": "osis",
            "suffix": "",
            "meaning": "a burning sensation in the chest typically associated with acid reflux",
            "explanation": "Pyrosis, commonly referred to as heartburn, is a symptom characterized by a painful burning sensation in the chest caused by the reflux of stomach acid into the esophagus.",
            "chineseTranslation": "烧心",
            "traditionalChineseTranslation": "燒心",
            "lesson": 5
        },
        {
            "word": "canker sore",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a type of ulcer that occurs in the mouth and causes pain and discomfort",
            "explanation": "Canker sores, also known as aphthous ulcers, are small, painful lesions that develop on the soft tissues in the mouth or at the base of the gums. They are not contagious and can be triggered by stress, certain food sensitivities, or nutritional deficiencies.",
            "chineseTranslation": "口腔溃疡",
            "traditionalChineseTranslation": "口腔潰瘍",
            "lesson": 5
        },
        {
            "word": "cold sore",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A small blister that appears on the lips or around the mouth, caused by the herpes simplex virus.",
            "explanation": "Cold sores are typically caused by the herpes simplex virus (HSV-1) and are characterized by painful, fluid-filled blisters. They usually appear during times of stress, illness, or exposure to sunlight and can be contagious even when sores are not present.",
            "chineseTranslation": "唇疱疹",
            "traditionalChineseTranslation": "唇疱疹",
            "lesson": 5
        },
        {
            "word": "gastroesophageal reflux disease",
            "prefix": "gastro-",
            "root": "esophagus",
            "suffix": "disease",
            "meaning": "a condition in which stomach acid flows back into the esophagus, causing irritation",
            "explanation": "Gastroesophageal reflux disease (GERD) occurs when the lower esophageal sphincter is weak or relaxes inappropriately, allowing stomach contents, including acid, to move up into the esophagus, leading to symptoms such as heartburn.",
            "chineseTranslation": "胃食管逆流病",
            "traditionalChineseTranslation": "胃食管逆流病",
            "lesson": 5
        },
        {
            "word": "hemorrhoids",
            "prefix": "",
            "root": "hemorrhoid",
            "suffix": "",
            "meaning": "swollen and inflamed veins in the rectum and anus that cause discomfort and bleeding",
            "explanation": "Hemorrhoids are caused by increased pressure in the lower rectum, which can result from various factors such as straining during bowel movements, sitting for long periods, pregnancy, or obesity. They can be classified as external or internal based on their location.",
            "chineseTranslation": "痔疮",
            "traditionalChineseTranslation": "痔瘡",
            "lesson": 5
        },
        {
            "word": "ileus",
            "meaning": "a condition in which there is an obstruction of the intestines, leading to a blockage of the passage of the intestinal contents",
            "chineseTranslation": "肠梗阻",
            "traditionalChineseTranslation": "腸梗阻",
            "explanation": "Ileus can occur due to various factors such as surgery, medications, or certain medical conditions that impair the movement of the intestines.",
            "prefix": "",
            "root": "ileus",
            "suffix": "",
            "lesson": 5
        },
        {
            "word": "hernia",
            "prefix": "",
            "root": "hern",
            "suffix": "",
            "meaning": "A condition in which an organ protrudes through an abnormal opening in the surrounding muscle or tissue.",
            "explanation": "Hernias commonly occur in the abdomen when an internal part of the body pushes through a weakness in the muscle or surrounding tissue. They can cause pain and discomfort and may require surgery to repair.",
            "chineseTranslation": "疝气",
            "traditionalChineseTranslation": "疝氣",
            "lesson": 5
        },
        {
            "word": "cirrhosis",
            "prefix": "",
            "root": "cirrh-",
            "suffix": "-osis",
            "meaning": "A chronic liver disease characterized by the replacement of healthy liver tissue with scar tissue.",
            "explanation": "Cirrhosis occurs when the liver becomes severely scarred, often from long-term damage caused by alcohol abuse, hepatitis, or other liver conditions, leading to impaired liver function.",
            "chineseTranslation": "肝硬化",
            "traditionalChineseTranslation": "肝硬化",
            "lesson": 5
        },
        {
            "word": "hepatitis b virus",
            "prefix": "hepat-",
            "root": "itis",
            "suffix": "virus",
            "meaning": "A virus that causes inflammation of the liver (hepatitis) specifically type B.",
            "explanation": "Hepatitis B virus (HBV) is a virus that attacks the liver and can cause chronic liver disease, including cirrhosis and liver cancer. The virus is transmitted through contact with infectious body fluids.",
            "chineseTranslation": "乙型肝炎病毒",
            "traditionalChineseTranslation": "乙型肝炎病毒",
            "lesson": 5
        },
        {
            "word": "cholecystitis",
            "prefix": "chole-",
            "root": "cyst",
            "suffix": "-itis",
            "meaning": "inflammation of the gallbladder",
            "explanation": "Cholecystitis is a medical condition characterized by the inflammation of the gallbladder, often due to a blockage of the bile duct, commonly by gallstones.",
            "chineseTranslation": "胆囊炎",
            "traditionalChineseTranslation": "膽囊炎",
            "lesson": 5
        },
        {
            "word": "cholelithiasis",
            "prefix": "chole-",
            "root": "lith",
            "suffix": "-iasis",
            "meaning": "gallstones",
            "explanation": "Cholelithiasis refers to the condition characterized by the presence of stones in the gallbladder.",
            "chineseTranslation": "胆结石症",
            "traditionalChineseTranslation": "膽結石症",
            "lesson": 5
        },
        {
            "word": "laxative",
            "prefix": "",
            "root": "lax",
            "suffix": "-ative",
            "meaning": "a substance that promotes bowel movements",
            "explanation": "Laxatives are used to relieve constipation by stimulating bowel activity or increasing the amount of water in the intestines.",
            "chineseTranslation": "通便药",
            "traditionalChineseTranslation": "通便藥",
            "lesson": 5
        },
        {
            "word": "herbivores",
            "prefix": "herbi-",
            "root": "vore",
            "suffix": "",
            "meaning": "Organisms that primarily eat plants.",
            "explanation": "Herbivores are animals that feed exclusively or primarily on plant material. They play a crucial role in ecosystems as they help in the control of plant populations and provide a food source for predators.",
            "chineseTranslation": "食草动物",
            "traditionalChineseTranslation": "食草動物",
            "lesson": 5
        },
        {
            "word": "carnivores",
            "prefix": "carni-",
            "root": "vor",
            "suffix": "-es",
            "meaning": "organisms that primarily consume meat",
            "explanation": "Carnivores are animals that predominantly eat the flesh of other animals. They are typically at the top of the food chain and have adaptations that enable them to hunt and digest their prey.",
            "chineseTranslation": "食肉动物",
            "traditionalChineseTranslation": "食肉動物",
            "lesson": 5
        },
        {
            "word": "omnivores",
            "prefix": "omni-",
            "root": "vore",
            "suffix": "s",
            "meaning": "organisms that eat both plants and animals",
            "explanation": "Omnivores are species that consume a wide range of foods, including both plant and animal matter, allowing for a versatile diet.",
            "chineseTranslation": "杂食动物",
            "traditionalChineseTranslation": "雜食動物",
            "lesson": 5
        }
    ]
}