{
    "version": "0.0.1",
    "words": [
        {
            "word": "homeostasis",
            "prefix": "homeo-",
            "root": "stasis",
            "suffix": "",
            "meaning": "The maintenance of stable internal conditions in an organism.",
            "explanation": "Homeostasis is crucial for survival, allowing organisms to maintain a balance despite external changes. This includes regulating temperature, pH levels, and other bodily functions.",
            "chineseTranslation": "体内平衡",
            "traditionalChineseTranslation": "體內平衡",
            "lesson": 6
        },
        {
            "word": "ureter",
            "prefix": "",
            "root": "ureter",
            "suffix": "",
            "meaning": "a duct that carries urine from the kidney to the bladder",
            "explanation": "The ureter is a muscular tube that transports urine from the kidneys, where urine is produced, to the bladder, where it is stored before being expelled from the body.",
            "chineseTranslation": "输尿管",
            "traditionalChineseTranslation": "輸尿管",
            "lesson": 6
        },
        {
            "word": "urethra",
            "prefix": "",
            "root": "urethr",
            "suffix": "",
            "meaning": "The tube that carries urine from the bladder to the outside of the body; it also serves as a passage for semen in males.",
            "explanation": "The urethra is a critical part of the urinary system, which functions to expel urine. In males, it also serves a dual function as part of the reproductive system, allowing for the passage of semen.",
            "chineseTranslation": "尿道",
            "traditionalChineseTranslation": "尿道",
            "lesson": 6
        },
        {
            "word": "renin",
            "prefix": "",
            "root": "ren",
            "suffix": "",
            "meaning": "An enzyme secreted by the kidneys that helps regulate blood pressure by converting angiotensinogen to angiotensin I.",
            "explanation": "Renin is produced by the juxtaglomerular cells of the kidneys in response to low blood pressure, low sodium concentrations, or sympathetic nervous system stimulation. It plays a critical role in the renin-angiotensin system, which regulates blood volume and systemic vascular resistance, thus influencing blood pressure.",
            "chineseTranslation": "肾素",
            "traditionalChineseTranslation": "腎素",
            "lesson": 6
        },
        {
            "word": "erythropoietin",
            "prefix": "erythro-",
            "root": "poietin",
            "suffix": "",
            "meaning": "a hormone produced by the kidneys that stimulates the production of red blood cells.",
            "explanation": "Erythropoietin is crucial for the regulation of red blood cell production in response to low oxygen levels in the blood. It signals the bone marrow to increase the production of erythrocytes (red blood cells).",
            "chineseTranslation": "红细胞生成素",
            "traditionalChineseTranslation": "紅細胞生成素",
            "lesson": 6
        },
        {
            "word": "renal cortex",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the outer portion of the kidney",
            "explanation": "The renal cortex is the outer region of the kidney, located between the renal capsule and the renal medulla. It plays a vital role in filtering blood and producing urine.",
            "chineseTranslation": "肾皮质",
            "traditionalChineseTranslation": "腎皮質",
            "lesson": 6
        },
        {
            "word": "renal medulla",
            "prefix": "",
            "root": "renal",
            "suffix": "",
            "meaning": "the innermost part of the kidney responsible for processing waste materials and regulating water and electrolytes.",
            "explanation": "The renal medulla contains structures called renal pyramids and is involved in the nephron functioning that helps in urine formation.",
            "chineseTranslation": "肾髓",
            "traditionalChineseTranslation": "腎髓",
            "lesson": 6
        },
        {
            "word": "renal pyramid",
            "meaning": "The cone-shaped structures located in the inner part of the kidney, involved in the production of urine.",
            "chineseTranslation": "肾锥体",
            "traditionalChineseTranslation": "腎錐體",
            "explanation": "Renal pyramids are part of the kidney's medulla, where urine is collected from the nephrons and transported to the renal pelvis.",
            "prefix": "",
            "root": "renal (related to the kidney)",
            "suffix": "pyramid (a structure with a polygon base and triangular sides, converging to a point)",
            "lesson": 6
        },
        {
            "word": "calyx / calyces",
            "prefix": "",
            "root": "calyx",
            "suffix": "",
            "meaning": "A structure in plants that consists of the outermost whorls of a flower, typically consisting of sepals.",
            "explanation": "In botanical terms, the calyx is the collective term for all the sepals of a flower. It serves to protect the inner floral parts as they develop and can also be important for attracting pollinators.",
            "chineseTranslation": "花萼 / 花萼s",
            "traditionalChineseTranslation": "花萼 / 花萼s",
            "lesson": 6
        },
        {
            "word": "renal pelvis",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the funnel-shaped structure in the kidney that collects urine from the calyces and channels it into the ureter",
            "explanation": "The renal pelvis is located at the center of the kidney and acts as a collection point for urine before it moves to the bladder. It is formed from the convergence of the calyces, which are cup-like structures that collect urine produced by the nephrons.",
            "chineseTranslation": "肾盂",
            "traditionalChineseTranslation": "腎盂",
            "lesson": 6
        },
        {
            "word": "nephron",
            "prefix": "",
            "root": "nephr-",
            "suffix": "",
            "meaning": "the basic structural and functional unit of the kidney responsible for filtering blood and forming urine",
            "explanation": "Nephrons are tiny structures in the kidney that filter blood, reabsorb essential nutrients, and excrete waste products in the form of urine. Each kidney contains about a million nephrons, which are crucial for maintaining the body's fluid and electrolyte balance.",
            "chineseTranslation": "肾单位",
            "traditionalChineseTranslation": "腎單位",
            "lesson": 6
        },
        {
            "word": "renal corpuscle",
            "prefix": "",
            "root": "renal, corpuscle",
            "suffix": "",
            "meaning": "The functional unit of the kidney, consisting of a glomerulus and a Bowman's capsule.",
            "explanation": "The renal corpuscle is where blood filtration begins in the kidney. It consists of a cluster of capillaries (glomerulus) and the surrounding capsule that captures the filtrate.",
            "chineseTranslation": "肾小体",
            "traditionalChineseTranslation": "腎小體",
            "lesson": 6
        },
        {
            "word": "renal tubule",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the kidney where reabsorption and secretion occur after the filtration of blood in the glomerulus, playing a crucial role in the regulation of water and electrolytes.",
            "explanation": "Renal tubules are essential components of the nephron in the kidney. They process the filtrate from the glomerulus, allowing the body to retain useful substances while excreting waste products in urine. This includes the proximal convoluted tubule, loop of Henle, distal convoluted tubule, and collecting duct.",
            "chineseTranslation": "肾小管",
            "traditionalChineseTranslation": "腎小管",
            "lesson": 6
        },
        {
            "word": "glomerulus",
            "meaning": "a small cluster of blood vessels in the kidneys where filtration occurs",
            "chineseTranslation": "肾小球",
            "traditionalChineseTranslation": "腎小球",
            "explanation": "The glomerulus is a network of capillaries located at the beginning of a nephron in the kidney. It plays a crucial role in the process of filtering blood to form urine, allowing water and small molecules to pass through while retaining larger molecules and blood cells.",
            "prefix": "",
            "root": "glomerul",
            "suffix": "us",
            "lesson": 6
        },
        {
            "word": "afferent arteriole",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small blood vessel that carries blood toward a nephron in the kidney",
            "explanation": "The afferent arteriole is responsible for supplying blood to the glomerulus, where filtration of blood occurs in the kidney. It plays a crucial role in regulating the flow of blood into the nephron and thus influences renal function.",
            "chineseTranslation": "入小管动脉",
            "traditionalChineseTranslation": "入小管動脈",
            "lesson": 6
        },
        {
            "word": "efferent arteriole",
            "meaning": "A small blood vessel that carries blood away from the glomerulus in the kidney, playing a vital role in regulating blood flow and pressure within the glomerulus.",
            "chineseTranslation": "输出小动脉",
            "traditionalChineseTranslation": "輸出小動脈",
            "explanation": "The efferent arteriole assists in the filtration process of the kidneys by transporting blood away from the glomerulus after filtration has occurred.",
            "prefix": "",
            "root": "efferent",
            "suffix": "arteriole",
            "lesson": 6
        },
        {
            "word": "Bowman's Capsule",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The cup-shaped structure in the nephron of the kidney that encases the glomerulus and is involved in the filtration of blood to form urine.",
            "explanation": "Bowman's capsule is the first part of the nephron in the kidney, playing a crucial role in the filtration process as blood enters the nephron. It collects the filtrate from the blood, which is then further processed into urine.",
            "chineseTranslation": "鲍曼囊",
            "traditionalChineseTranslation": "鮑曼囊",
            "lesson": 6
        },
        {
            "word": "proximal convoluted tubule",
            "prefix": "proximal",
            "root": "convoluted tubule",
            "suffix": "",
            "meaning": "The first segment of the renal tubule in the nephron where reabsorption of water, ions, and nutrients occurs.",
            "explanation": "The proximal convoluted tubule is responsible for the reabsorption of about 65-70% of the filtrate produced in the glomerulus. It is highly coiled and lined with microvilli to increase surface area for absorption.",
            "chineseTranslation": "近端曲小管",
            "traditionalChineseTranslation": "近端曲小管",
            "lesson": 6
        },
        {
            "word": "nephron loop",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A U-shaped section of the nephron in the kidney involved in the reabsorption of water and sodium ions.",
            "explanation": "The nephron loop, also known as the loop of Henle, is a critical part of the nephron that helps conserve water and maintain salt balance in the body. It has a descending and an ascending limb that play important roles in concentrating urine.",
            "chineseTranslation": "肾单位环",
            "traditionalChineseTranslation": "腎單位環",
            "lesson": 6
        },
        {
            "word": "distal convoluted tubule",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A portion of the nephron in the kidney that connects the loop of Henle to the collecting duct and is involved in the reabsorption of sodium and water, as well as the secretion of potassium and hydrogen ions.",
            "explanation": "The distal convoluted tubule is responsible for selective reabsorption and is important in regulating electrolyte and fluid balance in the body.",
            "chineseTranslation": "远曲小管",
            "traditionalChineseTranslation": "遠曲小管",
            "lesson": 6
        },
        {
            "word": "collecting tubule",
            "prefix": "",
            "root": "tubule",
            "suffix": "",
            "meaning": "A small tube in the kidney that collects urine from the nephrons.",
            "explanation": "Collecting tubules are part of the nephron, which is the functional unit of the kidney. They play a crucial role in the regulation of water and electrolytes by reabsorbing water and certain ions.",
            "chineseTranslation": "集尿小管",
            "traditionalChineseTranslation": "集尿小管",
            "lesson": 6
        },
        {
            "word": "urinary meatus",
            "meaning": "The external opening of the urinary canal.",
            "chineseTranslation": "尿道口",
            "traditionalChineseTranslation": "尿道口",
            "explanation": "The urinary meatus is the point at which urine leaves the body from the urinary bladder through the urethra. In males, it is located at the tip of the penis, while in females it is located above the vaginal opening.",
            "prefix": "",
            "root": "meatus",
            "suffix": "",
            "lesson": 6
        },
        {
            "word": "creatinine",
            "meaning": "a waste product found in blood and urine, produced from muscle metabolism.",
            "chineseTranslation": "肌酸酐",
            "traditionalChineseTranslation": "肌酸酐",
            "explanation": "Creatinine levels are often measured to assess kidney function, as it is filtered out of the blood by the kidneys.",
            "prefix": "",
            "root": "creatin",
            "suffix": "ine",
            "lesson": 6
        },
        {
            "word": "oliguria",
            "prefix": "oligo-",
            "root": "uria",
            "suffix": "",
            "meaning": "decreased urine output",
            "explanation": "Oliguria is a condition characterized by the production of an abnormally low amount of urine, typically defined as less than 400 milliliters per day in adults.",
            "chineseTranslation": "少尿",
            "traditionalChineseTranslation": "少尿",
            "lesson": 6
        },
        {
            "word": "anuria",
            "prefix": "an-",
            "root": "uria",
            "suffix": "",
            "meaning": "the absence of urine production",
            "explanation": "Anuria is a medical condition characterized by the failure of the kidneys to produce urine. This can be a serious condition, often indicating a severe underlying health issue such as kidney failure.",
            "chineseTranslation": "無尿",
            "traditionalChineseTranslation": "無尿",
            "lesson": 6
        },
        {
            "word": "polyuria",
            "prefix": "poly-",
            "root": "uria",
            "suffix": "",
            "meaning": "excessive urination",
            "explanation": "Polyuria refers to a condition characterized by the production of abnormally large volumes of urine. It can be a symptom of various medical conditions, particularly diabetes mellitus or diabetes insipidus.",
            "chineseTranslation": "多尿症",
            "traditionalChineseTranslation": "多尿症",
            "lesson": 6
        },
        {
            "word": "renal colic",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "pain caused by kidney stones moving through the urinary tract",
            "explanation": "Renal colic is a type of severe pain that occurs when there is a blockage in the urinary tract due to stones formed in the kidneys. The pain is typically felt in the lower back and sides and can radiate to the abdomen and groin.",
            "chineseTranslation": "肾绞痛",
            "traditionalChineseTranslation": "腎絞痛",
            "lesson": 6
        },
        {
            "word": "nephrolithiasis",
            "prefix": "nephro-",
            "root": "lith",
            "suffix": "-iasis",
            "meaning": "kidney stones",
            "explanation": "Nephrolithiasis refers to the condition characterized by the formation of stones (calculi) in the kidney. These stones can lead to complications such as pain, urinary obstruction, and infection.",
            "chineseTranslation": "肾结石",
            "traditionalChineseTranslation": "腎結石",
            "lesson": 6
        },
        {
            "word": "glomerulonephritis",
            "prefix": "glomerulo-",
            "root": "nephr",
            "suffix": "-itis",
            "meaning": "inflammation of the glomeruli in the kidneys",
            "explanation": "Glomerulonephritis is a condition characterized by inflammation of the kidney's glomeruli, which can lead to impaired kidney function. It can result from various causes, including infections, autoimmune diseases, and other conditions that damage the kidneys.",
            "chineseTranslation": "肾小球肾炎",
            "traditionalChineseTranslation": "腎小球腎炎",
            "lesson": 6
        },
        {
            "word": "pyelonephritis",
            "prefix": "pyelo-",
            "root": "nephr-",
            "suffix": "-itis",
            "meaning": "inflammation of the kidney and renal pelvis",
            "explanation": "Pyelonephritis is an infection that generally begins in the bladder and travels up the urinary tract to the kidneys, causing inflammation. It can be acute or chronic depending on the duration and severity of the infection.",
            "chineseTranslation": "肾盂肾炎",
            "traditionalChineseTranslation": "腎盂腎炎",
            "lesson": 6
        },
        {
            "word": "cystitis",
            "prefix": "cyst-",
            "root": "-itis",
            "suffix": "",
            "meaning": "inflammation of the bladder",
            "explanation": "Cystitis commonly refers to the inflammation of the urinary bladder, often due to infection.",
            "chineseTranslation": "膀胱炎",
            "traditionalChineseTranslation": "膀胱炎",
            "lesson": 6
        },
        {
            "word": "uti",
            "meaning": "A urinary tract infection is an infection in any part of the urinary system, including the kidneys, bladder, or urethra.",
            "chineseTranslation": "尿道感染",
            "traditionalChineseTranslation": "尿道感染",
            "explanation": "Urinary tract infections are typically caused by bacteria and can cause symptoms such as a strong urge to urinate, a burning sensation during urination, and cloudy urine.",
            "prefix": "",
            "root": "tract",
            "suffix": "infection",
            "lesson": 6
        },
        {
            "word": "nephroptosis",
            "prefix": "nephro-",
            "root": "",
            "suffix": "-ptosis",
            "meaning": "downward displacement of a kidney",
            "explanation": "Nephroptosis is a condition where a kidney is abnormally positioned, dropping down into the pelvis when a person stands up, which may lead to complications.",
            "chineseTranslation": "肾下垂",
            "traditionalChineseTranslation": "腎下垂",
            "lesson": 6
        },
        {
            "word": "polycystic kidneys",
            "prefix": "poly-",
            "root": "cyst",
            "suffix": "-ic",
            "meaning": "a condition characterized by the presence of numerous cysts in the kidneys",
            "explanation": "Polycystic kidneys result in enlarged kidneys and can impair their function due to the accumulation of cysts, which are fluid-filled sacs. This condition can be hereditary and may lead to high blood pressure and kidney failure over time.",
            "chineseTranslation": "多囊肾",
            "traditionalChineseTranslation": "多囊腎",
            "lesson": 6
        },
        {
            "word": "urinary incontinence",
            "meaning": "the inability to control urination",
            "chineseTranslation": "尿失禁",
            "traditionalChineseTranslation": "尿失禁",
            "explanation": "Urinary incontinence refers to the involuntary leakage of urine, which can occur due to various reasons such as weak pelvic floor muscles, neurological disorders, or certain medications. It can manifest as a sudden urge to urinate or a complete lack of control over urination.",
            "prefix": "uri-",
            "root": "nary",
            "suffix": "",
            "lesson": 6
        },
        {
            "word": "urinary retention",
            "prefix": "",
            "root": "urinary",
            "suffix": "",
            "meaning": "the inability to empty the bladder completely",
            "explanation": "Urinary retention is a medical condition where an individual is unable to completely empty their bladder, which can lead to discomfort and potential complications.",
            "chineseTranslation": "尿潴留",
            "traditionalChineseTranslation": "尿滯留",
            "lesson": 6
        },
        {
            "word": "azotemia",
            "prefix": "azo-",
            "root": "-emia",
            "suffix": "",
            "meaning": "the presence of excessive nitrogenous products in the blood",
            "explanation": "Azotemia is a medical condition characterized by elevated levels of nitrogen-containing compounds, such as urea and creatinine, in the bloodstream, usually due to impaired kidney function.",
            "chineseTranslation": "氮血症",
            "traditionalChineseTranslation": "氮血症",
            "lesson": 6
        },
        {
            "word": "uremia",
            "prefix": "",
            "root": "ure-",
            "suffix": "-emia",
            "meaning": "an excess of urea and other nitrogenous waste compounds in the blood",
            "explanation": "Uremia is a clinical syndrome that occurs when the kidneys are unable to effectively filter waste products from the blood, leading to a buildup of urea and other toxins in the body.",
            "chineseTranslation": "尿毒症",
            "traditionalChineseTranslation": "尿毒症",
            "lesson": 6
        },
        {
            "word": "catheter",
            "prefix": "",
            "root": "catheter",
            "suffix": "",
            "meaning": "A flexible tube that is inserted into the body to allow for the withdrawal of fluids or the introduction of fluids into the body.",
            "explanation": "Catheters are often used in medical procedures, such as draining urine from the bladder, delivering medications, or accessing blood vessels for treatments.",
            "chineseTranslation": "导管",
            "traditionalChineseTranslation": "導管",
            "lesson": 6
        },
        {
            "word": "catheterization",
            "prefix": "catheter-",
            "root": "",
            "suffix": "-ization",
            "meaning": "the process of inserting a catheter into a body cavity or vessel",
            "explanation": "Catheterization is often performed to allow for drainage, administration of medication, or for diagnostic purposes within the body. It is commonly used in medical procedures like urinary catheterization or angiography.",
            "chineseTranslation": "导尿术",
            "traditionalChineseTranslation": "導尿術",
            "lesson": 6
        },
        {
            "word": "hemodialysis",
            "prefix": "hemo-",
            "root": "dialysis",
            "suffix": "",
            "meaning": "a medical procedure for removing waste and excess water from the blood, typically for patients with kidney failure",
            "explanation": "Hemodialysis involves filtering the blood through a machine that removes toxins and excess fluids, allowing the blood to be cleansed before being returned to the body.",
            "chineseTranslation": "血液透析",
            "traditionalChineseTranslation": "血液透析",
            "lesson": 6
        },
        {
            "word": "peritoneal dialysis",
            "prefix": "peri-",
            "root": "toneal",
            "suffix": "dialysis",
            "meaning": "A medical procedure that uses the peritoneum in the abdomen as a membrane across which fluids and dissolved substances are exchanged from the blood.",
            "explanation": "Peritoneal dialysis is a treatment for kidney failure that uses the lining of your abdomen (the peritoneum) to filter waste from the blood. It's an alternative to hemodialysis.",
            "chineseTranslation": "腹膜透析",
            "traditionalChineseTranslation": "腹膜透析",
            "lesson": 6
        },
        {
            "word": "lithotripsy",
            "prefix": "litho-",
            "root": "tripsy",
            "suffix": "",
            "meaning": "a medical procedure that uses shock waves to break up stones in the kidney, bladder, or bile ducts",
            "explanation": "Lithotripsy is a non-invasive treatment used to treat urolithiasis (kidney stones) by breaking down stones using high-energy shock waves that are focused on the stone to fragment it into smaller, passable pieces.",
            "chineseTranslation": "碎石术",
            "traditionalChineseTranslation": "碎石術",
            "lesson": 6
        },
        {
            "word": "diuretic",
            "prefix": "di-",
            "root": "uretic",
            "suffix": "",
            "meaning": "a substance that promotes the production of urine",
            "explanation": "Diuretics are commonly used in medicine to help remove excess fluid from the body by increasing urine output, often used to treat conditions such as high blood pressure and edema.",
            "chineseTranslation": "利尿剂",
            "traditionalChineseTranslation": "利尿劑",
            "lesson": 6
        },
        {
            "word": "ovaries",
            "meaning": "The female reproductive organs that produce eggs and hormones such as estrogen and progesterone.",
            "chineseTranslation": "卵巢",
            "traditionalChineseTranslation": "卵巢",
            "explanation": "Ovaries are essential for female fertility and regulate the menstrual cycle as well as the production of female sex hormones.",
            "prefix": "",
            "root": "ovar-",
            "suffix": "-ies",
            "lesson": 6
        },
        {
            "word": "fallopian tubes",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The pair of tubes through which eggs travel from the ovaries to the uterus.",
            "explanation": "Fallopian tubes are part of the female reproductive system and are essential for the transport of egg cells from the ovaries. They are also the site where fertilization typically occurs when a sperm cell meets an egg.",
            "chineseTranslation": "输卵管",
            "traditionalChineseTranslation": "輸卵管",
            "lesson": 6
        },
        {
            "word": "uterus",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The hollow, muscular organ in females where a fertilized egg implants and develops during pregnancy.",
            "explanation": "The uterus is a key component of the female reproductive system, involved in menstruation, pregnancy, and childbirth.",
            "chineseTranslation": "子宫",
            "traditionalChineseTranslation": "子宮",
            "lesson": 6
        },
        {
            "word": "vagina",
            "prefix": "",
            "root": "vagin-",
            "suffix": "",
            "meaning": "the muscular tube leading from the external genitals to the cervix of the uterus in women.",
            "explanation": "The vagina is part of the female reproductive system and serves multiple functions, including the passageway for menstrual fluid, the birth canal during childbirth, and the receptacle for the penis during sexual intercourse.",
            "chineseTranslation": "阴道",
            "traditionalChineseTranslation": "陰道",
            "lesson": 6
        },
        {
            "word": "mammary glands",
            "prefix": "",
            "root": "mammary",
            "suffix": "glands",
            "meaning": "glands that produce milk in mammals",
            "explanation": "Mammary glands are specialized organs in mammals that are responsible for the production and secretion of milk to feed infants.",
            "chineseTranslation": "乳腺",
            "traditionalChineseTranslation": "乳腺",
            "lesson": 6
        },
        {
            "word": "mons pubis",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the fatty tissue that covers the pubic bone in females, typically more pronounced after puberty",
            "explanation": "The mons pubis is a rounded mass of fatty tissue that is located above the pubic symphysis and is most prominent in women. It plays a role in protecting the pubic bone and is often associated with sexual maturation due to the presence of hair after puberty.",
            "chineseTranslation": "阴阜",
            "traditionalChineseTranslation": "陰阜",
            "lesson": 6
        },
        {
            "word": "labia majora",
            "prefix": "",
            "root": "labia majora",
            "suffix": "",
            "meaning": "the larger outer folds of skin that enclose and protect the other external genital organs",
            "explanation": "Labia majora are part of the female external genitalia and are located on either side of the vaginal opening, serving a protective role and contributing to the structure of the vulva.",
            "chineseTranslation": "大阴唇",
            "traditionalChineseTranslation": "大陰唇",
            "lesson": 6
        },
        {
            "word": "labia minora",
            "prefix": "",
            "root": "labia",
            "suffix": "",
            "meaning": "the smaller, inner folds of the vulva",
            "explanation": "The labia minora are two thin folds of tissue that are located within the labia majora, surrounding the openings of the vagina and urethra. They play a role in protecting these openings and are sensitive to stimulation.",
            "chineseTranslation": "小阴唇",
            "traditionalChineseTranslation": "小陰唇",
            "lesson": 6
        },
        {
            "word": "clitoris",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small, sensitive organ located at the anterior part of the vulva, which is highly sensitive and involved in sexual arousal.",
            "explanation": "The clitoris is primarily composed of erectile tissue and is a significant part of the female anatomy, playing a crucial role in sexual pleasure and response.",
            "chineseTranslation": "阴蒂",
            "traditionalChineseTranslation": "陰蒂",
            "lesson": 6
        },
        {
            "word": "vestibule",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a small space or entryway leading into another space, often used to refer to parts of the body (e.g., the vestibule of the ear)",
            "explanation": "In anatomy, the vestibule refers to any small cavity or space at the entrance to a canal or other structure. For example, the vestibule of the inner ear is a part that helps in balance and spatial orientation.",
            "chineseTranslation": "前庭",
            "traditionalChineseTranslation": "前庭",
            "lesson": 6
        },
        {
            "word": "urethral orifice",
            "prefix": "",
            "root": "urethr-",
            "suffix": "-al",
            "meaning": "the opening of the urethra, through which urine is expelled from the body",
            "explanation": "The urethral orifice is the external opening at the end of the urethra that allows urine to leave the bladder and enter the outside environment. In males, it is located at the tip of the penis, while in females it is located just above the vaginal opening.",
            "chineseTranslation": "尿道口",
            "traditionalChineseTranslation": "尿道口",
            "lesson": 6
        },
        {
            "word": "vaginal orifice",
            "prefix": "",
            "root": "vagin- (vagina), orific- (opening)",
            "suffix": "",
            "meaning": "The external opening of the vagina.",
            "explanation": "The vaginal orifice is the part of the female reproductive system located at the entrance of the vagina, which serves as the passageway for menstrual fluid, sexual intercourse, and childbirth.",
            "chineseTranslation": "阴道口",
            "traditionalChineseTranslation": "陰道口",
            "lesson": 6
        },
        {
            "word": "perineum",
            "prefix": "",
            "root": "perine-",
            "suffix": "-um",
            "meaning": "The region in the body located between the anus and the genitals.",
            "explanation": "The perineum is an anatomical area that includes structures such as the external genitalia and the anal region. It plays a role in various bodily functions including urination and childbirth.",
            "chineseTranslation": "会阴",
            "traditionalChineseTranslation": "會陰",
            "lesson": 6
        },
        {
            "word": "estrogen",
            "prefix": "",
            "root": "estro-",
            "suffix": "-gen",
            "meaning": "A hormone that regulates various functions in the female reproductive system.",
            "explanation": "Estrogen is one of the primary female sex hormones, playing a crucial role in the development of secondary sexual characteristics, regulation of the menstrual cycle, and maintaining pregnancy.",
            "chineseTranslation": "雌激素",
            "traditionalChineseTranslation": "雌激素",
            "lesson": 6
        },
        {
            "word": "progesterone",
            "prefix": "pro-",
            "root": "gest",
            "suffix": "-one",
            "meaning": "A hormone involved in the menstrual cycle, pregnancy, and embryogenesis.",
            "explanation": "Progesterone is a steroid hormone that plays a crucial role in regulating various functions in the female reproductive system, particularly in preparing and maintaining the uterus for pregnancy.",
            "chineseTranslation": "孕酮",
            "traditionalChineseTranslation": "孕酮",
            "lesson": 6
        },
        {
            "word": "androgens",
            "prefix": "andro-",
            "root": "gen",
            "suffix": "s",
            "meaning": "Hormones that promote the development of male characteristics.",
            "explanation": "Androgens are a group of hormones that play a role in male traits and reproductive activity. The most well-known androgen is testosterone.",
            "chineseTranslation": "雄性激素",
            "traditionalChineseTranslation": "雄性激素",
            "lesson": 6
        },
        {
            "word": "perimetrium",
            "meaning": "The outermost layer of tissue that surrounds the uterus.",
            "chineseTranslation": "子宫膜",
            "traditionalChineseTranslation": "子宮膜",
            "explanation": "Perimetrium refers to the peritoneal covering around the uterus, a part of the female reproductive system.",
            "prefix": "peri-",
            "root": "metrium",
            "suffix": "",
            "lesson": 6
        },
        {
            "word": "myometrium",
            "prefix": "myo-",
            "root": "metr",
            "suffix": "-ium",
            "meaning": "The muscular layer of the uterine wall.",
            "explanation": "The myometrium is the middle layer of the uterine wall that is composed of smooth muscle tissue. This layer is responsible for the contractions during childbirth and menstruation.",
            "chineseTranslation": "子宫肌层",
            "traditionalChineseTranslation": "子宮肌層",
            "lesson": 6
        },
        {
            "word": "endometrium",
            "prefix": "endo-",
            "root": "metrium",
            "suffix": "",
            "meaning": "the mucous membrane lining the uterus",
            "explanation": "The endometrium is the inner lining of the uterus, which thickens during the menstrual cycle in preparation for potential implantation of a fertilized egg. If pregnancy does not occur, this lining is shed during menstruation.",
            "chineseTranslation": "子宫内膜",
            "traditionalChineseTranslation": "子宮內膜",
            "lesson": 6
        },
        {
            "word": "fertilized ovum",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A fertilized egg resulting from the union of a sperm and an ovum.",
            "explanation": "A fertilized ovum is the initial stage of development for a new organism, where the genetic material from the male and female gametes combine to form a zygote, which will eventually develop into an embryo.",
            "chineseTranslation": "受精卵",
            "traditionalChineseTranslation": "受精卵",
            "lesson": 6
        },
        {
            "word": "sloughs off",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "to shed or remove dead tissue from a wound or the surface of the skin",
            "explanation": "In medical contexts, 'sloughs off' refers to the process where dead tissue detaches from living tissue, often observed in healing wounds or skin conditions.",
            "chineseTranslation": "脱落",
            "traditionalChineseTranslation": "脫落",
            "lesson": 6
        },
        {
            "word": "menstruation",
            "prefix": "",
            "root": "menstru-",
            "suffix": "-ation",
            "meaning": "the monthly discharge of blood and mucosal tissue from the inner lining of the uterus through the vagina.",
            "explanation": "Menstruation is a natural biological process that occurs in women of reproductive age, typically occurring every 28 days, although the cycle can vary. It plays a crucial role in the reproductive system, indicating the body's readiness for potential pregnancy.",
            "chineseTranslation": "月经",
            "traditionalChineseTranslation": "月經",
            "lesson": 6
        },
        {
            "word": "anterior pituitary",
            "prefix": "anterior",
            "root": "pituitary",
            "suffix": "",
            "meaning": "The front portion of the pituitary gland that produces and secretes hormones, such as growth hormone and prolactin.",
            "explanation": "The anterior pituitary is responsible for regulating various physiological processes including stress response, growth, reproduction, and lactation by releasing hormones into the bloodstream.",
            "chineseTranslation": "前垂体",
            "traditionalChineseTranslation": "前腦垂體",
            "lesson": 6
        },
        {
            "word": "follicle stimulating hormone",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A hormone that stimulates the growth of ovarian follicles in women and spermatogenesis in men.",
            "explanation": "Follicle stimulating hormone (FSH) is produced by the anterior pituitary gland and plays a crucial role in reproductive processes, including the regulation of the menstrual cycle and sperm production.",
            "chineseTranslation": "促卵泡激素",
            "traditionalChineseTranslation": "促卵泡激素",
            "lesson": 6
        },
        {
            "word": "luteinizing hormone",
            "prefix": "",
            "root": "lutein",
            "suffix": "-izing hormone",
            "meaning": "a hormone produced by the anterior pituitary gland that stimulates ovulation in females and testosterone production in males.",
            "explanation": "Luteinizing hormone (LH) plays a crucial role in regulating the menstrual cycle and ovulation in women and is involved in the production of testosterone in men. It is essential for reproductive health and fertility.",
            "chineseTranslation": "黄体生成素",
            "traditionalChineseTranslation": "黃體生成素",
            "lesson": 6
        },
        {
            "word": "menarche",
            "prefix": "",
            "root": "menarche",
            "suffix": "",
            "meaning": "the first occurrence of menstruation",
            "explanation": "Menarche marks the beginning of a female's ability to reproduce, typically occurring during puberty when a girl reaches sexual maturity.",
            "chineseTranslation": "初潮",
            "traditionalChineseTranslation": "初潮",
            "lesson": 6
        },
        {
            "word": "perimenopause",
            "prefix": "peri-",
            "root": "menopause",
            "suffix": "",
            "meaning": "the transitional period before menopause characterized by changes in menstrual cycle and hormone levels",
            "explanation": "Perimenopause is the time leading up to menopause, which is when a woman's menstrual periods stop permanently. During perimenopause, women may experience various physical and emotional symptoms due to fluctuating hormone levels.",
            "chineseTranslation": "围绝经期",
            "traditionalChineseTranslation": "圍絕經期",
            "lesson": 6
        },
        {
            "word": "menopause",
            "prefix": "",
            "root": "meno",
            "suffix": "pause",
            "meaning": "The time in a woman's life, typically occurring between the ages of 45 and 55, when menstrual cycles permanently cease, indicating the end of reproduction.",
            "explanation": "Menopause is a natural biological process that results in the end of monthly menstrual periods and the decline in hormone production by the ovaries. Symptoms can include hot flashes, mood changes, and sleep disturbances.",
            "chineseTranslation": "绝经",
            "traditionalChineseTranslation": "絕經",
            "lesson": 6
        },
        {
            "word": "embryo",
            "prefix": "",
            "root": "embryo",
            "suffix": "",
            "meaning": "an early stage of development of a multicellular organism, particularly in the first few weeks after fertilization in humans",
            "explanation": "The embryo is the developing organism from the time of fertilization until the end of the eighth week of gestation, after which it is referred to as a fetus.",
            "chineseTranslation": "胚胎",
            "traditionalChineseTranslation": "胚胎",
            "lesson": 6
        },
        {
            "word": "fetus",
            "prefix": "",
            "root": "fetus",
            "suffix": "",
            "meaning": "the developing human from approximately eight weeks after conception until birth",
            "explanation": "A fetus is the stage of development in humans that follows the embryonic phase, typically starting around the end of the eighth week of pregnancy until birth. During this time, the major organs and systems continue to develop and mature.",
            "chineseTranslation": "胎儿",
            "traditionalChineseTranslation": "胎兒",
            "lesson": 6
        },
        {
            "word": "placenta",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the organ that develops in the uterus during pregnancy, providing oxygen and nutrients to the growing fetus and removing waste products from the baby's blood.",
            "explanation": "The placenta is a vital organ that forms during pregnancy to facilitate the exchange of nutrients, gases, and waste between the mother and the developing fetus. It attaches to the wall of the uterus and connects to the fetus via the umbilical cord.",
            "chineseTranslation": "胎盘",
            "traditionalChineseTranslation": "胎盤",
            "lesson": 6
        },
        {
            "word": "umbilical cord",
            "prefix": "",
            "root": "umbilical",
            "suffix": "cord",
            "meaning": "the flexible, tube-like structure that connects a developing fetus to the placenta, allowing for the exchange of nutrients, gases, and waste.",
            "explanation": "The umbilical cord contains blood vessels that transport oxygen and nutrients from the placenta to the fetus and return waste products from the fetus back to the placenta.",
            "chineseTranslation": "脐带",
            "traditionalChineseTranslation": "臍帶",
            "lesson": 6
        },
        {
            "word": "gestation",
            "prefix": "",
            "root": "gestation",
            "suffix": "",
            "meaning": "the period of development of an embryo or fetus in the womb from conception to birth",
            "explanation": "Gestation refers to the process of carrying or being carried in the womb between conception and birth. It involves the development of the fetus throughout the stages of pregnancy.",
            "chineseTranslation": "孕期",
            "traditionalChineseTranslation": "孕期",
            "lesson": 6
        },
        {
            "word": "amniotic fluid",
            "prefix": "",
            "root": "amniot-",
            "suffix": "-ic",
            "meaning": "the fluid that surrounds and protects the fetus in the womb",
            "explanation": "Amniotic fluid is the liquid that fills the amniotic sac and surrounds the developing fetus during pregnancy. It serves several important functions, including cushioning the fetus from physical impact, maintaining a consistent temperature, and allowing for fetal movement and growth.",
            "chineseTranslation": "羊水",
            "traditionalChineseTranslation": "羊水",
            "lesson": 6
        },
        {
            "word": "dilation stage",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The phase of labor during which the cervix gradually opens (dilates) to allow the baby to pass through the birth canal.",
            "explanation": "In obstetrics, the dilation stage is part of the labor process that marks the beginning of childbirth, characterized by the gradual widening of the cervical opening.",
            "chineseTranslation": "扩张阶段",
            "traditionalChineseTranslation": "擴張階段",
            "lesson": 6
        },
        {
            "word": "expulsion stage",
            "prefix": "ex-",
            "root": "pul",
            "suffix": "ion",
            "meaning": "the process of being expelled or forced out, particularly in the context of childbirth",
            "explanation": "The expulsion stage refers to the final stage of labor where the baby is delivered through the birth canal.",
            "chineseTranslation": "排出阶段",
            "traditionalChineseTranslation": "排出階段",
            "lesson": 6
        },
        {
            "word": "placenta stage",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the final stage of labor during which the placenta is expelled from the uterus after the birth of the baby",
            "explanation": "The placenta stage occurs after the baby is born, involving the separation and expulsion of the placenta from the uterine wall. This stage is crucial for preventing complications such as postpartum hemorrhage.",
            "chineseTranslation": "胎盘期",
            "traditionalChineseTranslation": "胎盤期",
            "lesson": 6
        },
        {
            "word": "lactation",
            "prefix": "",
            "root": "lact",
            "suffix": "-ation",
            "meaning": "the process of producing milk from the mammary glands",
            "explanation": "Lactation is a biological process that occurs in mammals, during which milk is produced and secreted by the mammary glands to feed infants.",
            "chineseTranslation": "哺乳",
            "traditionalChineseTranslation": "哺乳",
            "lesson": 6
        },
        {
            "word": "obstetrics",
            "prefix": "ob-",
            "root": "stetr-",
            "suffix": "-ics",
            "meaning": "the branch of medicine concerned with childbirth and the care of women giving birth",
            "explanation": "Obstetrics is a medical specialty that focuses on pregnancy, childbirth, and the postpartum period, ensuring the health and safety of both mother and baby.",
            "chineseTranslation": "产科",
            "traditionalChineseTranslation": "產科",
            "lesson": 6
        },
        {
            "word": "neonatology",
            "prefix": "neo-",
            "root": "nato",
            "suffix": "-logy",
            "meaning": "the branch of medicine that deals with the care, diagnoses, and treatment of newly born infants, especially the ill or premature newborns",
            "explanation": "Neonatology is a subspecialty of pediatrics that focuses on the medical care of newborns, particularly those requiring special attention, such as premature infants and those with various medical conditions.",
            "chineseTranslation": "新生儿学",
            "traditionalChineseTranslation": "新生兒學",
            "lesson": 6
        },
        {
            "word": "puberty",
            "prefix": "",
            "root": "puber",
            "suffix": "-ty",
            "meaning": "The period during which adolescents reach sexual maturity and become capable of reproduction.",
            "explanation": "Puberty is a biological phase marked by physical and hormonal changes that lead to sexual maturity, typically beginning in early adolescence and resulting in changes such as growth of body hair, development of breasts in females, and deepening of the voice in males.",
            "chineseTranslation": "青春期",
            "traditionalChineseTranslation": "青春期",
            "lesson": 6
        },
        {
            "word": "premenstrual syndrome",
            "meaning": "A group of physical and emotional symptoms that occur in the lead-up to a woman's menstrual period.",
            "chineseTranslation": "經前綜合症",
            "traditionalChineseTranslation": "經前綜合症",
            "explanation": "Premenstrual syndrome (PMS) encompasses a variety of symptoms, including mood swings, irritability, bloating, and breast tenderness that affect women in the days preceding menstruation.",
            "prefix": "pre-",
            "root": "menstru",
            "suffix": "-al syndrome",
            "lesson": 6
        },
        {
            "word": "last menstrual period",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the most recent occurrence of menstruation; used in the context of calculating gestational age in pregnancy",
            "explanation": "The last menstrual period (LMP) is a commonly used reference point in obstetrics to estimate a woman's due date and the stage of pregnancy. It marks the last time the woman had menstrual bleeding before becoming pregnant.",
            "chineseTranslation": "最后一次月经",
            "traditionalChineseTranslation": "最後一次月經",
            "lesson": 6
        },
        {
            "word": "amenorrhea",
            "prefix": "a-",
            "root": "men",
            "suffix": "-rrhea",
            "meaning": "absence of menstrual periods",
            "explanation": "Amenorrhea is a medical condition characterized by the absence of menstruation. It can occur in women of reproductive age, and can be caused by various factors such as hormonal imbalances, pregnancy, stress, or excessive exercise.",
            "chineseTranslation": "經期缺失",
            "traditionalChineseTranslation": "經期缺失",
            "lesson": 6
        },
        {
            "word": "dysmenorrhea",
            "prefix": "dys-",
            "root": "menorrhea",
            "suffix": "",
            "meaning": "painful menstruation",
            "explanation": "Dysmenorrhea refers to the severe and frequent menstrual cramps and pain that can occur just before or during a woman's menstrual period. It can be classified as primary (not associated with any underlying condition) or secondary (related to underlying conditions like endometriosis or fibroids).",
            "chineseTranslation": "痛经",
            "traditionalChineseTranslation": "痛經",
            "lesson": 6
        },
        {
            "word": "oligomenorrhea",
            "meaning": "a condition characterized by infrequent menstrual periods",
            "chineseTranslation": "稀发月经",
            "traditionalChineseTranslation": "稀發月經",
            "explanation": "Oligomenorrhea refers to a menstrual cycle that occurs at intervals greater than 35 days, indicating fewer than six to eight cycles per year.",
            "prefix": "oligo-",
            "root": "menorrhea",
            "suffix": "",
            "lesson": 6
        },
        {
            "word": "menometrorrhagia",
            "prefix": "meno-",
            "root": "metr-",
            "suffix": "-rrhagia",
            "meaning": "excessive bleeding from the uterus during and between menstrual periods",
            "explanation": "Menometrorrhagia is a medical condition characterized by prolonged or heavy bleeding from the uterus, which occurs both during the menstrual cycle and at irregular intervals between periods. This condition can be caused by a variety of factors, including hormonal imbalances, uterine fibroids, or certain medical conditions.",
            "chineseTranslation": "月經過多",
            "traditionalChineseTranslation": "月經過多",
            "lesson": 6
        },
        {
            "word": "prolapsed uterus",
            "prefix": "pro-",
            "root": "lapse",
            "suffix": "",
            "meaning": "a condition in which the uterus slips or descends from its normal position into the vaginal canal",
            "explanation": "Prolapse of the uterus occurs when the pelvic floor muscles and ligaments become weakened, allowing the uterus to fall into the vagina and can cause discomfort and other complications.",
            "chineseTranslation": "子宫脱垂",
            "traditionalChineseTranslation": "子宮脫垂",
            "lesson": 6
        },
        {
            "word": "endometriosis",
            "prefix": "endo-",
            "root": "metri-",
            "suffix": "-osis",
            "meaning": "A condition in which tissue that normally lines the inside of the uterus grows outside the uterus.",
            "explanation": "Endometriosis is a painful disorder in which endometrial-like tissue grows outside the uterus, leading to inflammation, pain, and potentially fertility problems.",
            "chineseTranslation": "子宮內膜異位症",
            "traditionalChineseTranslation": "子宮內膜異位症",
            "lesson": 6
        },
        {
            "word": "pelvic inflammatory disease",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a condition characterized by inflammation of the female reproductive organs, often caused by infection.",
            "explanation": "Pelvic inflammatory disease (PID) typically occurs when sexually transmitted bacteria spread from the vagina to the uterus, fallopian tubes, or ovaries, leading to inflammation and infection.",
            "chineseTranslation": "盆腔炎",
            "traditionalChineseTranslation": "盆腔炎",
            "lesson": 6
        },
        {
            "word": "uterine fibroid tumor",
            "prefix": "",
            "root": "uterine, fibroid, tumor",
            "suffix": "",
            "meaning": "A benign tumor that develops in the uterus, often composed of muscle and fibrous tissue.",
            "explanation": "Uterine fibroid tumors, also known as leiomyomas or myomas, are non-cancerous growths that occur in the muscular wall of the uterus. They can vary in size and number and may cause symptoms such as heavy menstrual bleeding, pelvic pain, and pressure on the bladder or rectum.",
            "chineseTranslation": "子宫肌瘤",
            "traditionalChineseTranslation": "子宮肌瘤",
            "lesson": 6
        },
        {
            "word": "cervical cancer",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Cancer that occurs in the cervix, the lower part of the uterus that connects to the vagina.",
            "explanation": "Cervical cancer primarily develops from precancerous changes in the cervical cells, commonly caused by persistent infection with certain strains of human papillomavirus (HPV). Screening tests and vaccinations can help prevent the disease.",
            "chineseTranslation": "宫颈癌",
            "traditionalChineseTranslation": "宮頸癌",
            "lesson": 6
        },
        {
            "word": "oral contraceptive pills",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "medications taken by mouth to prevent pregnancy",
            "explanation": "Oral contraceptive pills are hormonal medications that women take to regulate their menstrual cycle and reduce the risk of pregnancy. They typically contain synthetic forms of estrogen and progesterone, which prevent ovulation.",
            "chineseTranslation": "口服避孕药",
            "traditionalChineseTranslation": "口服避孕藥",
            "lesson": 6
        },
        {
            "word": "in vitro fertilization",
            "prefix": "",
            "root": "vitro (from Latin, meaning 'glass')",
            "suffix": "",
            "meaning": "A medical procedure whereby an egg is fertilized by sperm outside the body in a laboratory.",
            "explanation": "In vitro fertilization (IVF) involves retrieving eggs from a woman's ovaries and fertilizing them with sperm in a laboratory setting. The resulting embryo(s) can then be implanted into the woman's uterus.",
            "chineseTranslation": "体外受精",
            "traditionalChineseTranslation": "體外受精",
            "lesson": 6
        },
        {
            "word": "cesarean section",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A surgical procedure in which a baby is delivered through an incision in the mother's abdomen and uterus.",
            "explanation": "The cesarean section, often referred to as a C-section, is used when a vaginal delivery would put the baby or mother at risk. Indications for a cesarean include abnormal fetal positioning, maternal health issues, or labor complications.",
            "chineseTranslation": "剖腹產",
            "traditionalChineseTranslation": "剖腹產",
            "lesson": 6
        },
        {
            "word": "preeclampsia",
            "prefix": "pre-",
            "root": "eclampsia",
            "suffix": "",
            "meaning": "a condition in pregnancy characterized by high blood pressure and signs of damage to another organ system, often the kidneys.",
            "explanation": "Preeclampsia occurs after the 20th week of pregnancy and can lead to severe complications for both mother and baby if untreated.",
            "chineseTranslation": "子痫前期",
            "traditionalChineseTranslation": "子癲前期",
            "lesson": 6
        },
        {
            "word": "hemolytic disease of the newborn",
            "prefix": "hemo-",
            "root": "lytic",
            "suffix": "disease of the newborn",
            "meaning": "a condition in newborns characterized by the destruction of red blood cells, often due to incompatibility between the mother's and baby's blood types",
            "explanation": "Hemolytic disease of the newborn occurs when the mother's immune system produces antibodies that destroy the baby's red blood cells, leading to anemia and jaundice. It can happen in cases of Rh incompatibility or ABO incompatibility.",
            "chineseTranslation": "新生儿溶血病",
            "traditionalChineseTranslation": "新生兒溶血病",
            "lesson": 6
        },
        {
            "word": "pap smear",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a procedure to test for cervical cancer in women by collecting cells from the cervix",
            "explanation": "A Pap smear, or Papanicolaou test, involves collecting cells from the cervix and examining them for abnormalities, which can indicate precancerous or cancerous changes. Regular Pap smears can aid in early detection of cervical cancer and other conditions.",
            "chineseTranslation": "宫颈涂片",
            "traditionalChineseTranslation": "宮頸塗片",
            "lesson": 6
        },
        {
            "word": "human papilloma virus",
            "prefix": "human-",
            "root": "papilloma",
            "suffix": "-virus",
            "meaning": "A virus that causes warts and is associated with various cancers, particularly cervical cancer.",
            "explanation": "Human papillomavirus (HPV) is a group of more than 200 related viruses, some of which can cause warts, while others can lead to cancer. It is primarily transmitted through intimate skin-to-skin contact.",
            "chineseTranslation": "人类乳头瘤病毒",
            "traditionalChineseTranslation": "人類乳頭瘤病毒",
            "lesson": 6
        },
        {
            "word": "mastectomy",
            "prefix": "masto-",
            "root": "ectom",
            "suffix": "-y",
            "meaning": "surgical removal of one or both breasts",
            "explanation": "Mastectomy is a surgical procedure to remove one or both breasts, typically to treat or prevent breast cancer.",
            "chineseTranslation": "乳房切除术",
            "traditionalChineseTranslation": "乳房切除術",
            "lesson": 6
        },
        {
            "word": "hysterectomy",
            "prefix": "hystero-",
            "root": "-ectomy",
            "suffix": "",
            "meaning": "surgical removal of the uterus",
            "explanation": "A hysterectomy is a surgical procedure to remove the uterus, which may be performed for various medical reasons including uterine fibroids, endometriosis, or cancer.",
            "chineseTranslation": "子宫切除术",
            "traditionalChineseTranslation": "子宮切除術",
            "lesson": 6
        },
        {
            "word": "sperm",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the male reproductive cell or gamete in sexual reproduction",
            "explanation": "Sperm are the reproductive cells produced by male organisms. In humans and many other organisms, sperm cells swim through the female reproductive tract to fertilize an egg cell, leading to conception.",
            "chineseTranslation": "精子",
            "traditionalChineseTranslation": "精子",
            "lesson": 6
        },
        {
            "word": "testosterone",
            "prefix": "",
            "root": "testis",
            "suffix": "-one",
            "meaning": "a steroid hormone primarily produced in the testes that is responsible for the development of male secondary sexual characteristics.",
            "explanation": "Testosterone is the main male sex hormone and an anabolic steroid. It plays a key role in the development of male reproductive tissues, as well as promoting secondary sexual characteristics such as increased muscle and bone mass, and the growth of body hair.",
            "chineseTranslation": "睾酮",
            "traditionalChineseTranslation": "睾酮",
            "lesson": 6
        },
        {
            "word": "penis",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The male sexual organ that carries the urethra and serves as the external organ for sexual intercourse.",
            "explanation": "The penis is involved in urination and sexual reproduction. It is made up of erectile tissue that can fill with blood to become erect during sexual arousal.",
            "chineseTranslation": "阴茎",
            "traditionalChineseTranslation": "陰莖",
            "lesson": 6
        },
        {
            "word": "scrotum",
            "prefix": "",
            "root": "scrot-",
            "suffix": "-um",
            "meaning": "the pouch of skin containing the testicles",
            "explanation": "The scrotum is a part of the male anatomy that houses and protects the testicles, which produce sperm and hormones. It helps to regulate the temperature of the testicles, which is critical for sperm production.",
            "chineseTranslation": "阴囊",
            "traditionalChineseTranslation": "陰囊",
            "lesson": 6
        },
        {
            "word": "testicles",
            "prefix": "",
            "root": "testic-",
            "suffix": "-les",
            "meaning": "the male reproductive glands that produce sperm and testosterone",
            "explanation": "Testicles are paired organs located in the scrotum that are responsible for producing male reproductive cells (sperm) and hormones such as testosterone, which plays a key role in male sexual development and function.",
            "chineseTranslation": "睾丸",
            "traditionalChineseTranslation": "睾丸",
            "lesson": 6
        },
        {
            "word": "epididymis",
            "prefix": "epi-",
            "root": "didymis",
            "suffix": "",
            "meaning": "A coiled tube where sperm mature and are stored, located at the back of each testis.",
            "explanation": "The epididymis is responsible for the proper maturation of sperm cells and plays a crucial role in the male reproductive system.",
            "chineseTranslation": "附睾",
            "traditionalChineseTranslation": "附睾",
            "lesson": 6
        },
        {
            "word": "seminal vesicles",
            "prefix": "",
            "root": "seminal",
            "suffix": "vesicles",
            "meaning": "The glands that produce a significant portion of the fluid that becomes semen.",
            "explanation": "The seminal vesicles are paired glands located behind the bladder in males. They secrete a fluid that nourishes and helps transport sperm during ejaculation.",
            "chineseTranslation": "精囊",
            "traditionalChineseTranslation": "精囊",
            "lesson": 6
        },
        {
            "word": "vas deferens",
            "meaning": "The duct that transports sperm from the epididymis to the ejaculatory duct.",
            "chineseTranslation": "输精管",
            "traditionalChineseTranslation": "輸精管",
            "explanation": "The vas deferens is a muscular tube that carries sperm from the testicles to the urethra.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "lesson": 6
        },
        {
            "word": "ejaculatory duct",
            "prefix": "",
            "root": "ejaculat- (from ejaculate)",
            "suffix": "ory (related to)",
            "meaning": "the duct that carries sperm from the seminal vesicles to the urethra",
            "explanation": "The ejaculatory duct is formed by the joining of the vas deferens and the duct of the seminal vesicle, facilitating the passage of sperm during ejaculation.",
            "chineseTranslation": "射精管",
            "traditionalChineseTranslation": "射精管",
            "lesson": 6
        },
        {
            "word": "prostate gland",
            "prefix": "pro-",
            "root": "state",
            "suffix": "gland",
            "meaning": "A gland in the male reproductive system that produces fluid for semen.",
            "explanation": "The prostate gland is located below the bladder and surrounds the urethra. It plays a crucial role in male fertility by producing prostate fluid, a component of semen that nourishes and transports sperm.",
            "chineseTranslation": "前列腺",
            "traditionalChineseTranslation": "前列腺",
            "lesson": 6
        },
        {
            "word": "bulbourethral glands",
            "prefix": "",
            "root": "bulbo- (bulb) + urethral (urethra)",
            "suffix": "glands",
            "meaning": "Glands that secrete a pre-ejaculate fluid to lubricate the urethra.",
            "explanation": "The bulbourethral glands are two small glands located near the base of the penis, which produce a clear fluid that neutralizes acidity in the urethra and helps to lubricate it during sexual arousal.",
            "chineseTranslation": "球尿道腺",
            "traditionalChineseTranslation": "球尿道腺",
            "lesson": 6
        },
        {
            "word": "benign prostatic hyperplasia",
            "prefix": "benign",
            "root": "prostatic, hyperplasia",
            "suffix": "",
            "meaning": "a non-cancerous enlargement of the prostate gland",
            "explanation": "Benign prostatic hyperplasia (BPH) is a condition in which the prostate gland is enlarged but not malignant. It can cause urinary issues due to pressure on the urethra.",
            "chineseTranslation": "良性前列腺增生",
            "traditionalChineseTranslation": "良性前列腺增生",
            "lesson": 6
        },
        {
            "word": "prostatitis",
            "prefix": "pro-",
            "root": "stat",
            "suffix": "-itis",
            "meaning": "inflammation of the prostate gland",
            "explanation": "Prostatitis is an inflammation of the prostate gland that can cause symptoms such as pain in the pelvic area, difficulty urinating, and flu-like symptoms. It can be caused by bacterial infection or other factors and may require medical treatment.",
            "chineseTranslation": "前列腺炎",
            "traditionalChineseTranslation": "前列腺炎",
            "lesson": 6
        },
        {
            "word": "erectile dysfunction",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the inability to achieve or maintain an erection sufficient for satisfactory sexual performance",
            "explanation": "Erectile dysfunction (ED) can result from various factors including psychological issues, medical conditions, or medication side effects. It is a common condition that affects many men.",
            "chineseTranslation": "勃起功能障碍",
            "traditionalChineseTranslation": "勃起功能障礙",
            "lesson": 6
        },
        {
            "word": "infertility",
            "prefix": "in-",
            "root": "fertile",
            "suffix": "-ity",
            "meaning": "the inability to conceive a child or the inability of a female to produce an egg.",
            "explanation": "Infertility is a medical condition affecting both men and women, characterized by the failure to achieve pregnancy after one year of unprotected intercourse. It can result from various factors, including hormonal imbalances, blockages in the reproductive system, and other health issues.",
            "chineseTranslation": "不孕症",
            "traditionalChineseTranslation": "不孕症",
            "lesson": 6
        },
        {
            "word": "venereal disease",
            "prefix": "",
            "root": "venere-",
            "suffix": "disease",
            "meaning": "a sexually transmitted infection (STI) typically acquired through sexual intercourse.",
            "explanation": "Venereal diseases are infections that are usually spread through sexual contact, and they can affect the reproductive organs, as well as other systems in the body.",
            "chineseTranslation": "性病",
            "traditionalChineseTranslation": "性病",
            "lesson": 6
        },
        {
            "word": "sterility",
            "prefix": "",
            "root": "steril-",
            "suffix": "-ity",
            "meaning": "The state of being free from bacteria or other living microorganisms.",
            "explanation": "Sterility is crucial in medical contexts, especially in surgical procedures and laboratory settings, where the presence of microorganisms can lead to infections or contamination.",
            "chineseTranslation": "无菌性",
            "traditionalChineseTranslation": "無菌性",
            "lesson": 6
        },
        {
            "word": "spermatogenesis",
            "prefix": "spermat-",
            "root": "genesis",
            "suffix": "",
            "meaning": "the process of sperm cell development",
            "explanation": "Spermatogenesis is the biological process through which male gametes, or sperm cells, are produced in the testes. This process involves several stages of cell division and maturation.",
            "chineseTranslation": "精子发生",
            "traditionalChineseTranslation": "精子發生",
            "lesson": 6
        },
        {
            "word": "sterilization",
            "prefix": "steril-",
            "root": "steril",
            "suffix": "-ization",
            "meaning": "the process of making something free from bacteria or other living microorganisms",
            "explanation": "Sterilization is a crucial process in medical settings to eliminate pathogens and ensure that instruments or surfaces are safe for use in procedures.",
            "chineseTranslation": "灭菌",
            "traditionalChineseTranslation": "滅菌",
            "lesson": 6
        },
        {
            "word": "vasectomy",
            "meaning": "A surgical procedure for male sterilization or permanent contraception by cutting the vas deferens.",
            "chineseTranslation": "输精管切除术",
            "traditionalChineseTranslation": "輸精管切除術",
            "explanation": "During a vasectomy, the vas deferens is cut and sealed to prevent sperm from mixing with semen during ejaculation.",
            "prefix": "",
            "root": "vas",
            "suffix": "ectomy",
            "lesson": 6
        },
        {
            "word": "circumcision",
            "prefix": "circum-",
            "root": "cision",
            "suffix": "",
            "meaning": "the surgical removal of the foreskin from the penis",
            "explanation": "Circumcision is a medical procedure often performed on newborns, where the foreskin covering the glans (tip) of the penis is removed. It can also be done for religious or cultural reasons.",
            "chineseTranslation": "割包皮",
            "traditionalChineseTranslation": "割包皮",
            "lesson": 6
        }
    ]
}