{
    "version": "0.0.1",
    "words": [
        {
            "word": "central nervous system",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the nervous system consisting of the brain and spinal cord.",
            "explanation": "The central nervous system (CNS) is responsible for processing and transmitting information throughout the body, coordinating activities, and controlling behaviors.",
            "chineseTranslation": "中枢神经系统",
            "traditionalChineseTranslation": "中樞神經系統",
            "lesson": 7
        },
        {
            "word": "peripheral nervous system",
            "prefix": "peri-",
            "root": "neuro",
            "suffix": "system",
            "meaning": "The part of the nervous system that is outside the brain and spinal cord, including nerves and ganglia.",
            "explanation": "The peripheral nervous system (PNS) connects the central nervous system (CNS) to the limbs and organs. It is responsible for transmitting sensory information to the central nervous system and motor commands from the central nervous system to the muscles.",
            "chineseTranslation": "周围神经系统",
            "traditionalChineseTranslation": "周圍神經系統",
            "lesson": 7
        },
        {
            "word": "afferent",
            "prefix": "af-",
            "root": "ferre",
            "suffix": "",
            "meaning": "conveying toward a center, especially in relation to nerves bringing signals to the central nervous system",
            "explanation": "Afferent refers to the direction of the flow of signals in the nervous system, particularly sensory input traveling towards the brain.",
            "chineseTranslation": "传入的",
            "traditionalChineseTranslation": "傳入的",
            "lesson": 7
        },
        {
            "word": "efferent",
            "prefix": "e-",
            "root": "ferre",
            "suffix": "",
            "meaning": "carrying away from a central organ or point",
            "explanation": "Efferent refers to nerves or vessels that carry signals or blood away from an organ or central nervous system. For example, efferent neurons transmit commands from the brain to muscles.",
            "chineseTranslation": "传导神经的",
            "traditionalChineseTranslation": "傳導神經的",
            "lesson": 7
        },
        {
            "word": "sympathetic nerves",
            "prefix": "sym-",
            "root": "pathetic",
            "suffix": "-ic",
            "meaning": "a part of the autonomic nervous system that is responsible for the body's 'fight or flight' response",
            "explanation": "Sympathetic nerves are part of the autonomic nervous system that prepare the body for stressful or emergency situations by increasing heart rate, dilating airways, and inhibiting digestion, among other functions.",
            "chineseTranslation": "交感神经",
            "traditionalChineseTranslation": "交感神經",
            "lesson": 7
        },
        {
            "word": "parasympathetic nerves",
            "prefix": "para-",
            "root": "sympathetic",
            "suffix": "",
            "meaning": "The part of the autonomic nervous system that conserves energy and induces the 'rest and digest' response.",
            "explanation": "Parasympathetic nerves are responsible for the body's rest and recovery functions. They help control bodily functions when at rest, slowing heart rate, increasing intestinal and gland activity, and relaxing sphincter muscles.",
            "chineseTranslation": "副交感神经",
            "traditionalChineseTranslation": "副交感神經",
            "lesson": 7
        },
        {
            "word": "cranial nerves",
            "meaning": "nerves that emerge directly from the brain and brainstem, primarily responsible for sensory and motor functions of the head and neck",
            "chineseTranslation": "脑神经",
            "traditionalChineseTranslation": "腦神經",
            "explanation": "Cranial nerves are a set of twelve pairs of nerves that originate in the brain, including both sensory and motor pathways that facilitate functions such as taste, smell, vision, and facial movements.",
            "prefix": "",
            "root": "",
            "suffix": "",
            "additionalProperties": false,
            "lesson": 7
        },
        {
            "word": "spinal nerves",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The nerves that originate from the spinal cord and transmit signals between the spinal cord and the body.",
            "explanation": "Spinal nerves are a part of the peripheral nervous system and are responsible for both sensory and motor function to various parts of the body. They emerge from the spinal cord and are crucial for communication between the central nervous system and the limbs and trunk.",
            "chineseTranslation": "脊神经",
            "traditionalChineseTranslation": "脊神經",
            "lesson": 7
        },
        {
            "word": "sensory nerves",
            "meaning": "nerves that transmit sensory information to the brain",
            "chineseTranslation": "感覺神經",
            "traditionalChineseTranslation": "感覺神經",
            "explanation": "Sensory nerves are responsible for carrying signals from sensory receptors to the central nervous system, allowing the body to perceive sensations such as touch, pain, temperature, and pressure.",
            "prefix": "sen-",
            "root": "sory",
            "suffix": "",
            "lesson": 7
        },
        {
            "word": "motor nerves",
            "prefix": "",
            "root": "motor",
            "suffix": "nerves",
            "meaning": "Nerves that carry signals from the brain to the muscles, enabling movement.",
            "explanation": "Motor nerves are responsible for transmitting signals from the central nervous system to the muscles, facilitating voluntary and involuntary movements.",
            "chineseTranslation": "运动神经",
            "traditionalChineseTranslation": "運動神經",
            "lesson": 7
        },
        {
            "word": "electrical impulses",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "Signals generated by the nervous system to communicate with different parts of the body.",
            "explanation": "Electrical impulses are rapid signals that travel along the nerves and are responsible for transmitting information throughout the nervous system. They are essential for functions such as muscle contraction and sensory perception.",
            "chineseTranslation": "电信号",
            "traditionalChineseTranslation": "電信號",
            "lesson": 7
        },
        {
            "word": "stimuli",
            "prefix": "",
            "root": "stimulus",
            "suffix": "li",
            "meaning": "A signal or event that provokes a response in an organism or system.",
            "explanation": "In a biological context, stimuli can refer to any external or internal factor that triggers an action or reaction in an organism. This can include physical changes, chemicals, light, and sounds.",
            "chineseTranslation": "刺激",
            "traditionalChineseTranslation": "刺激",
            "lesson": 7
        },
        {
            "word": "nerve cell body",
            "meaning": "The part of a neuron that contains the nucleus and cytoplasm; it integrates signals from dendrites and sends signals down the axon.",
            "chineseTranslation": "神经细胞体",
            "traditionalChineseTranslation": "神經細胞體",
            "explanation": "The nerve cell body (also known as the soma) is critical for the overall function of the neuron, serving as the center for metabolic activity and signal integration.",
            "prefix": "",
            "root": "nerve",
            "suffix": "cell body",
            "lesson": 7
        },
        {
            "word": "dendrites",
            "prefix": "",
            "root": "dendrit-",
            "suffix": "-es",
            "meaning": "the short branched projections of a neuron that receive impulses from other cells",
            "explanation": "Dendrites are part of a neuron that branch out from the cell body, receiving chemical signals from other neurons and transmitting the information towards the cell body.",
            "chineseTranslation": "树突",
            "traditionalChineseTranslation": "樹突",
            "lesson": 7
        },
        {
            "word": "axon",
            "prefix": "",
            "root": "axon",
            "suffix": "",
            "meaning": "the long threadlike part of a nerve cell along which impulses are conducted from the cell body to other cells.",
            "explanation": "An axon is a part of a neuron, responsible for transmitting electrical signals away from the neuron's cell body to other neurons or muscle cells.",
            "chineseTranslation": "轴突",
            "traditionalChineseTranslation": "軸突",
            "lesson": 7
        },
        {
            "word": "synapse",
            "prefix": "",
            "root": "syn- (together) + apse (to clasp)",
            "suffix": "",
            "meaning": "The junction between two nerve cells, where an impulse is transmitted from one neuron to another.",
            "explanation": "Synapses are crucial for the communication within the nervous system, allowing signals to be transmitted across gaps between neurons.",
            "chineseTranslation": "突触",
            "traditionalChineseTranslation": "突觸",
            "lesson": 7
        },
        {
            "word": "synaptic cleft",
            "meaning": "The small gap between the axon terminal of one neuron and the dendrite or cell body of another neuron, where neurotransmitters are released.",
            "chineseTranslation": "突触间隙",
            "traditionalChineseTranslation": "突觸間隙",
            "explanation": "The synaptic cleft is crucial for the transmission of signals between neurons, allowing for communication within the nervous system through chemical signaling.",
            "prefix": "",
            "root": "synaptic",
            "suffix": "cleft",
            "lesson": 7
        },
        {
            "word": "neurotransmitters",
            "meaning": "Chemical substances that transmit signals across a synapse from one neuron to another in the nervous system.",
            "chineseTranslation": "神經遞質",
            "traditionalChineseTranslation": "神經遞質",
            "explanation": "Neurotransmitters are crucial for communication between neurons and play a significant role in various bodily functions, mood regulation, and cognition.",
            "prefix": "neuro-",
            "root": "transmit",
            "suffix": "-ters",
            "lesson": 7
        },
        {
            "word": "myelin sheath",
            "prefix": "myel-",
            "root": "sheath",
            "suffix": "",
            "meaning": "a protective covering that surrounds nerve fibers, enhancing the speed of electrical signal transmission",
            "explanation": "The myelin sheath is a fatty layer that insulates nerve cells, allowing for more efficient transmission of electrical impulses along the nerve fibers.",
            "chineseTranslation": "髓鞘",
            "traditionalChineseTranslation": "髓鞘",
            "lesson": 7
        },
        {
            "word": "conductor",
            "meaning": "A person who leads or directs a group, often in a medical setting, such as a conductor of a medical team or in relation to the conduction of stimuli in the nervous system.",
            "chineseTranslation": "导体",
            "traditionalChineseTranslation": "導體",
            "explanation": "In medicine, the term can refer to the role of a person guiding healthcare processes or the physiological term related to how signals are conducted in the body, especially in neurons and the heart.",
            "prefix": "",
            "root": "duct",
            "suffix": "or",
            "lesson": 7
        },
        {
            "word": "insulator",
            "prefix": "in-",
            "root": "sul",
            "suffix": "-ator",
            "meaning": "a material that prevents the flow of electric current or heat.",
            "explanation": "Insulators are used in electrical applications to provide a barrier that restricts the movement of electric charges or heat flow, thereby ensuring safety and efficiency.",
            "chineseTranslation": "绝缘体",
            "traditionalChineseTranslation": "絕緣體",
            "lesson": 7
        },
        {
            "word": "glutamate",
            "prefix": "",
            "root": "glutam-",
            "suffix": "ate",
            "meaning": "An amino acid that acts as a neurotransmitter in the brain.",
            "explanation": "Glutamate is the most abundant excitatory neurotransmitter in the vertebrate nervous system. It plays a critical role in synaptic plasticity, which is essential for learning and memory.",
            "chineseTranslation": "谷氨酸",
            "traditionalChineseTranslation": "谷氨酸",
            "lesson": 7
        },
        {
            "word": "gamma-aminobutyric acid",
            "meaning": "A neurotransmitter in the brain that inhibits nerve transmission, helping to regulate mood and anxiety.",
            "chineseTranslation": "伽马氨基丁酸",
            "traditionalChineseTranslation": "伽馬氨基丁酸",
            "explanation": "Gamma-aminobutyric acid (GABA) is a significant inhibitory neurotransmitter in the central nervous system. It plays a crucial role in reducing neuronal excitability throughout the nervous system.",
            "prefix": "gamma-",
            "root": "aminobutyric",
            "suffix": "acid",
            "lesson": 7
        },
        {
            "word": "monoamines",
            "prefix": "mono-",
            "root": "amine",
            "suffix": "",
            "meaning": "A type of neurotransmitter derived from amino acids, which contains one amino group.",
            "explanation": "Monoamines are important for various physiological functions, including mood regulation and cognitive processes. Examples include serotonin, dopamine, and norepinephrine.",
            "chineseTranslation": "单胺",
            "traditionalChineseTranslation": "單胺",
            "lesson": 7
        },
        {
            "word": "dopamine",
            "prefix": "",
            "root": "dopa",
            "suffix": "amine",
            "meaning": "A neurotransmitter that plays several important roles in the brain and body, including mood regulation, reward, and movement control.",
            "explanation": "Dopamine is a chemical messenger involved in transmitting signals in the brain and other areas of the body. It is crucial for motivation, pleasure, and motor control. Abnormal levels of dopamine are associated with various conditions, including Parkinson’s disease and schizophrenia.",
            "chineseTranslation": "多巴胺",
            "traditionalChineseTranslation": "多巴胺",
            "lesson": 7
        },
        {
            "word": "serotonin",
            "prefix": "",
            "root": "seroton",
            "suffix": "",
            "meaning": "a neurotransmitter that affects mood, emotion, and sleep.",
            "explanation": "Serotonin is a chemical found in the brain, blood, and digestive system that helps regulate mood, anxiety, and happiness. It is often referred to as the 'feel-good' neurotransmitter because it contributes to feelings of well-being and happiness.",
            "chineseTranslation": "血清素",
            "traditionalChineseTranslation": "血清素",
            "lesson": 7
        },
        {
            "word": "norepinephrine",
            "prefix": "nor-",
            "root": "epinephrine",
            "suffix": "",
            "meaning": "a hormone and neurotransmitter involved in the body's 'fight or flight' response, increasing heart rate and blood pressure.",
            "explanation": "Norepinephrine is released from the adrenal glands and acts on various receptors in the body, notably increasing blood flow to muscles and directing blood away from non-essential organs during stress.",
            "chineseTranslation": "去甲肾上腺素",
            "traditionalChineseTranslation": "去甲腎上腺素",
            "lesson": 7
        },
        {
            "word": "acetylcholine",
            "prefix": "acetyl-",
            "root": "choline",
            "suffix": "",
            "meaning": "a neurotransmitter that acts at the neuromuscular junction and is involved in many functions, including muscle contraction and memory",
            "explanation": "Acetylcholine is crucial for the transmission of nerve impulses to muscles and is also involved in various brain processes, including arousal, attention, and memory encoding.",
            "chineseTranslation": "乙酰胆碱",
            "traditionalChineseTranslation": "乙酰膽鹼",
            "lesson": 7
        },
        {
            "word": "neuropeptides",
            "prefix": "neuro-",
            "root": "peptide",
            "suffix": "",
            "meaning": "short chains of amino acids that are involved in neurotransmission",
            "explanation": "Neuropeptides are small protein-like molecules used by neurons to communicate with each other. They typically modulate neurotransmitter release and have various functions in the brain and body, influencing processes such as pain, reward, food intake, and stress.",
            "chineseTranslation": "神经肽",
            "traditionalChineseTranslation": "神經肽",
            "lesson": 7
        },
        {
            "word": "endorphins",
            "prefix": "",
            "root": "endorphin",
            "suffix": "",
            "meaning": "A group of hormones released by the pituitary gland that act as natural painkillers and mood enhancers.",
            "explanation": "Endorphins are neurotransmitters in the brain that help alleviate pain and induce feelings of pleasure or euphoria. They are often released during exercise, excitement, pain, and love.",
            "chineseTranslation": "内啡肽",
            "traditionalChineseTranslation": "內啡肽",
            "lesson": 7
        },
        {
            "word": "substance P",
            "prefix": "sub-",
            "root": "stance",
            "suffix": "P",
            "meaning": "A neuropeptide that functions as a neurotransmitter and is involved in the transmission of pain.",
            "explanation": "Substance P is a peptide that is primarily found in the nervous system and plays a crucial role in pain perception and inflammatory processes.",
            "chineseTranslation": "P物质",
            "traditionalChineseTranslation": "P物質",
            "lesson": 7
        },
        {
            "word": "nitric oxide",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a colorless gas with the chemical formula NO, playing a role in various physiological processes including vasodilation.",
            "explanation": "Nitric oxide is a signaling molecule in the body, involved in important processes such as relaxing blood vessels, helping to regulate blood pressure, and having roles in the immune response.",
            "chineseTranslation": "一氧化氮",
            "traditionalChineseTranslation": "一氧化氮",
            "lesson": 7
        },
        {
            "word": "gray matter",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The darker-colored area of the brain and spinal cord that is made up primarily of neuronal cell bodies, dendrites, and unmyelinated axons.",
            "explanation": "Gray matter is crucial for processing and regulating information in the central nervous system. It is involved in muscle control, sensory perception, memory, emotions, and speech.",
            "chineseTranslation": "灰质",
            "traditionalChineseTranslation": "灰質",
            "lesson": 7
        },
        {
            "word": "white matter",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A tissue in the brain and spinal cord that consists mostly of myelinated axons.",
            "explanation": "White matter is responsible for the transmission of signals between different regions of the brain and between the brain and spinal cord. It is composed mainly of myelinated nerve fibers, which appear white due to the myelin sheath that covers the axons, facilitating faster signal conduction.",
            "chineseTranslation": "白质",
            "traditionalChineseTranslation": "白質",
            "lesson": 7
        },
        {
            "word": "cerebellum",
            "prefix": "",
            "root": "cerebell-",
            "suffix": "-um",
            "meaning": "the part of the brain that coordinates muscle movements and maintains posture and balance.",
            "explanation": "The cerebellum is located at the back of the brain, below the cerebrum. It plays an important role in motor control and is involved in some cognitive functions such as attention and language.",
            "chineseTranslation": "小脑",
            "traditionalChineseTranslation": "小腦",
            "lesson": 7
        },
        {
            "word": "cerebral cortex",
            "prefix": "",
            "root": "cerebrum (cerebral)",
            "suffix": "cortex",
            "meaning": "the outer layer of neural tissue of the cerebrum of the brain, involved in various high-level functions such as perception, thought, and decision-making.",
            "explanation": "The cerebral cortex is essential for many complex brain functions including sensory perception, cognition, generation of motor commands, spatial reasoning, and language.",
            "chineseTranslation": "大脑皮层",
            "traditionalChineseTranslation": "大腦皮層",
            "lesson": 7
        },
        {
            "word": "cerebrum",
            "prefix": "",
            "root": "cerebr",
            "suffix": "um",
            "meaning": "the largest part of the brain, responsible for higher brain functions such as thought and action",
            "explanation": "The cerebrum is divided into two hemispheres and is involved in complex tasks including reasoning, problem-solving, and sensory processing.",
            "chineseTranslation": "大脑",
            "traditionalChineseTranslation": "大腦",
            "lesson": 7
        },
        {
            "word": "diencephalon",
            "prefix": "di-",
            "root": "encephal",
            "suffix": "-on",
            "meaning": "the part of the brain located between the cerebral hemispheres and the brainstem, including structures such as the thalamus and hypothalamus",
            "explanation": "The diencephalon plays crucial roles in sensory and motor signal relay, as well as the regulation of bodily functions including temperature, thirst, and sleep.",
            "chineseTranslation": "间脑",
            "traditionalChineseTranslation": "間腦",
            "lesson": 7
        },
        {
            "word": "brain stem",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the part of the brain that connects the cerebrum with the spinal cord and regulates vital functions such as breathing and heart rate.",
            "explanation": "The brain stem is a critical structure in the central nervous system that controls basic life functions. It includes the midbrain, pons, and medulla oblongata, serving as a relay station for signals between the brain and the rest of the body.",
            "chineseTranslation": "脑干",
            "traditionalChineseTranslation": "腦幹",
            "lesson": 7
        },
        {
            "word": "amygdala",
            "prefix": "",
            "root": "amygdal-",
            "suffix": "",
            "meaning": "a part of the brain involved in processing emotions and memory.",
            "explanation": "The amygdala is an almond-shaped cluster of nuclei located within the temporal lobe of the brain. It plays a key role in emotional processing and is involved in functions such as fear responses and the formation of emotional memories.",
            "chineseTranslation": "扁桃体",
            "traditionalChineseTranslation": "扁桃體",
            "lesson": 7
        },
        {
            "word": "hippocampus",
            "prefix": "",
            "root": "hippo- (meaning horse) + campus (meaning field)",
            "suffix": "",
            "meaning": "A curved structure in the brain that is associated with memory and navigation.",
            "explanation": "The hippocampus is vital for the formation of new memories and is involved in learning and emotions. It is located within the medial temporal lobe of the brain.",
            "chineseTranslation": "海马体",
            "traditionalChineseTranslation": "海馬體",
            "lesson": 7
        },
        {
            "word": "frontal lobe",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the brain located at the front of each cerebral hemisphere responsible for higher cognitive functions, including reasoning, planning, and problem-solving.",
            "explanation": "The frontal lobe is involved in a variety of functions, including motor control, emotions, and personality. It is crucial for reasoning and complex thought processes.",
            "chineseTranslation": "额叶",
            "traditionalChineseTranslation": "額葉",
            "lesson": 7
        },
        {
            "word": "parietal lobe",
            "prefix": "",
            "root": "parietal",
            "suffix": "",
            "meaning": "the part of the brain located at the top and back of the cerebral cortex, responsible for processing sensory information.",
            "explanation": "The parietal lobe is involved in various functions including the perception of touch, pain, temperature, and proprioception, as well as integrating sensory information from different modalities.",
            "chineseTranslation": "顶叶",
            "traditionalChineseTranslation": "頂葉",
            "lesson": 7
        },
        {
            "word": "occipital lobe",
            "prefix": "",
            "root": "occipit-",
            "suffix": "-al",
            "meaning": "The lobe located at the back of the brain that is primarily responsible for vision.",
            "explanation": "The occipital lobe is one of the four main lobes of the cerebral hemisphere in the brain. It processes visual information received from the eyes and is involved in interpreting and understanding what we see.",
            "chineseTranslation": "枕叶",
            "traditionalChineseTranslation": "枕葉",
            "lesson": 7
        },
        {
            "word": "temporal lobe",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "the region of the brain associated with processing auditory information, memory, and emotion",
            "explanation": "The temporal lobe is one of the four main lobes of the cerebral cortex in the brain. It plays a key role in the processing of auditory stimuli, as well as being involved in the formation of memories and emotional responses.",
            "chineseTranslation": "颞叶",
            "traditionalChineseTranslation": "顳葉",
            "lesson": 7
        },
        {
            "word": "thalamus",
            "prefix": "",
            "root": "thalam-",
            "suffix": "",
            "meaning": "A large mass of gray matter in the brain that acts as a relay station for sensory and motor signals to the cerebral cortex.",
            "explanation": "The thalamus is located near the center of the brain and plays a key role in processing and transmitting information from the senses to the appropriate areas of the brain for interpretation and response.",
            "chineseTranslation": "丘脑",
            "traditionalChineseTranslation": "丘腦",
            "lesson": 7
        },
        {
            "word": "hypothalamus",
            "prefix": "hypo-",
            "root": "thalamus",
            "suffix": "",
            "meaning": "a small region of the brain that controls various autonomic functions, including hunger, thirst, sleep, and temperature regulation",
            "explanation": "The hypothalamus is located below the thalamus in the brain and plays a crucial role in maintaining homeostasis by regulating various physiological processes. It influences the autonomic nervous system and connects the nervous system to the endocrine system through the pituitary gland.",
            "chineseTranslation": "下丘脑",
            "traditionalChineseTranslation": "下丘腦",
            "lesson": 7
        },
        {
            "word": "brain stem",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The part of the brain that connects the cerebrum with the spinal cord, responsible for essential functions such as breathing, heart rate, and blood pressure.",
            "explanation": "The brain stem is a crucial part of the central nervous system, composed of three main parts: the midbrain, pons, and medulla oblongata. It controls many automatic functions necessary for survival and also serves as a conduit for signals between the brain and the rest of the body.",
            "chineseTranslation": "脑干",
            "traditionalChineseTranslation": "腦幹",
            "lesson": 7
        },
        {
            "word": "spinal cord",
            "prefix": "",
            "root": "spine",
            "suffix": "cord",
            "meaning": "the part of the central nervous system that runs through the vertebral column and transmits signals between the brain and the rest of the body",
            "explanation": "The spinal cord is a cylindrical structure that is encased in the vertebral column and serves as a major conduit for information traveling between the brain and the peripheral nervous system.",
            "chineseTranslation": "脊髓",
            "traditionalChineseTranslation": "脊髓",
            "lesson": 7
        },
        {
            "word": "meninges",
            "prefix": "",
            "root": "mening",
            "suffix": "es",
            "meaning": "the three protective membranes that cover the brain and spinal cord",
            "explanation": "The meninges consist of three layers: the dura mater, arachnoid mater, and pia mater, providing protection and support to the central nervous system.",
            "chineseTranslation": "脑膜",
            "traditionalChineseTranslation": "腦膜",
            "lesson": 7
        },
        {
            "word": "syncope",
            "meaning": "a temporary loss of consciousness or fainting, usually due to a decrease in blood flow to the brain.",
            "chineseTranslation": "晕厥",
            "traditionalChineseTranslation": "暈厥",
            "explanation": "Syncope is often caused by various factors such as dehydration, low blood pressure, or heart problems. It results in a brief loss of consciousness and usually resolves on its own without medical intervention.",
            "prefix": "syn-",
            "root": "cope",
            "suffix": "",
            "lesson": 7
        },
        {
            "word": "coma",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a state of prolonged unconsciousness",
            "explanation": "In this state, a person is unresponsive and cannot be awakened, even by stimuli that would normally elicit a response.",
            "chineseTranslation": "昏迷",
            "traditionalChineseTranslation": "昏迷",
            "lesson": 7
        },
        {
            "word": "delirium",
            "prefix": "",
            "root": "delir",
            "suffix": "ium",
            "meaning": "a disturbed state of mind characterized by confused thinking and reduced awareness of the environment.",
            "explanation": "Delirium is often caused by underlying medical conditions, medications, or withdrawal from substances and manifests as severe confusion and disorientation.",
            "chineseTranslation": "谵妄",
            "traditionalChineseTranslation": "癡呆",
            "lesson": 7
        },
        {
            "word": "dementia",
            "prefix": "de-",
            "root": "ment",
            "suffix": "-ia",
            "meaning": "a chronic or persistent disorder of the mental processes caused by brain disease or injury and marked by memory disorders, personality changes, and impaired reasoning.",
            "explanation": "Dementia is a decline in cognitive function that affects daily living and is characterized by a reduction in the ability to think, remember, and make decisions.",
            "chineseTranslation": "痴呆",
            "traditionalChineseTranslation": "癡呆",
            "lesson": 7
        },
        {
            "word": "seizure",
            "prefix": "",
            "root": "seiz",
            "suffix": "ure",
            "meaning": "a sudden, uncontrolled electrical disturbance in the brain that can cause convulsions, muscle spasms, and loss of consciousness.",
            "explanation": "Seizures can vary in severity and duration, and they may be caused by various factors, including epilepsy, head injury, or infections.",
            "chineseTranslation": "癲癇",
            "traditionalChineseTranslation": "癲癇",
            "lesson": 7
        },
        {
            "word": "epilepsy",
            "prefix": "epi-",
            "root": "lepsia",
            "suffix": "",
            "meaning": "a neurological disorder characterized by recurrent seizures",
            "explanation": "Epilepsy is a chronic disorder of the brain that causes unprovoked, recurrent seizures. It can affect anyone, and the severity and type of seizures may vary.",
            "chineseTranslation": "癫痫",
            "traditionalChineseTranslation": "癲癇",
            "lesson": 7
        },
        {
            "word": "convulsion",
            "prefix": "",
            "root": "vuls",
            "suffix": "ion",
            "meaning": "a sudden, violent, irregular movement of a limb or of the body.",
            "explanation": "Convulsion refers to a physical condition characterized by a series of involuntary muscle contractions that can affect one or more parts of the body. It is often associated with neurological disorders, such as epilepsy.",
            "chineseTranslation": "抽搐",
            "traditionalChineseTranslation": "抽搐",
            "lesson": 7
        },
        {
            "word": "tremor",
            "prefix": "",
            "root": "trem",
            "suffix": "",
            "meaning": "an involuntary, rhythmic shaking or quivering movement",
            "explanation": "Tremor refers to oscillatory movements of a part of the body, often caused by muscular contractions. They can occur at rest or during movement and can be associated with various neurological conditions.",
            "chineseTranslation": "震颤",
            "traditionalChineseTranslation": "震顫",
            "lesson": 7
        },
        {
            "word": "migraine",
            "prefix": "",
            "root": "migra-",
            "suffix": "",
            "meaning": "a recurrent throbbing headache that typically affects one side of the head.",
            "explanation": "Migraines are often accompanied by nausea, vomiting, and extreme sensitivity to light and sound. They may last for hours or even days and can significantly impair daily activities.",
            "chineseTranslation": "偏头痛",
            "traditionalChineseTranslation": "偏頭痛",
            "lesson": 7
        },
        {
            "word": "paralysis",
            "prefix": "para-",
            "root": "lysi",
            "suffix": "-s",
            "meaning": "loss of the power of motion in one or more muscles",
            "explanation": "Paralysis involves a complete loss of muscle function, which can result from various causes including injury, disease, or disorders affecting the nervous system.",
            "chineseTranslation": "瘫痪",
            "traditionalChineseTranslation": "癱瘓",
            "lesson": 7
        },
        {
            "word": "hemiplegia",
            "prefix": "hemi-",
            "root": "plegia",
            "suffix": "",
            "meaning": "paralysis of one side of the body",
            "explanation": "Hemiplegia is a condition characterized by the complete paralysis of one side of the body, often caused by a stroke or brain injury.",
            "chineseTranslation": "半身不遂",
            "traditionalChineseTranslation": "半身不遂",
            "lesson": 7
        },
        {
            "word": "paraplegia",
            "meaning": "paralysis of the lower half of the body, typically resulting from injury to the spinal cord.",
            "chineseTranslation": "截瘫",
            "traditionalChineseTranslation": "截癱",
            "explanation": "Paraplegia is the loss of movement and sensation in the lower part of the body due to damage to the spinal cord, generally affecting the legs and lower trunk.",
            "prefix": "para-",
            "root": "plegia",
            "suffix": "",
            "lesson": 7
        },
        {
            "word": "Bell's Palsy",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "A temporary condition that causes weakness or paralysis of the muscles on one side of the face.",
            "explanation": "Bell's Palsy is believed to be caused by inflammation of the facial nerve, leading to sudden, temporary weakness or paralysis of the facial muscles, often appearing overnight.",
            "chineseTranslation": "贝尔麻痹",
            "traditionalChineseTranslation": "貝爾麻痺",
            "lesson": 7
        },
        {
            "word": "Parkinson's disease",
            "prefix": "",
            "root": "Parkinson",
            "suffix": "'s disease",
            "meaning": "A progressive neurological disorder that affects movement and coordination.",
            "explanation": "Parkinson's disease is characterized by the degeneration of dopamine-producing neurons in the brain, leading to symptoms such as tremors, stiffness, and bradykinesia (slowness of movement).",
            "chineseTranslation": "帕金森病",
            "traditionalChineseTranslation": "帕金森病",
            "lesson": 7
        },
        {
            "word": "cerebrovascular accident",
            "meaning": "a medical condition resulting from a disruption in blood supply to the brain, commonly referred to as a stroke.",
            "chineseTranslation": "脑血管意外",
            "traditionalChineseTranslation": "腦血管意外",
            "explanation": "This condition can result in various neurological deficits depending on the area of the brain affected and the extent of the damage caused by the lack of blood flow.",
            "prefix": "",
            "root": "cerebrovascular",
            "suffix": "accident",
            "lesson": 7
        },
        {
            "word": "transient ischemic attack",
            "prefix": "trans-",
            "root": "ient ischemic",
            "suffix": "attack",
            "meaning": "a temporary period of symptoms similar to those of a stroke",
            "explanation": "A transient ischemic attack (TIA) is often called a mini-stroke, as it typically lasts a few minutes to a few hours and may precede a full stroke.",
            "chineseTranslation": "短暂性缺血发作",
            "traditionalChineseTranslation": "短暫性缺血發作",
            "lesson": 7
        },
        {
            "word": "cerebral aneurysm",
            "prefix": "cerebr-",
            "root": "aneurysm",
            "suffix": "",
            "meaning": "a bulging, weak area in the wall of a blood vessel in the brain",
            "explanation": "Cerebral aneurysm is a condition where a blood vessel in the brain weakens and bulges out, leading to potential rupture and bleeding in the brain, which can cause serious health issues.",
            "chineseTranslation": "脑动脉瘤",
            "traditionalChineseTranslation": "腦動脈瘤",
            "lesson": 7
        },
        {
            "word": "concussion",
            "prefix": "con-",
            "root": "cuss",
            "suffix": "",
            "meaning": "A type of traumatic brain injury caused by a blow to the head or body that causes the brain to move rapidly back and forth within the skull.",
            "explanation": "Concussions can affect brain function and may lead to symptoms such as headaches, confusion, dizziness, and memory problems.",
            "chineseTranslation": "脑震荡",
            "traditionalChineseTranslation": "腦震盪",
            "lesson": 7
        },
        {
            "word": "poliomyelitis",
            "prefix": "poli-",
            "root": "myel",
            "suffix": "-itis",
            "meaning": "An infectious disease caused by the poliovirus, characterized by inflammation of the spinal cord and potential paralysis.",
            "explanation": "Poliomyelitis primarily affects children and can result in varying degrees of paralysis. Vaccination has significantly reduced its prevalence.",
            "chineseTranslation": "小儿麻痹症",
            "traditionalChineseTranslation": "小兒麻痺症",
            "lesson": 7
        },
        {
            "word": "multiple sclerosis",
            "prefix": "",
            "root": "sclerosis",
            "suffix": "multiple",
            "meaning": "A chronic disease characterized by the degeneration of the protective covering of nerve fibers in the central nervous system, leading to various neurological symptoms.",
            "explanation": "Multiple sclerosis is an autoimmune disorder where the immune system attacks the myelin sheath, causing communication problems between the brain and the rest of the body.",
            "chineseTranslation": "多发性硬化症",
            "traditionalChineseTranslation": "多發性硬化症",
            "lesson": 7
        },
        {
            "word": "shingles",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "a viral infection that causes a painful rash, often in the form of blisters; caused by the varicella-zoster virus.",
            "explanation": "Shingles occurs when the varicella-zoster virus, which causes chickenpox, reactivates in the body. It typically presents as a painful, blistering rash on one side of the body and is accompanied by other symptoms such as pain, itching, and fever.",
            "chineseTranslation": "带状疱疹",
            "traditionalChineseTranslation": "帶狀皰疹",
            "lesson": 7
        },
        {
            "word": "electroencephalography",
            "prefix": "electro-",
            "root": "encephal/o",
            "suffix": "-graphy",
            "meaning": "a test used to detect abnormalities in the electrical activity of the brain",
            "explanation": "Electroencephalography (EEG) records the electrical activity of the brain using electrodes placed on the scalp. It is used to diagnose conditions such as epilepsy and other brain disorders.",
            "chineseTranslation": "脑电图检查",
            "traditionalChineseTranslation": "腦電圖檢查",
            "lesson": 7
        },
        {
            "word": "myopia",
            "prefix": "",
            "root": "myop",
            "suffix": "-ia",
            "meaning": "A condition of the eye where distant objects appear blurry while close objects can be seen clearly.",
            "explanation": "Myopia, also known as nearsightedness, occurs when the shape of the eye causes light rays to focus in front of the retina instead of directly on it, leading to difficulty seeing distant objects.",
            "chineseTranslation": "近视",
            "traditionalChineseTranslation": "近視",
            "lesson": 7
        },
        {
            "word": "hyperopia",
            "prefix": "hyper-",
            "root": "opia",
            "suffix": "",
            "meaning": "a condition of the eye where distant objects may be seen more clearly than nearby objects; also known as farsightedness.",
            "explanation": "Hyperopia occurs when light entering the eye is focused behind the retina, often due to an eyeball that is too short or cornea that is too flat, making it difficult to see objects that are close.",
            "chineseTranslation": "远视",
            "traditionalChineseTranslation": "遠視",
            "lesson": 7
        },
        {
            "word": "presbyopia",
            "prefix": "presby-",
            "root": "opia",
            "suffix": "",
            "meaning": "a gradual loss of the eye's ability to focus on nearby objects due to aging",
            "explanation": "Presbyopia is a condition associated with aging, where the lens of the eye becomes less flexible, making it difficult to focus on close objects.",
            "chineseTranslation": "老花眼",
            "traditionalChineseTranslation": "老花眼",
            "lesson": 7
        },
        {
            "word": "astigmatism",
            "prefix": "a-",
            "root": "stigmat-",
            "suffix": "-ism",
            "meaning": "a condition in which the eye does not focus light evenly onto the retina due to an irregular shape of the cornea or lens",
            "explanation": "Astigmatism is often caused by an irregular curvature of the cornea or lens, which leads to distorted or blurred vision because light rays are not focused to a single point on the retina.",
            "chineseTranslation": "散光",
            "traditionalChineseTranslation": "散光",
            "lesson": 7
        },
        {
            "word": "ophthalmology",
            "prefix": "ophthalmo-",
            "root": "logy",
            "suffix": "",
            "meaning": "the branch of medicine and surgery that is concerned with the diagnosis and treatment of eye disorders.",
            "explanation": "Ophthalmology involves the study of the anatomy, physiology, and diseases of the eye as well as their treatment. It can include surgical procedures as well as the prescription of corrective lenses.",
            "chineseTranslation": "眼科学",
            "traditionalChineseTranslation": "眼科學",
            "lesson": 7
        },
        {
            "word": "cataract",
            "meaning": "A clouding of the lens of the eye, which leads to a decrease in vision.",
            "chineseTranslation": "白内障",
            "traditionalChineseTranslation": "白內障",
            "explanation": "Cataracts can develop slowly and affect one or both eyes. They are common in older adults but can also occur due to genetic factors, trauma, or underlying health conditions.",
            "prefix": "",
            "root": "cata",
            "suffix": "-act",
            "lesson": 7
        },
        {
            "word": "glaucoma",
            "prefix": "",
            "root": "glauc-",
            "suffix": "-oma",
            "meaning": "a group of eye conditions that damage the optic nerve and can result in vision loss and blindness, often associated with increased pressure in the eye.",
            "explanation": "Glaucoma is often caused by an abnormal buildup of fluid in the eyes, leading to increased intraocular pressure. It can be asymptomatic in the early stages, making regular eye examinations crucial for detection.",
            "chineseTranslation": "青光眼",
            "traditionalChineseTranslation": "青光眼",
            "lesson": 7
        },
        {
            "word": "intraocular lens",
            "prefix": "intra-",
            "root": "ocular",
            "suffix": "lens",
            "meaning": "A synthetic lens implanted in the eye to replace the eye's natural lens, typically used during cataract surgery.",
            "explanation": "Intraocular lenses are used to restore clear vision after the natural lens of the eye is removed due to cataracts or other eye conditions. They can be monofocal, multifocal, or accommodating, depending on the vision needs of the patient.",
            "chineseTranslation": "眼内镜片",
            "traditionalChineseTranslation": "眼內鏡片",
            "lesson": 7
        },
        {
            "word": "auricle",
            "prefix": "",
            "root": "auric-",
            "suffix": "",
            "meaning": "the outer ear or the ear-shaped appendage of the heart",
            "explanation": "In anatomy, the term 'auricle' refers to either the visible part of the ear that collects sound waves, or it describes the ear-like structure associated with the atrium of the heart.",
            "chineseTranslation": "耳廓",
            "traditionalChineseTranslation": "耳廓",
            "lesson": 7
        },
        {
            "word": "external auditory canal",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "The passageway leading from the external ear to the eardrum.",
            "explanation": "The external auditory canal, also known as the ear canal, is a tube that carries sound from the outer ear to the eardrum. It plays an important role in hearing as it helps to direct sound waves towards the tympanic membrane (eardrum).",
            "chineseTranslation": "外耳道",
            "traditionalChineseTranslation": "外耳道",
            "lesson": 7
        },
        {
            "word": "tympanic membrane",
            "prefix": "",
            "root": "tympan-",
            "suffix": "-ic",
            "meaning": "A thin membrane that separates the external ear from the middle ear and vibrates in response to sound waves, commonly referred to as the eardrum.",
            "explanation": "The tympanic membrane plays a critical role in hearing; it converts sound waves into mechanical vibrations that are then transmitted to the bones in the middle ear.",
            "chineseTranslation": "鼓膜",
            "traditionalChineseTranslation": "鼓膜",
            "lesson": 7
        },
        {
            "word": "malleus",
            "prefix": "",
            "root": "malleus",
            "suffix": "",
            "meaning": "a small bone in the middle ear that resembles a hammer",
            "explanation": "The malleus is one of three auditory ossicles in the middle ear; it transmits sound vibrations from the eardrum to the inner ear.",
            "chineseTranslation": "锤骨",
            "traditionalChineseTranslation": "錘骨",
            "lesson": 7
        },
        {
            "word": "incus",
            "prefix": "",
            "root": "incus",
            "suffix": "",
            "meaning": "a small bone in the middle ear that helps transmit sound vibrations.",
            "explanation": "The incus, also known as the anvil, is one of the three ossicles in the middle ear. It plays a critical role in the auditory system by transmitting sound vibrations from the malleus (the hammer) to the stapes (the stirrup) before they reach the inner ear.",
            "chineseTranslation": "砧骨",
            "traditionalChineseTranslation": "砧骨",
            "lesson": 7
        },
        {
            "word": "stapes",
            "prefix": "",
            "root": "",
            "suffix": "",
            "meaning": "one of the three small bones in the middle ear that helps transmit sound vibrations to the inner ear",
            "explanation": "The stapes is the smallest bone in the human body and is shaped like a stirrup. It connects to the oval window of the cochlea and plays a crucial role in hearing by transmitting sound vibrations from the incus to the inner ear.",
            "chineseTranslation": "镫骨",
            "traditionalChineseTranslation": "鐙骨",
            "lesson": 7
        }
    ]
}